{
    "data": [
        {
            "title": "Japan’s stocks still under shadow of BOJ unwinding bond holdings",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The Bank of Japan (BOJ) is fine-tuning its pullback from the bond market but this mustn’t obscure the fact that quantitative tightening is well underway and likely to cause instability in some stocks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The potential impact of quantitative tightening may cast a shadow on the Nikkei 225 Stock Average’s chances of climbing further after hitting four-month highs this week. The blue-chip index is skewed towards growth stocks such as Fast Retailing Co, which owns the Uniqlo casual clothing chain, and chip-related firms Advantest Corp and Tokyo Electron Ltd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On top of growth stocks, which are known to be susceptible to higher bond yields, large-cap shares are vulnerable. The negative correlation of these shares with bond yields is increasing, said Akemi Hatano, the chief quantitative analyst of SBI Securities Co.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This highlights the need for vigilance among investors even after the BOJ this week announced a plan to reduce the pace of tapering in its bond purchases. That move was seen as stabilising the market after recent sharp moves higher in Japanese government bond yields that rippled across global debt markets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Rising bond volatility will have a big impact on how investors select stocks,” said Hatano. Large and blue-chip shares are vulnerable when it spikes because “they are the most convenient to reduce risks when investors want to cut their risk exposure in a short period of time”, she said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The BOJ started unwinding its massive bond buying last August but the pace has been slow. Its holdings fell ¥16.7 trillion (US$115 billion) over the past year. That’s a drop of less than 3%, which compares with a decline of about 10% in Treasuries on the Federal Reserve’s (Fed) balance sheet in its first year of quantitative tightening (QT).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The real impact of the BOJ’s will still be felt longer-term, said Masao Muraki, a senior analyst at SMBC Nikko Securities Inc. “We now expect QT to enter a phase of reducing excess liquidity in the banking sector, and this will trigger fiercer competition for deposits, and market instability,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>To be sure, fears that balance sheet reductions will hugely unsettle Japan’s markets may be overblown. One could argue that US stocks have remained resilient overall, despite the Fed’s unwinding of its holdings that began in 2022. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Even so, the big sell-off in Japanese bonds last month was a wake-up call for equity investors on the risk of rising yields.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Asset classes that have benefited from quantitative easing such as stocks could be affected by quantitative tightening,” said Muraki. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded</em> <em>by</em> <em>Isabelle</em> <em>Francis</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759737",
            "pub_date": "2025-06-20 09:51:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US futures drop as Trump weighs strikes on Iran",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Oil trimmed earlier gains and equity futures remained lower after White House press secretary Karoline Leavitt said US President Donald Trump will decide within two weeks whether to back Israel militarily in its conflict with Iran. The remarks offered some short-term clarity but did little to resolve broader uncertainty around potential US involvement and the risk of renewed energy-driven inflation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>S&amp;P 500 contracts slipped 0.9% in thin holiday trading. Europe’s Stoxx 600 dropped 0.8%, falling for a third straight session. Asian equities declined 1.4%, with losses concentrated in Japan and South Korea.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>West Texas Intermediate rose 0.7% to US$75.8 a barrel. Brent crude advanced past US$78 a barrel, extending gains in a week where market reaction to the Middle East conflict has been most concentrated in oil. The dollar was little-changed against a basket of currencies, after paring earlier gains.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Traders’ sentiment turned more cautious following a Bloomberg report that senior US officials are preparing for a possible strike on Iran in the coming days. Markets were already on edge after the Federal Reserve downgraded its estimates for growth this year and projected higher inflation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“If the US does strike, you are going to see a big knee-jerk reaction,” said Neil Wilson, an investor strategist at Saxo UK. “No one will be wanting to make big long bets.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Israel struck more of Iran’s nuclear sites on Thursday and warned its attacks could bring down Tehran’s leadership as both sides awaited a decision from Trump on whether to join the offensive.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The odds for the US to become involved are “quite high at this moment in time,” said Anna Rosenberg, the head of geopolitics at Amundi Investment Institute.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“For the US, this is a moment to take out a big geopolitical headache, which is Iran potentially developing a nuclear weapon,” Rosenberg told <em>Bloomberg</em> <em>TV</em>. “Having said that, acting comes with a lot of consequences too. Trump will have to make a really difficult decision.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Among a flurry of monetary policy decisions in Europe, the Bank of England kept its benchmark rate on hold at 4.25%. While the outcome was in line with economists’ expectations, more committee members than anticipated had voted for a cut. The pound fell before erasing the loss.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Earlier, the Swiss National Bank cut its interest rate to zero as policymakers sought to deter investors from pushing up the franc, which has gained almost 10% against the dollar this year. In Norway, officials surprised with the central bank’s first post-pandemic reduction of borrowing costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Some extreme scenarios resulting from increased US involvement in the Israel-Iran war could push oil prices as high as US$130 to US$150 a barrel, particularly if Iran retaliates in a major way, said Jennifer McKeown, the chief global economist of Capital Economics Ltd. Such a development would pause further policy easing by central banks, she said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Even though central banks would like to think that would be a temporary impact, I think it would be a brave central bank that would cut interest rates,” McKeown told <em>Bloomberg</em> <em>TV</em>.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Brent futures have been pricing in a geopolitical premium of about US$8 a barrel since Israel and Iran began attacking each other last week, according to a survey of analysts and traders. US intervention in the conflict would bolster that further, but exactly how much would depend on the nature of the involvement, the nine respondents said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded</em> <em>by</em> <em>Isabelle</em> <em>Francis</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759735",
            "pub_date": "2025-06-20 09:41:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says signed order extending deadline for TikTok closing",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>WASHINGTON (June 20): US President Donald Trump said on Thursday that he extended the June 19 deadline for China-based ByteDance to divest the US assets of short-video app TikTok for 90 more days.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"I've just signed the Executive Order extending the Deadline for the TikTok closing for 90 days (September 17, 2025),\" he said in a Truth Social post, which included a copy of the document.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump had already twice granted a reprieve from federal enforcement of a law that mandated the sale or shutdown of TikTok that was supposed to take effect in January.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump has said he wants to keep the app, which helped him woo young voters in the 2024 presidential election, active. He has also expressed optimism that Chinese President Xi Jinping would approve a deal that preserves the app in the United States.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>TikTok said in a statement that \"we are grateful for President Trump's leadership and support in ensuring that TikTok continues to be available for more than 170 million American users and 7.5 million US businesses that rely on the platform as we continue to work with Vice President (JD) Vance's office.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759731",
            "pub_date": "2025-06-20 09:31:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU increasingly resigned to 10% baseline tariff in US trade talks, European sources say",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BRUSSELS (June 19): European officials are increasingly resigned to a 10% rate on \"reciprocal\" tariffs being the baseline in any trade deal between the United States and the European Union, five sources familiar with the negotiations said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>President Donald Trump has announced wide-ranging tariffs on trade partners and wants to reduce the US goods trade deficit with the EU. US Commerce Secretary Howard Lutnick has ruled out going below a 10% baseline rate for the so-called reciprocal tariffs that cover most goods the EU exports to the US.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>EU negotiators are still pressing for the rate to be lower than 10%, said the European sources, who spoke on condition of anonymity because of the sensitivity of the talks.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But one of the sources, an EU official, said negotiating the level down had become harder since the US started drawing revenues from its global tariffs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"10% is a sticky issue. We are pressing them but now they are getting revenues,\" said the official.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A second European source said there had been no acceptance by the EU of 10% as the baseline rate at talks, but acknowledged that it would be difficult to change or abolish that baseline.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A spokesperson for the European Commission, the EU's executive body which negotiates trade deals for the 27-nation bloc, did not respond to a Reuters request for comment. The US government also did not immediately comment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US officials have long worked on the assumption that America will end up with higher tariffs with its trading partners and do not expect to move away from the 10% tariff rate in talks with the EU.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US Treasury Secretary Scott Bessent told the \"Pod Force One\" podcast in an interview broadcast Wednesday that Trump’s decision to double tariffs had spurred greater willingness on the part of European leaders to negotiate.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The EU has said publicly it will not settle for a double-digit baseline rate — as did Britain, which agreed a limited trade deal in May that retains 10% tariffs on British exports while cutting higher rates for steel and cars.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump has hit Europe with a 50% tariff on steel and aluminium and a 25% levy on cars, and the EU is trying to secure a deal before July 9, when reciprocal tariffs on most other goods could rise from 10% to up to 50%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>With an annual trade surplus of US$236 billion with the U.S. in 2024, the EU has more to lose from tariffs than non-EU member Britain, which runs a trade deficit with the U.S.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump, who has said he wants to use tariff revenues to help finance his sweeping tax-cut and spending bill, said on Tuesday the EU was not offering a fair deal.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Washington has sought to fold non-tariff barriers, such as digital services taxes and corporate sustainability reporting rules, as well as LNG sales and food standards into the talks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US posted a US$258-billion budget surplus for April, up 23% from a year earlier, and the Treasury Department said net customs duties in April more than doubled versus the same period last year.</p></div>\n<h3>Tariff impact</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The sweeping tariffs imposed by Trump since early April and the subsequent pauses on some of them have generated upheaval for companies worldwide, causing some to withdraw or refrain from giving financial guidance.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European automakers have been hit hard. Mercedes pulled its earnings guidance, Stellantis suspended its guidance and Volvo Cars withdrew its earnings forecasts for the next two years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One European car executive said premium carmakers could stomach a 10% tariff but that it would be much tougher for a mass-market producer.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The tariffs targeting steel and aluminium, and cars and car parts, were applied on grounds of national security, with investigations into pharmaceuticals, semiconductors, timber and trucks possibly leading to further increased duties. EU officials say they are not willing to accept these.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump said on Tuesday that pharma tariffs were \"coming very soon\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A pharma industry source said the European Commission was resisting sector-specific tariffs. The Commission has told the pharma industry that while it does not want the 10% baseline reciprocal tariffs, accepting a 10% base tariff may provide leverage in those negotiations, the source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A European beverage industry source said the wine and spirits sector would rather have a deal at 10% than protracted negotiations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Not securing a deal would have a \"huge negative impact... on our market,\" said Rob van Gils, CEO of Austrian company Hammerer Aluminium Industries. \"It can be 0 it can be 10%. If it’s both ways that’s all manageable. It will not kill business.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One EU official said a 10% baseline rate would \"not massively erode competitive positions, especially if others receive the same treatment.\" </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759728",
            "pub_date": "2025-06-20 09:11:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MSM, Malakoff, Astro, Cuckoo International, Oriental Kopi, Bank Islam, Ivory Properties, Petron Malaysia, Deleum, Advancecon, CTOS Digital, Infomina, Theta Edge, Agmo",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Here is a brief recap of Thursday’s top local business news and corporate announcements:</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>MSM Malaysia Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5202\" target=\"_blank\">MSM</a>) expects the 5% sales and service tax (SST) on raw sugar to pressure input costs, which could in turn push up prices of refined sugar for industrial buyers. Although the tax only applies to raw sugar and not refined sugar, it would still indirectly push up the cost of production for local refiners, said group chief executive officer Syed Feizal Syed Mohammad. MSM, one of only two sugar refiners in the country, is currently seeking clarification from the government regarding the tax imposed on raw sugar effective July 1. — <a href=\"https://theedgemalaysia.com/node/759646\" target=\"_blank\"><i>MSM flags cost pressures from 5% SST on raw sugar; still in talks with govt on price mechanism</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The country’s second waste-to-energy (WTE) plant, costing RM660 million, will be built in Sungai Udang, Melaka, and is expected to be fully operational by 2029. Housing and Local Government Minister Nga Kor Ming said the Sungai Udang WTE project had undergone an open tender process and would be implemented through a public-private partnership approach between the Ministry of Housing and Local Government (KPKT) and a consortium comprising <b>Malakoff Corporation Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5264\" target=\"_blank\">MALAKOF</a>) and Alam Flora Environmental Solutions Sdn Bhd, based on the build, operate and own model. — <a href=\"https://theedgemalaysia.com/node/759627\" target=\"_blank\"><i>Malaysia's second WTE plant costing RM660m to be built in Sungai Udang, Melaka, says Nga</i></a></p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Astro Malaysia Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/6399\" target=\"_blank\">ASTRO</a>) said it will continue to invest in expanding its content offerings in lower subscription tiers and lowering entry pricing for Astro and its over-the-top platform sooka to grow its customer base, as it reported a 20.8% drop in its first quarter earnings. The group's net profit for the three months ended April 31, 2025 (1QFY2026) dropped to RM13.48 million from RM17.01 million, as revenue fell 9% from RM772.53 million to RM703.09 million. This decline was primarily driven by a 6% drop in television subscription revenue and a 13% fall in advertising revenue. — <a href=\"https://theedgemalaysia.com/node/759699\" target=\"_blank\"><i>Astro to continue to prioritise local content, affordable tiers as 1Q profit drops 21%</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Cuckoo International (MAL) Bhd</b>, which is set to be listed on the Main Market of Bursa Malaysia on June 24, said its net profit for the first quarter ended March 31, 2025 came in at RM27.86 million. Revenue for the quarter was RM296.38 million, said the Malaysian unit of South Korean home-appliance maker Cuckoo Holdings Co. Of the total revenue, 80% or RM237 million was contributed by the Cuckoo-branded segment while the Cuckoo co-created segment accounted for 19.7% or RM58.3 million. — <a href=\"https://theedgemalaysia.com/node/759698\" target=\"_blank\"><i>Cuckoo Malaysia reports RM27.9m 1Q net profit ahead of listing</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Newly listed kopitiam chain operator <b>Oriental Kopi Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0338\" target=\"_blank\">KOPI</a>) has entered into an agreement to acquire the premises it currently rents as its head office and warehousing facility in Puchong, Selangor, for RM23 million. The property comprises a 5,260.8-square-metre leasehold parcel of land with a factory unit erected on it. The vendor is Icon Facade Sdn Bhd, whose shareholders are Heng Ngeng Choo and Siau Fui Chien. — <a href=\"https://theedgemalaysia.com/node/759700\" target=\"_blank\"><i>Oriental Kopi to acquire Puchong HQ and warehouse for RM23 mil</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Bank Islam Malaysia Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5258\" target=\"_blank\">BIMB</a>) has secured a summary judgement against financially distressed <b>Ivory Properties Group Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5175\" target=\"_blank\">IVORY</a>) over unpaid loans totalling RM17.76 million. The High Court granted the judgement under Order 14 of the Rules of Court, allowing the case to be decided without a full trial.  Bank Islam terminated the facilities in October last year and demanded full repayment of the loan within 14 days, which Ivory Properties failed to settle. — <a href=\"https://theedgemalaysia.com/node/759703\" target=\"_blank\"><i>Bank Islam secures summary judgement against Ivory Properties over RM17.76 mil loan</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Petron Malaysia Refining &amp; Marketing Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/3042\" target=\"_blank\">PETRONM</a>) said it has been sued by its former transportation services provider over alleged negligent misrepresentation. The oil and gas company said Konsortium Lord-Saberkat Sdn Bhd is seeking a court declaration of negligent misrepresentation, along with RM135 million in special damages, RM5 million in aggravated damages and RM34 million in restitution. The claim relates to services provided under a transportation agreement between the two parties that expired in November 2013. — <a href=\"https://theedgemalaysia.com/node/759671\" target=\"_blank\"><i>Petron Malaysia sued again by ex-transport provider over alleged misrepresentation</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Deleum Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5132\" target=\"_blank\">DELEUM</a>) has secured a five-year contract from Hess Exploration and Production Malaysia BV for maintenance services and material supply of solar gas turbine generators in the North Malay Basin. The contract, effective June 10, was awarded via its 90%-owned indirect unit, Turboservices Sdn Bhd. While the contract value was not disclosed, it includes the supply of parts, engine exchanges, field services and equipment health management on a reimbursable basis. — <a href=\"https://theedgemalaysia.com/node/759676\" target=\"_blank\"><i>Deleum clinches turbine maintenance contract from Hess</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Advancecon Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5281\" target=\"_blank\">ADVCON</a>) said the group has issued a notice of adjudication to China Communications Construction (ECRL) Sdn Bhd (CCC) over a payment dispute relating to the East Coast Rail Link (ECRL) project. Its wholly-owned subsidiary, Advancecon Infra Sdn Bhd, is seeking RM15.22 million in outstanding payments from CCC, along with interest and other relief. The amount claimed is for subgrade, drainage and culvert works along two stretches of the ECRL for which Advancecon Infra was appointed as sub-contractor in 2020. — <a href=\"https://theedgemalaysia.com/node/759702\" target=\"_blank\"><i>Advancecon initiates adjudication over ECRL project works payment dispute</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Credit information provider<b> CTOS Digital Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5301\" target=\"_blank\">CTOS</a>) has entered into a strategic partnership with <b>Infomina Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0265\" target=\"_blank\">INFOM</a>), one of only four authorised service providers for Suruhanjaya Syarikat Malaysia (SSM) data, to gain access to real-time corporate data. The collaboration will enable CTOS to get direct Application Programming Interface (API) access to SSM data via Infomina’s advanced search platform, allowing real-time integration of company information into CTOS’ credit reporting ecosystem. — <a href=\"https://theedgemalaysia.com/node/759661\" target=\"_blank\"><i>CTOS partners Infomina to gain real-time access to SSM corporate data</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Theta Edge Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/9075\" target=\"_blank\">THETA</a>) is forming a joint venture company (JVCo) with <b>Agmo Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0258\" target=\"_blank\">AGMO</a>) to accelerate the commercialisation of artificial intelligence (AI), blockchain and platform-based services, with an initial emphasis on public sector transformation. The JVCo will be incorporated via Theta Technologies Sdn Bhd and Agmo Capital Sdn Bhd, holding 51% and 49% stakes respectively.  The initial growth strategy will centre around three core pillars: halal traceability intelligence, AI-driven digital health solutions, as well as super analytics and infrastructure dashboards. — <a href=\"https://theedgemalaysia.com/node/759690\" target=\"_blank\"><i>Theta Edge and Agmo form JV to drive AI and blockchain innovation</i></a></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759727",
            "pub_date": "2025-06-20 08:11:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flexidynamic buys loss-making manufacturer of glove formers",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Flexidynamic Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0231\" target=\"_blank\">FLEXI</a>) said on Thursday it is acquiring a loss-making manufacturer of glove formers, Formtech Engineering (M) Sdn Bhd, for RM10.39 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Although Formtech has accumulated losses of RM4.5 million, the acquisition offers long-term value and growth opportunities, as it will expand Flexidynamic’s portfolio and diversify its income streams, the group said in a filing with Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Formtech, which is based in Nilai, Negeri Sembilan, has been loss-making for the past three years, following industry-wide overexpansion in glove production capacity during the Covid-19 pandemic. It recorded a net loss of RM739,000 for the financial year ended Dec 31, 2022 (FY2022), RM8.89 million for FY2023 and RM828,000 for FY2024.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Flexidynamic said Formtech's audited net asset (NA) was RM3.8 million as at end-December 2024. \"Based on this, the purchase consideration of RM10.4 million represents a price to NA ratio of 2.75 times,\" the group noted.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Flexidynamic is acquiring Formtech from HARPS Investment Asia Pte Ltd (a 69.88% stake) and Dietmar Trumm and Valluvan Peramuthu (a 30.12% stake). The purchase will be fully funded through internally generated funds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Flexidynamic’s principal activities involve the provision of design, engineering, installation and commissioning of glove chlorination systems, as well as design and installation of storage tanks and process tanks for the glove manufacturing industry.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The group shall tap into its existing clientele to offer additional products (i.e. glove formers) and is confident to turnaround the financial results of Formtech,” Flexidynamic said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It noted that Formtech has an installed production capacity of 180,000 pieces per month, with a utilisation rate of 30% in the year ended Dec 31, 2024. The excess capacity at its existing glove former manufacturing facility allows Formtech to accommodate any increase in demand without incurring the time and cost of building a new facility. This will also enable Formtech to leverage Flexidynamic’s existing customer network to tap into additional untapped capacity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Moving forward, as both Formtech and Flexidynamic operate in the glove industry with non-overlapping customer bases, this allows for strong synergies and cross-selling opportunities for both companies. The proposed acquisition is expected to ramp up production capacity of both companies by leveraging on its respective existing marketing resources and is expected to improve the financial performance of both companies in future financial years,” said Flexidynamic.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of Flexidynamic rose 9.68% or 1.5 sen to close at 17 sen on Thursday, giving it a market capitalisation of RM46.5 million.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759726",
            "pub_date": "2025-06-20 07:51:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Petronas ready to play a role in energy supply solutions and sustainability",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Petroliam Nasional Bhd (Petronas) is ready to play a role in resolving energy supply issues while simultaneously addressing sustainability challenges.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Its president and group chief executive officer, Tan Sri Tengku Muhammad Taufik Tengku Aziz, said the three-day Energy Asia 2025 conference, which concluded on Wednesday, opened pathways and opportunities for cross-industry collaboration or cooperation that does not depend on a single industry alone.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He added that it also raised awareness in other sectors about challenges where carbon emissions must be addressed immediately.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Energy Asia has been regarded as a neutral platform without any underlying agenda, solely focused on supplying energy while tackling sustainability issues and challenges,” he said in an exclusive interview with Bernama TV on Wednesday. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Energy Asia 2025 conference, themed “Delivering Asia’s Energy Transition”, attracted some 4,092 delegates from June 16-18. The biennial event will return as Energy Asia 2027, scheduled for June 2-7, 2027.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tengku Muhammad Taufik said the sustainability agenda is currently quite challenging and threatened, yet it is prioritised because it relates to the continuity of energy supply, especially with conflicts in the Middle East and various uncertainties.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The uncertainty of this (energy) supply could undermine the sustainability agenda. So throughout the Energy Asia Conference, discussions cannot deny that the continuity agenda might be ahead, more prioritised than the sustainability agenda.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Generally, Asia may approach this challenge with a more pragmatic regional approach. Perhaps in other regions where the ideology of achieving sustainability must be absolute and success must be 100%. Asia’s approach is more prominent in tackling issues such as emissions,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said the challenges faced related to energy supply are not challenges that can be handled by any single entity, industry, or sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This is a challenge I boldly propose to anyone who sees this as a universal challenge. This means that cooperation is not just within one industry but requires an approach between countries,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He pointed to the initiatives recently implemented under Malaysia’s chairmanship of Asean this year, led by Prime Minister Datuk Seri Anwar Ibrahim, where renewable energy resources from Vietnam through Malaysia could be supplied to Malaysia and also to Singapore, which has demand centres. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This approach, bringing these three countries together to cooperate, can address and possibly solve the problem where the resource or supply of renewable energy is not the same as where the demand centre is. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“I admit, I acknowledge, (this involves) large investments but if approached correctly and with uniformity and policy, I believe Asia and Asean especially can once again shine with realistic solutions without needing to wait,” he said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759720",
            "pub_date": "2025-06-20 00:21:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bank Islam launches sustainable financing facility to support SMEs' green transition",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Bank Islam Malaysia Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5258\" target=\"_blank\">BIMB</a>) on Thursday launched a new sustainable financing solution, IFiRST, to assist small and medium enterprises (SMEs), as well as mid-tier companies to adopt more resilient and environmentally friendly practices.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>IFiRST — short for Ihsan Financing for Business Resilience, Sustainability and Green Transition — is designed to ensure equitable and accessible financing for businesses navigating the transition towards a low-carbon economy, said Bank Islam group chief executive officer Datuk Mohd Muazzam Mohamed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This new financing solution reflects Bank Islam’s commitment to a fair and inclusive transition across all segments of the economy,” Mohd Muazzam said in a statement issued after the launch at the Bank Islam Sustainability Conference 2025.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“By enabling greener practices throughout the entire value chain, we are supporting not just large companies but also the smaller businesses and ecosystem partners that play a vital role in reducing carbon emissions,” he added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>IFiRST is tailored for carbon-intensive sectors and offers access to Bank Negara Malaysia’s Low Carbon Transition Facility.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The facility also removes financial and operational barriers for businesses embracing green practices while aligning with shariah principles and Bank Islam's environmental, social and governance commitments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As of December 2024, Bank Islam has achieved 93% of its revised FY2025 target of RM28 billion in sustainable finance and assets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The country’s largest standalone Islamic banking group also plans to implement its Climate Transition Plan to achieve net zero emissions by 2050 and strengthen its role as a strategic partner for businesses seeking greener operations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of Bank Islam finished seven sen or 3.11% higher at RM2.32 on Thursday for a market capitalisation of RM5.26 billion.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759718",
            "pub_date": "2025-06-19 23:51:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Musk's X to offer investment, trading in 'super app' push — report",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): X CEO Linda Yaccarino has said users will soon be able to make investments or trades on the social media platform, the <i>Financial Times</i> reported on Thursday, a move to support billionaire owner Elon Musk's vision to create an \"everything app.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In an interview with the publisher, Yaccarino said the company was exploring the introduction of an X credit or debit card, which could come as soon as this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Musk, who in April 2022 clinched a US$44 billion (RM187.5 billion) deal to buy Twitter and later rebranded it as X, has signaled plans to model it as a \"super app,\" similar to China's WeChat.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The social media platform did not immediately respond to a <i>Reuters</i> request for comment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"2025 X will connect you in ways never thought possible. X TV, X Money, Grok and more,\" Yaccarino wrote in a post in December last year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Payments giant Visa and X partnered to offer direct payment solutions to customers of the social media app, a person familiar with the matter said earlier this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A super app, or what Musk refers to as an \"everything app,\" has been described as the Swiss army knife of mobile apps, offering a suite of services for users such as messaging, social networking, payments and e-commerce shopping.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>X hired NBCUniversal advertising chief Yaccarino as CEO in 2023 amid advertiser exodus from the platform as they worried that their ads could appear next to inappropriate content.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Yaccarino said that 96% of X's ad clients prior to acquisition had now come back to the platform, the <em>Financial Times</em> report said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company is poised for its first year of ad revenue growth this year since its acquisition by Musk, according to data from research firm Emarketer in March.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>X had filed a lawsuit in federal court in Texas against the World Federation of Advertisers, accusing them of unlawfully conspiring to boycott the site and causing it to lose revenue.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759717",
            "pub_date": "2025-06-19 23:41:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Petronas should adapt to new energy transition demands amid economic and geopolitical uncertainties, says group CEO",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Petroliam Nasional Bhd (Petronas) must face new demands in the energy transition era to remain relevant amid current economic uncertainties and geopolitical tensions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Its president and group chief executive officer, Tan Sri Tengku Muhammad Taufik Tengku Aziz, said that in the short term, hydrocarbon production must be cleaner and lower in carbon intensity to reduce greenhouse gas emissions, in addition to addressing methane leaks according to standards.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Firstly, gold certification for oil and gas methane partnership (OGMP) 2.0 is a must. Secondly, we will avoid flaring or routine venting of gas, and so far, more than 20 of our assets have tackled this by practising zero routine flaring.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“In the medium to long term, offerings such as carbon capture and storage (CCS) and specialty chemicals should be accelerated as soon as possible, and I believe this requires the right platform, and investments need to be made,” he told Bernama TV in an exclusive interview during the Energy Asia 2025 conference here on Wednesday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tengku Muhammad Taufik highlighted that the national oil and gas company must undergo a transformation, where it is no longer optional but a necessity to prepare for a low-carbon energy system.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“In the past, we were production-oriented; we produced, and people would buy. Now, we need to understand more; we will only produce what people are willing to buy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Willing to buy in terms of capability and needs, so if it is just to supply energy in the form of liquefied natural gas (LNG) to traditional markets like Japan, perhaps now it is not enough,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tengku Muhammad Taufik said Petronas is focusing on high-value assets and implementing strategic portfolio optimisation, including increasing or reducing holdings to optimise capital allocation, improve returns, and strengthen focus to support sustainable growth. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Like any other energy player in the sector, optimising the portfolio is a mandatory activity and will always be practised.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“If this implementation requires us to sell assets with possibly higher carbon emissions and replace them with new assets that can extend the production life from the upstream sector, we will do that,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the downstream sector, Tengku Muhammad Taufik said that if the divestment of assets causes margins to be affected, Petronas will replace them with assets that have more stable margins and are less exposed to uncertainties. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This is where entities like Gentari come in, profits might be less, but it is less exposed to uncertainties,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gentari is a clean energy solutions company, wholly owned by Petronas. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759714",
            "pub_date": "2025-06-19 23:31:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MBSB Bank partners with Bayo Pay to digitalise construction sector payroll",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): MBSB Bank Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/1171\" target=\"_blank\">MBSB</a>) said it has teamed up with Bayo Pay to digitise payroll disbursement for Malaysia’s construction sector, offering contractors \"a safer and more efficient alternative to cash-based wage payments\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>By offering a digital-first payroll system, MBSB Bank aims to protect contractors and workers alike while aligning with national goals to accelerate cashless adoption, the bank said in a statement on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bayo is a homegrown financial technology company, and it is regulated by Bank Negara Malaysia under the Payment System Act 2003, the company’s website showed.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The solution is built on Bayo's regulated e-money platform, which allows wages to be credited directly into workers’ e-wallets, thus eliminating the operational and security risks of carrying physical cash to worksites.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MBSB Bank said the move addresses a persistent challenge in the construction industry. It noted that in recent years, there has been a rise in robberies targeting contractors transporting large sums of cash, resulting in serious injuries, unpaid workers and stalled projects.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For contractors, it offers traceable wage disbursement, streamlined compliance with labour and audit requirements, and reduced risk of fraud. For workers, particularly those unbanked or underbanked — it enables faster, more secure access to wages via mobile wallets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MBSB Bank said the service is initially targeted at G1 to G7 CIDB-registered contractors. In the future phase, the service is expected to benefit both employers and workers across a wider range of industries.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We’re enabling businesses to move away from high-risk, cash-based practices and giving workers a safer way to get paid,\" said MBSB group chief executive officer Rafe Haneef in a statement. \"It’s a meaningful step forward in how payroll should be done.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MBSB Bank said the solution also opens new avenues for the bank to serve clients through bundled payroll current accounts, cash management tools, and broader financial services over time.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bayo Pay managing director and CEO Fardan Abdul Majeed Aznul Shazri Abdullah said the group is proud to work with CIDB and MBSB Bank to modernise and digitalise wage payments in the construction industry.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This is about more than removing cash, it is about enabling trust, inclusion, and better outcomes for the entire value chain,” Fardan said.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759704",
            "pub_date": "2025-06-19 22:31:43",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Plaza Premium Group unveils new lounge at Senai International Airport",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Plaza Premium Group (PPG), which operates the world’s largest network of international airport lounges, has announced the soft opening of its new lounge at Senai International Airport in Johor Bahru.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a statement Thursday, the Hong Kong-based group said the 80-seat lounge features self-check-in kiosks and a QR code-based food ordering system to enhance efficiency and convenience for travellers. The lounge also integrates with the Smart Traveller app to provide personalised services, rewards and a smoother experience throughout the lounge and airport.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For passengers with limited time, the lounge offers a Lounge-To-Go corner, where they can quickly grab a selection of food and drinks for takeaway.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Plaza Premium Lounge Johor Bahru is more than just a place to wait for your flight — it’s a space to experience the best of Johorian hospitality, art and innovation,” said PPG's regional general manager for Southeast Asia Cavin Loh.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Returning to Johor Bahru with Plaza Premium Lounge is an exciting moment for us. By seamlessly blending technology with local culture, we are excited to redefine the travel experience for both domestic and international passengers at Senai International Airport,” he added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Established in 1998, PPG is recognised as the pioneer of the independent airport lounge concept, making such lounges accessible to all travellers. Today, PPG operates in 150 countries across 600 international and domestic airports, serving 24 million passengers annually.</p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759711",
            "pub_date": "2025-06-19 22:31:36",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Advancecon initiates adjudication over ECRL project works payment dispute",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Advancecon Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5281\" target=\"_blank\">ADVCON</a>) said the group has issued a notice of adjudication to China Communications Construction (ECRL) Sdn Bhd (CCC) over a payment dispute relating to the East Coast Rail Link (ECRL) project.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a filing with Bursa Malaysia on Thursday, the civil engineering group said its wholly owned subsidiary, Advancecon Infra Sdn Bhd, is seeking RM15.22 million in outstanding payments from CCC, along with interest and other relief.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The amount claimed is for subgrade, drainage and culvert works along two stretches of the ECRL for which Advancecon Infra was appointed as the sub-contractor in 2020.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advancecon said that on March 12, 2025, Advancecon Infra submitted a payment claim for outstanding sums of RM10.17 million and RM5.05 million, but CCC allegedly failed to make any payment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advancecon Infra then served the notice of adjudication issued under the Construction Industry Payment and Adjudication Act 2012 to CCC to refer the dispute arising from the payment claim to adjudication, the group said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Save for Advancecon Infra’s claim and disbursement involved in the adjudication, the company is not expected to have any material financial and operational impact at this point in time,\" Advancecon said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advancecon shares rose half a sen or 2.2% to 23.5 sen on Thursday, giving the group a market capitalisation of RM137.4 million. The stock has declined 9.62% year-to-date.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759702",
            "pub_date": "2025-06-19 21:41:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oriental Kopi to acquire Puchong HQ and warehouse for RM23 mil",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Newly listed kopitiam chain operator Oriental Kopi Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0338\" target=\"_blank\">KOPI</a>) has entered into an agreement to acquire the premises it currently rents as its head office and warehousing facility in Puchong, Selangor, for RM23 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to a bourse filing, Oriental Kopi said further details — including the salient terms of the sale and purchase agreement (SPA), the rationale for the transaction, and associated risks — will be disclosed upon execution of the SPA, which is expected within 21 days from June 2, 2026, or at a later date mutually agreed upon by both parties.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The property comprises a 5,260.8-square-metre leasehold parcel of land with a factory unit erected on it. The vendor is Icon Facade Sdn Bhd, whose shareholders are Heng Ngeng Choo and Siau Fui Chien.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Oriental Kopi said the acquisition is expected to generate cost savings by eliminating rental and logistics expenses, while also mitigating the risk of losing the right to use the property.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares in Oriental Kopi were down three sen or 3.5% at 82 sen, valuing the group at RM1.64 billion. Since its listing on Jan 23 at 44 sen, the stock has gained 86%.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759700",
            "pub_date": "2025-06-19 21:21:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Astro to continue to prioritise local content, affordable tiers as 1Q profit drops 21%",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Astro Malaysia Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/6399\" target=\"_blank\">ASTRO</a>) said it will continue to invest in expanding its content offerings in lower subscription tiers and lowering entry pricing for Astro and its over-the-top platform sooka to grow its customer base, as it reported a 20.8% drop in its first quarter earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It also continues to be focused on increasing intake for its adjacent businesses, such as sooka, Astro Fibre and Studios to tap into broader market segments, and to strengthen local content through signature programmes and movies, in which it has a competitive advantage, while streamlining legacy cost structures to support these initiatives.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"This quarter was a challenging one, for adex (advertising expenditure) in particular, as it was shaped by economic headwinds such as rising input costs, cautious consumer spending, and uncertainty in global trade and tariffs,\" said Astro group chief executive officer Euan Daryl Smith.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The group's net profit for the three months ended April 31, 2025 (1QFY2026) dropped to RM13.48 million from RM17.01 million, as revenue fell 9% from RM772.53 million to RM703.09 million. This decline was primarily driven by a 6% drop in television subscription revenue and a 13% fall in advertising revenue.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The group reported a 4.2% year-on-year (y-o-y) decline in earnings margin, which was mainly attributed to higher content costs, licensing, copyright and royalty fees, staff-related expenses, impairment of receivables, and professional and consultancy fees.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Radio revenue experienced a 27.3% y-o-y decline, falling to RM33 million from RM45.4 million, due to soft consumer sentiment that dampened advertising spend. No dividends were declared for the quarter under review.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But Smith stressed that tough quarters test resilience, and Astro's lies in resilience. \"Our edge is local. Now, 82% of viewing time on Astro is spent on local and vernacular programming, up three percentage points from the last quarter. To meet this demand, we are continuing to produce over 10,000 hours of fresh content annually; from Astro Originals to signature dramas and beloved variety shows,\" Smith said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Getting local content right means they can capture hearts and create leverage, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It gives us negotiating power with content partners and enables us to stretch every ringgit that we spend on content further.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We’re also still extending well beyond the screen; into radio, digital, and on-ground experiences like concerts and festivals. These are uniquely Astro moments that cannot be pirated,\" he said, adding the group is laying the groundwork for stronger performance ahead.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It is also enhancing cross-platform monetisation of its content rights across cinemas, video, and digital platforms through licensing, advertising partnerships, and on-ground engagement initiatives.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Given the challenging environment, the group remained cautious on its outlook, as it monitors business conditions and prioritises cost discipline, while both consumers and businesses adjust to internal reforms and external uncertainties.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Astro shares are currently trading near their all-time low at 17.5 sen, valuing the group at RM913.33 million. Year-to-date, the stock has declined by 22%.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Tan Choe Choe</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759699",
            "pub_date": "2025-06-19 20:51:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MSM on track to sustain profitability in FY2025 despite volatile costs, says management",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): MSM Malaysia Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5202\" target=\"_blank\">MSM</a>) is optimistic about sustaining its profit recovery in the financial year ending Dec 31, 2025 (FY2025) despite volatile input costs, foreign exchange challenges and the impact of dumped imported sugar on margins.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MSM group chief executive officer Syed Feizal Syed Mohammad said the group remains focused on improving operational efficiency and managing costs to support consistent earnings performance after marking a turnaround to profitability in FY2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We believe that we have taken measures in the turnaround that included transformation of MSM itself,” Syed Feizal said.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Moving forward, I believe that the path is made towards consistent performance because we have, for example, enough risk management knowledge. We have instituted certain processes and procedures to manage our input costs,” he said at a post-annual general meeting (AGM) press conference on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A key contributor is its Johor refinery, which has ramped up operational efficiency and is now positioned to handle larger export volumes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Our yield now is about 94% compared to 80% last year. So, all these [including a 50% utilisation factor] will basically drive better profitability from Johor,” MSM group chief operating officer Hasni Ahmad said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, Hasni noted that the current utilisation rate remains about 30% at the Johor plant, which is still below the 40%-45% breakeven level, meaning that more export demand is key to optimising production.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Therefore, the country's largest sugar refiner is targeting to increase its total export volumes to 360,000 tonnes in 2025 — up from about 240,000 tonnes last year — mainly to China and Asean markets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“China is currently sourcing from countries like (South) Korea. So, we believe we can compete against the Koreans because our refining cost is cheaper than theirs, with premium quality sugar,” Syed Faizal said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite MSM’s aim to maintain positive full-year profitability, the company's quarterly earnings could remain volatile.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We would like to have all our quarters to be in a positive position but it depends on the parameters — on the sugar price, utilisation factor, labour costs,” MSM chief financial officer Ab Aziz Ismail said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On dividends, MSM chairman Datuk Syed Hisham Syed Wazir said any payout will depend on the group’s sustained profit improvement.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Perhaps, by the end of 2025, we will be able to see what the results are. We have a dividend policy and we will consider it at a time,” Syed Hisham said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MSM, the sugar arm of FGV Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5222\" target=\"_blank\">FGV</a>), has not announced any distribution since FY2022.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>After two years of net losses, MSM returned to black with a net profit of RM31.25 million in FY2024, compared to a net loss of RM49.88 million in FY2023.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, in the first quarter ended March 31, 2025 (1QFY2025), MSM's net profit fell by 91% to RM3.73 million, down from RM41.71 million a year earlier, no thanks to lower margins and reduced capacity utilisation despite a decrease in production costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares in MSM closed down two sen or 1.92% to RM1.02 on Thursday, valuing the group at RM717.04 million. The counter has dropped over 17% year to date.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759646\" target=\"_blank\">MSM flags cost pressures from 5% SST on raw sugar; still in talks with govt on price mechanism</a></i></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759695",
            "pub_date": "2025-06-19 20:41:49",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cuckoo Malaysia reports RM27.9m 1Q net profit ahead of listing",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Cuckoo International (MAL) Bhd, which is set to be listed on the Main Market of Bursa Malaysia on June 24, said its net profit for the first quarter ended March 31, 2025 (1QFY2025) came in at RM27.86 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Revenue for the quarter was RM296.38 million, the Malaysian unit of South Korean home-appliance maker Cuckoo Holdings Co said in a bourse filing on Thursday (June 19).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>There are no comparative figures as this is Cuckoo Malaysia’s first interim financial report ahead of its listing.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Cuckoo Malaysia said 80% or RM237 million of the company's revenue was contributed by the Cuckoo-branded segment, while the Cuckoo co-created segment contributed 19.7% or RM58.3 million</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Cuckoo Malaysia's chief executive officer Hoe Kian Choon said the company's performance in 1QFY2025 underscores the effectiveness of its business model, the strength of its brand presence, and the success of its omni-channel distribution strategy across both Malaysia and Singapore.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We are operating in a highly conducive environment for growth, with the number of households increasing at a faster rate than the population — a trend that directly supports demand for home appliances and wellness solutions,\" said Hoe in a statement. \"At the same time, rising household debt is driving a shift in consumer preference toward rental options, which aligns strongly with our resilient rental business model.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“To capture this demand, we will strategically allocate capital to fund our expansion. This includes expanding our product SKUs (stock keeping units) and home care service offerings while strengthening our distribution network through the introduction of Cuckoo cash-and-carry Brandshops, increased product availability on our e-commerce platforms, and the recruitment of more sales personnel nationwide,” Hoe added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company's IPO consists of an offering of up to 365.36 million shares — including an institutional offering of up to 322.38 million shares to institutional and selected investors, as well as government-approved Bumiputera investors — and a retail offering of 42.98 million shares for eligible employees, contributors to the group’s success and the Malaysian public.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company is expected to raise gross proceeds of RM154.74 million from the new issued shares, based on its revised IPO price of RM1.08, which is 16.3% lower than the initial set price of RM1.29.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The price revision came after Cuckoo Malaysia postponed its planned listing by two months, from April 30 to June 24, citing heightened global market volatility.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The proceeds raised from IPO will be used to fund the expansion of the company's rental business, repayment of bank borrowings, capital expenditure for new Brandshops, IT system upgrades and regional expansion into Singapore.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/758985\" target=\"_blank\">Cuckoo International’s Main Market IPO shares oversubscribed by less than 1.5 times</a><br/>\n<a href=\"https://theedgemalaysia.com/node/749333\" target=\"_blank\">Cuckoo launches Malaysia’s biggest IPO in seven months at RM1.29 per share</a><br/>\n<a href=\"https://theedgemalaysia.com/node/758619\" target=\"_blank\">Cuckoo International lowers IPO price to RM1.08</a><br/>\n<a href=\"https://theedgemalaysia.com/node/747362\" target=\"_blank\">Cuckoo International gets RHB, AmInvestment to back upcoming IPO's retail tranche</a></i></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759698",
            "pub_date": "2025-06-19 20:41:42",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Theta Edge and Agmo form JV to drive AI and blockchain innovation",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Theta Edge Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/9075\" target=\"_blank\">THETA</a>) is forming a joint venture company (JVCo) with Agmo Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0258\" target=\"_blank\">AGMO</a>) to accelerate the commercialisation of artificial intelligence (AI), blockchain, and platform-based services, with an initial emphasis on public sector transformation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The JVCo will be incorporated via Theta Technologies Sdn Bhd and Agmo Capital Sdn Bhd, holding 51% and 49% stakes respectively, according to bourse filings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The initial growth strategy will centre around three core pillars: halal traceability intelligence, AI-driven digital health solutions, as well as super analytics and infrastructure dashboards.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to a press statement, the JVCo will serve as the execution arm for Theta Edge’s proprietary AI suite, ThetaNeuron, enabling rapid deployment of AI-powered applications across digital health, halal traceability and smart analytics.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It will also leverage Agmo’s ready-to-market technologies, including generative AI chatbots, e-invoicing middleware, localised large language models, telehealth platforms, and blockchain-based verification tools.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Theta Edge group managing director and chief executive officer Datuk Nuraslina Zainal Abidin said the venture marks the beginning of a new chapter for the company, anchored on platform monetisation and industry-focused AI innovation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>By combining Agmo’s agile development capabilities with Theta’s domain expertise, the JVCo aims to drive transformative outcomes across financial services, healthcare, halal trade, smart logistics, and the public sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Agmo CEO Tan Aik Keong noted that the collaboration enables his company to extend its scalable technologies into regulated environments, prioritising service efficiency and accessibility, with the goal of delivering secure, future-ready systems tailored to rapidly digitising sectors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At Thursday’s close, Theta Edge shares fell four sen or 4.1% to 94 sen, translating to a market capitalisation of RM110.89 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Agmo’s stock price declined one sen or 2.2% to 44 sen, valuing the group at RM143 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Year-to-date, Theta Edge has dropped 34.3%, while Agmo is down 14.6%.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759690",
            "pub_date": "2025-06-19 20:21:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Op Hazard 2.0: IRB to probe financial records of 57 raided e-waste premises",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): The Inland Revenue Board (IRB) will scrutinise the financial records of 57 premises raided during the integrated Op Hazard 2.0 operation, launched on June 16 to crack down on the illegal processing of electrical and electronic waste (e-waste).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>IRB deputy chief executive officer (Compliance) Datuk Hisham Rusli said preliminary investigations discovered that the illegal e-waste processing factories had collectively evaded taxes exceeding RM500 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Based on current information, several of the premises appear to be operated by the same owner, and we are investigating this further,” he said at a joint press conference with the director of the Bukit Aman Internal Security and Public Order Department (JKDNKA) on Thursday.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hisham said that from a taxation standpoint, illegal factories typically either fail to report their income or declare figures significantly lower than their actual earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We will thoroughly examine their financial records. What we’ve discovered is that these e-waste processing products are often re-exported at prices many times higher than their original value,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A total of 57 premises involved in the illegal processing of electrical and electronic waste (e-waste) were raided nationwide during the three-day integrated Op Hazard 2.0 operation, with total seizures estimated at RM500 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The breakdown of the seizures during the operation includes RM240 million worth of e-waste, RM182 million in e-waste components, and RM50 million in worn-out goods. Additionally, items linked to other offences were valued at RM32 million. The value of tax-related investigations stemming from the raids is estimated at approximately RM500 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p> </p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759685",
            "pub_date": "2025-06-19 20:11:58",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Air India warned for flying Airbus planes with unchecked escape slides",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>NEW DELHI (June 19): India's aviation regulator has warned Air India for breaching safety rules after three of its Airbus planes flew despite being overdue checks on emergency equipment, and for being slow to address the issue, government documents show.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The warning notices and an investigation report — both reviewed by <i>Reuters</i> — were not in any way related to last week's crash of an Air India Boeing 787-8 plane that killed all but one of the 242 people onboard, and were sent days before that incident.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the report, the Directorate General of Civil Aviation said spot checks in May on three Air India Airbus planes found that they were operated despite mandatory inspections being overdue on the \"critical emergency equipment\" of escape slides.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In one case, the watchdog found that the inspection of an Airbus A320 jet was delayed by more than a month before being carried out on May 15. AirNav Radar data shows that during the delay the plane flew to international destinations such as Dubai, Riyadh and Jeddah.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Another case, involving an Airbus A319 used on domestic routes, showed checks were over three months late, while a third showed an inspection was two days late.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The above cases indicate that aircraft were operated with expired or unverified emergency equipment, which is a violation of standard airworthiness and safety requirements,\" the DGCA report said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Air India \"failed to submit timely compliance responses\" to deficiencies raised by the DGCA, \"further evidencing weak procedural control and oversight,\" it added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Air India, which was taken over by the Tata Group in 2022 from the government, said in statement that it was \"accelerating\" verification of all maintenance records, including dates of the escape slides, and would complete the process in the coming days.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In one of the cases, Air India said, the issue came to light when an engineer from AI Engineering Services \"inadvertently deployed an escape slide during maintenance\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The DGCA and Airbus did not respond to <i>Reuters</i> queries.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Checks on escape slides are \"a very serious issue. In case of accident, if they don't open, it can lead to serious injuries,\" said Vibhuti Singh, a former legal expert at the government's Aircraft Accident Investigation Bureau.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The DGCA said in its report that the certificates of airworthiness for aircraft that miss mandatory checks were \"deemed suspended\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The warning notices and the report were sent by Animesh Garg, a deputy director of airworthiness in the Indian government, to Air India CEO Campbell Wilson as well as the airline's continuing airworthiness manager, quality manager and head of planning, the documents showed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>An Indian aviation lawyer said such breaches typically attract monetary and civil penalties on both individual executives and the airline.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wilson told <i>Reuters</i> last year that global parts shortages were affecting most airlines, but the problem was \"more acute\" for Air India as its \"product is obviously a lot more dated\", with many planes not refreshed since they were delivered in 2010-2011.</p></div>\n<h3>'Systemic control failure'</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Indian regulator, like many abroad, often fines airlines for compliance lapses. India's junior aviation minister in February told parliament that authorities had warned or fined airlines in 23 instances for safety violations last year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Around half of them — 12 — involved Air India and Air India Express, including in one case for \"unauthorised entry into cockpit\". The biggest fine was US$127,000 (RM541,147) on Air India for \"insufficient oxygen on board\" during a flight to San Francisco.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Last week's crash, the causes of which are still being investigated, will further challenge Air India's attempts to rebuild its image, after years of criticism from travellers for poor service.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Air India's chairman N Chandrasekaran on Monday told staff the crash should be a catalyst to build a safer airline, urging employees to stay resolute amid any criticism.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In its report, the DGCA also said several Air India aircraft checked by officials had outdated registration paperwork. Air India told <i>Reuters</i> all but one aircraft complied with such requirements and this \"poses no impact\" to safety.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The DGCA investigation report pulled up the airline for what it described as \"inadequate internal oversight.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Despite prior notifications and identified deficiencies, the organisation’s internal quality and planning departments failed to implement effective corrective action, indicating systemic control failure,\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759687",
            "pub_date": "2025-06-19 20:11:51",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}