{
    "data": [
        {
            "title": "Wilmar woes weigh on PPB, stock hits 16-year low",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Shares of PPB Group Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/4065\" target=\"_blank\">PPB</a>) fell below the RM10 mark on Thursday — a level last seen more than 16 years ago, on April 10, 2009.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The agrifood conglomerate has fallen for three consecutive trading days after news emerged that its 18.8%-owned associate, Wilmar International Ltd, has placed a US$729 million (RM3.1 billion) security deposit with Indonesia’s Attorney General Office amid corruption charges. The deposit is pending a ruling by the Supreme Court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the past three trading days, PPB shares dropped 9.2%, or RM1.01, to RM9.97, bringing the group’s market capitalisation to RM14.18 billion. Year-to-date, the stock has declined 19.6%.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Total volume over the three-day period reached 2.243 million shares, averaging 747,800 shares per day — slightly above the 200-day moving average of 545,682 shares.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Wilmar declined 11 cents, or 3.6%, over the same period to S$2.91 (RM9.63), valuing the Singapore-listed firm at S$18.6 billion. It has declined 6.1% year-to-date.</p></div>\n<div class=\"mt-3 imgw-300 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/pbb-share-price_20250619191235.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/pbb-share-price_20250619191235.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to <em>Bloomberg</em>, PPB’s average target price from five analysts has been revised down to RM12.18 from RM13.30, primarily due to a downgrade by Kenanga Research. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The firm cut its target price to RM10.50 from RM15, citing a higher risk premium, and lowered its rating from ‘outperform’ to ‘market perform’. Currently, the stock carries three ‘hold’ calls and two ‘buy’ calls.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kenanga Research observed that the development could raise the group’s risk premium and weigh on the stock for as long as the matter remains unresolved, especially given that Indonesia accounts for approximately 10% of its business operations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The research house also highlighted that the US$729 million security deposit will be forfeited if the Supreme Court rules against Wilmar, but refunded if the court upholds the earlier decision by the Central Jakarta Court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kenanga estimated PPB’s share of the deposit would be about RM600 million or 42 sen per share. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As of end-March 2025, PPB held total cash of RM1.761 billion, compared to total borrowings of RM305.16 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wilmar remains PPB’s key profit contributor. In FY2024, Wilmar contributed RM992 million to PPB’s total profit before tax of RM1.33 billion.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a statement to the Singapore Exchange (SGX) on April 14, Wilmar stated that, to its knowledge, the investigations had not implicated the group or any of its employees. The company also affirmed its willingness to cooperate with authorities if required.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wilmar added that it does not believe it is guilty of the charges, explaining that its actions at the time were intended to assist the government in improving domestic availability and lowering prices.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also: <br/>\n<a href=\"https://theedgemalaysia.com/node/759398\" target=\"_blank\">PPB faces higher risk premium after Wilmar's US$729m deposit in Indonesia case</a></em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759683",
            "pub_date": "2025-06-19 20:01:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tax expansion vital to ensure fiscal sustainability — PMO",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): The country’s revenue generation remains limited, and tax expansion is necessary to ensure fiscal sustainability, according to the Prime Minister’s Office (PMO).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Senior press secretary to the prime minister, Tunku Nashrul Abaidah, said that Malaysia is among the countries with the lowest tax-to-gross domestic product (GDP) ratios in the world, at about 12%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tunku Nashrul emphasised that the government’s core principle is clear — the burden will not fall on the majority of the people. Instead, tax revenue will be reinvested into programmes that benefit the people.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Among these are the RM13 billion allocated for the Rahmah Cash Contribution (STR) and Sumbangan Asas Rahmah (Sara), benefiting nine million recipients.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He also said that RM400 million has been allocated to refurbish dilapidated clinics, and over RM600 million to repair more than 8,000 school toilets, benefiting over five million students. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This is the true foundation of every Madani government policy, to improve the people’s quality of life through responsible and comprehensive measures,” he said during the PMO briefing, which was streamed live on Anwar Ibrahim’s Facebook page and the PMO Malaysia Facebook page on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On June 9, the government announced a targeted review of the sales tax rate and an expansion of the service tax scope, both of which will take effect from July 1.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The sales tax rate remains unchanged for esential goods, while a five or 10% rate will be imposed on selected items.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, the scope of the service tax will be expanded to include six new services: leasing or rental, construction, finance, private healthcare, education, and beauty services.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Treasury secretary-general Datuk Johan Mahmood Merican reportedly said that revenue from the Sales and Service Tax (SST) collection is expected to increase by RM5 billion in 2025 and by RM10 billion in 2026, following the implementation of the SST revised and expanded scope starting next month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p> </p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759681",
            "pub_date": "2025-06-19 19:51:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global IPO activity slumps in 2025 as tariffs, volatility weigh",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Global equity IPOs have plunged this year, weighed down by heightened business uncertainty from US tariffs, elevated market volatility and higher interest rates that have raised funding costs and made listings less appealing for issuers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to LSEG data, as of June 17, global IPO volume has declined about 9.3% year-on-year to US$44.3 billion, the lowest level in nine years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US IPO volumes dropped 12% to US$12.3 billion, while Europe saw a sharper 64% decline to US$5.8 billion. In contrast, Asia-Pacific IPO volumes have risen 28% to US$16.8 billion so far this year.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>President Donald Trump's tariffs, which included a 10% blanket levy plus targeted duties on US trading partners, re-ignited tensions in April. Despite his subsequent pause and negotiations on trade and tariffs, businesses globally are uncertain about demand and investment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It’s not prudent for companies to go public right now. The volatility in the market is unprecedented,\" said Isabelle Freidheim, founder and managing partner at Athena Capital.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"There’s real risk for tech companies that are still figuring out profitability. If the stock drops after the IPO, it’s very hard to recover, especially for companies with less steady cash flow or that aren’t as mature.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite the broader slowdown, China and Japan have seen a sharp pickup in listings, driven by regulatory easing and improved sentiment. A standout was Chinese battery giant CATL, which raised US$4.6 billion in the world’s largest IPO so far this year, boosted by renewed market momentum following the US tariff truce.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At the same time, some analysts are cautiously optimistic about a second-half recovery. US IPO interest is showing signs of a rebound, led by fintech firm Chime, which surged on its debut. High-profile names such as Klarna, Gemini and Cerebras are slated to list later this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"With US, European defence contractors and Indian consumer names also filing, late-2025 could deliver a textbook “trickle-then-torrent” if volatility behaves,\" said Michael Ashley Schulman, chief investment officer at Running Point Capital Advisors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759680",
            "pub_date": "2025-06-19 19:41:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "'Duta enclave' land dispute: Govt valuer further explains how she went about evaluation",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): A government property valuation expert continued to testify on Thursday on how her valuation methods differed from the private valuer’s, over the long-standing \"Duta enclave\" land dispute.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Halimatul Saeidah Abd Ghani, 49, said that although she agreed that some plots of land in Mont Kiara and Kenny Hills were comparable property to the ‘Duta enclave’, she did not use them in her valuation as those plots contained tiny bungalows.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The real estate in question is agricultural land with the potential to be residential land, and is not the right comparison with the plots containing the small bungalows,\" she said on Thursday.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Halimatul said this during re-examination by senior federal counsel Mohammad Al-Saifi Hashim. She is taking the stand as part of court proceedings on assessing \"mesne profits\" that are to be paid out to the liquidators of Semantan Estate (1952) Sdn Bhd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>She added that she did use residential land comparison, which differed from the plaintiff's valuation. She said she considered large tracts of land converted into residential land, as opposed to the plaintiff's valuation, which was comparisons to bungalows in land which was already subdivided into smaller lots.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It is the government's stance that their valuation of mesne profits is RM289.846 million, a mere fraction compared to the maximum RM13.242 billion valuation by Semantan Estate’s appointed valuer.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mesne profits are “the rents and profits which a trespasser has, or might have, received or made during his occupation of the premises, and which therefore he must pay to the true owner as compensation for the tort which he has committed”, according to Jowitt’s Dictionary of English Law.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Previously, Halimatul had testified that she used the Decapitalisation of Market Value method, and said that the private valuer's reliance on year-to-year valuation to get the value of the land was not accurate as it was based on assumptions.  </p></div>\n<h3>Trial to continue in July</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The trial is slated to continue on July 9 and 10, with a second government valuer taking the stand.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The 263.27 acres were acquired by the government in 1956 to be transformed into what they called “the Duta enclave”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Currently, it houses government buildings that include the Tun Razak hockey stadium, the Malaysian Institute of Integrity, the National Archives, the Kuala Lumpur Syariah Court, the government complex building along Jalan Duta (the Inland Revenue Board building), the Malaysian Anti-Corruption Commission Academy, as well as the flyover and a section of Jalan Duta (now Jalan Tuanku Abdul Halim) heading towards Segambut, and possibly portions of the Federal Territory mosque.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The land was acquired by the government in 1956 for the price of RM1.32 million under the then-Land Acquisition Enactment, for the purpose of developing a diplomatic (Duta) enclave.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In 2009, the High Court ruled that the government had trespassed on the land, and in 2012, this decision was upheld by the Court of Appeal and the Federal Court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In November 2018, a Federal Court bench, led by then-Court of Appeal president Tan Sri Ahmad Maarop, dismissed the Malaysian government’s application to review the 2012 decision, resulting in that judgement remaining intact.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Semantan Estate claimed it had retained its beneficial interest in the land in Mukim Batu, which it alleged the government had taken unlawful possession of, and that the government should pay the company mesne profits as damages for trespassing, with the said damages to be assessed by the court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759354\" target=\"_blank\">Govt valuer disagrees with Semantan Estate’s private valuation</a><br/>\n<a href=\"https://theedgemalaysia.com/node/683295\" target=\"_blank\">Federal counsel offers seven reasons why compensation in decades-long Jalan Duta land dispute should be only RM290 mil, not billions</a><br/>\n<a href=\"https://theedgemalaysia.com/article/costly-53-year-old-land-tussle\" target=\"_blank\">A costly 53-year-old land tussle</a><br/>\n<a href=\"https://theedgemalaysia.com/node/721994\" target=\"_blank\">Semantan Estate decision: What happens to the Duta enclave now?</a></em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Aniza Damis</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759678",
            "pub_date": "2025-06-19 19:31:41",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deleum clinches turbine maintenance contract from Hess",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Deleum Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5132\" target=\"_blank\">DELEUM</a>) announced it has been awarded a five-year contract by Hess Exploration and Production Malaysia BV.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The contract, which was secured via its 90%-owned indirect subsidiary Turboservices Sdn Bhd and began on June 10, involves providing maintenance services and supplying materials for solar gas turbine generators in the North Malay Basin. The value of the contract was not disclosed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the agreement, Turboservices Sdn Bhd will supply service parts, provide field service call-outs, exchange engines, manage equipment health, and offer other maintenance services for the solar gas turbines as needed, on a reimbursable cost basis.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Deleum’s shares closed unchanged at RM1.63 on Thursday, giving the group a market capitalisation of RM654.53 million. The stock has climbed 23 sen or 16.43% year to date.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Tan Choe Choe</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759676",
            "pub_date": "2025-06-19 19:21:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Technology alone won’t save you - it takes vision and execution",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"ceonothumb mx-auto pb-5\">\n<div>\n<div class=\"iframe-w100-wrapper\"></div>\n</div>\n</div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Read more in the June 23 edition of The Edge Malaysia Weekly. Pick up from the newsstands or subscribe at https://theedgemalaysia.com/subscription</p></div>\n<!----- =================== Related Start HERE =================== ---->\n<div class=\"related-news-container\"><span class=\"related-news\">More Issues</span>\n<div id=\"related-news\"> </div>\n</div>\n<link href=\"//advertisement2.bizedge.com/www/images/ads/ad-scripts/related-article.css?=cachev1\" rel=\"stylesheet\" type=\"text/css\"/>\n\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759673",
            "pub_date": "2025-06-19 19:11:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thai stocks decline to five-year low on political upheaval",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Thailand’s equity benchmark index closed at its lowest level since March 2020, after the government’s second-largest party quit the ruling coalition, piling further pressure on Prime Minister Paetongtarn Shinawatra.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Stock Exchange of Thailand Index fell 2.4%, marking its longest losing streak since February in a sixth straight day of decline. The gauge has plunged nearly 24% this year, making it the worst performer among the world’s major markets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The market sees knee-jerk selling on the back of rising political uncertainty, though the underlying developments actually point toward greater clarity ahead,” said Bob Tachasirinugune, head of Thailand equities at Citigroup Inc. “A reset would break the political deadlock that has paralyzed policymaking for over a year.”</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Thailand’s stock market has faced a series of headwinds this year, with slower economic growth, looming US tariffs and elevated household debt among the concerns curbing sentiment. Global funds have already dumped a net US$2.3 billion (RM9.8 billion) of Thai stocks in 2025, according to data compiled by <i>Bloomberg</i>.</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/434847472_20250619184135.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/434847472_20250619184135.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Thai baht fell for a fifth session against the dollar and on track for its longest losing streak in more than seven weeks amid the rising political uncertainty. The currency was trading 0.4% weaker against the greenback.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“As with other cases in Thai political history, there will be a good buying opportunity,” said Alan Richardson, a senior portfolio manager at Samsung Asset Management Co. “Eventually a new government will be formed and the market will recover.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759588\" target=\"_blank\">Thai ruling coalition hanging by a thread with PM under mounting pressure</a><br/>\n<a href=\"https://theedgemalaysia.com/node/759530\" target=\"_blank\">Big blow for Thailand's PM as major party exits coalition</a></em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Magessan Varatharaja</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759603",
            "pub_date": "2025-06-19 19:11:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Petron Malaysia sued again by ex-transport provider over alleged misrepresentation",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Petron Malaysia Refining &amp; Marketing Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/3042\" target=\"_blank\">PETRONM</a>) said it has been sued by its former transportation services provider over alleged negligent misrepresentation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The oil and gas company said Konsortium Lord-Saberkat Sdn Bhd (Lord Saberkat) is seeking a court declaration of negligent misrepresentation, along with RM135 million in special damages, RM5 million in aggravated damages and RM34 million in restitution.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The claim relates to services provided under a transportation agreement between the two parties that expired in November 2013, said Petron Malaysia in a filing with Bursa Malaysia on Thursday.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This marks the second time Lord Saberkat has pursued legal action against Petron Malaysia in relation to the same agreement. In 2018, the company filed a suit seeking RM109.18 million in damages, as well as general damages, interest and costs, over an alleged breach of contract.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, that suit was struck out by the Kuala Lumpur High Court, and Lord Saberkat’s subsequent appeal to the Federal Court was also dismissed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Addressing the latest legal challenge, Petron Malaysia said it believes that Lord Saberkat’s claims have no legal basis and denies any allegation of negligent misrepresentation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company said it has appointed external legal counsel and intends to defend its position.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Petron Malaysia does not expect the suit to have any material impact on its financial position or operations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of Petron Malaysia closed one sen or 0.3% lower at RM3.89 on Thursday, valuing the company at RM1.05 billion.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/article/petron-gets-court-strike-out-rm109-mil-suit-konsortium-lordsaberkat\" target=\"_blank\">Petron gets court to strike out RM109 mil suit by Konsortium Lord-Saberkat</a></i></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759671",
            "pub_date": "2025-06-19 19:01:44",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Luxury firms tackle slowdown with cheaper accessories, Bain says",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Luxury brands are putting out more affordable and smaller accessories as they seek to generate store traffic to counter slowing demand, a new report shows. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The trend comes after companies faced a consumer backlash over steep price hikes in recent years. Up to a quarter of luxury brands are embracing this strategy to keep shoppers visiting their stores, according to Claudia D’Arpizio, a partner at Bain &amp; Co, which issued the report Thursday. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“They understood that they needed to recalibrate,” she said in an interview. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While it’s harder to introduce more affordable products in categories such as leather goods, shoes and ready-to-wear, some labels are finding ways around it, notably by using textiles.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>LVMH’s Loewe, known for leather bags that can cost €5,200 (US$5,980 or RM25,399), is currently offering a drawstring pouch bag in a sponge-like cloth for €280, for instance.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Brands are also introducing new products in cheaper categories such as costume jewellery, eyewear and beauty in a bid to attract younger customers especially, according to D’Arpizio.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The shift comes after luxury product prices grew as much as 12% on average annually between 2022 and the first half of last year, which turned away many shoppers. The personal luxury-goods industry, worth €364 billion, lost 50 million customers in 2023 and 2024, Bain estimated last year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The sector will shrink between 2% and 5% this year after showing no change last year, according to the most likely scenario highlighted in Bain’s latest report. That’s set to be the worst performance since the 2009 global financial crisis if the pandemic is excluded. What’s more, China was growing then and it no longer is, D’Arpizio added. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Separately, she described the surprise appointment of carmaker Renault SA’s Luca de Meo as chief executive of Gucci owner Kering SA as a “good move” in an industry that tends to operate in a closed circuit. Auto and luxury face similar challenges, with slowing growth and pressure on margins, she added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759667",
            "pub_date": "2025-06-19 18:51:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thailand central bank approves country's first virtual banks",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BANGKOK (June 19): Thailand has approved virtual banking licences to three groups led by SCB X, Krung Thai Bank and ACM Holding, the central bank said on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The virtual banks shall start business operations within one year from the date of approval, the central bank said in a statement. Virtual banks are banks that operate only online, with no physical branches.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759669",
            "pub_date": "2025-06-19 18:51:23",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CTOS partners Infomina to gain real-time access to SSM corporate data",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Credit information provider CTOS Digital Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5301\" target=\"_blank\">CTOS</a>) has entered into a strategic partnership with Infomina Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0265\" target=\"_blank\">INFOM</a>), one of only four authorised service providers for Suruhanjaya Syarikat Malaysia (SSM) data, to gain access to real-time corporate data.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The collaboration will enable CTOS to get direct Application Programming Interface (API) access to SSM data via Infomina’s advanced search platform, allowing real-time integration of company information into CTOS’ credit reporting ecosystem, according to a joint statement from both companies.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the agreement, Infomina will provide seamless access to corporate and business information, supporting not only credit assessments but also broader data-driven applications. The partnership is also expected to pave the way for product enhancements powered by analytics and AI from both companies.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“By offering direct API integration, we are enabling more businesses to access real-time SSM data efficiently and affordably,” said Infomina Bhd chief executive officer (CEO) and managing director Yee Chee Meng.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company added that it aims to foster similar collaborations in the fintech and corporate services sectors to further expand use and accessibility of SSM data.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>CTOS interim group CEO Kevin Loh reaffirmed the company’s commitment to empowering businesses with the insights needed to make informed decisions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“By working closely with partners like Infomina Berhad, we enhance our clients’ ability to access data, assess creditworthiness and reduce risk — ultimately helping them grow amidst a dynamic business landscape,” Loh said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At the time of writing, shares in Infomina were down half a sen at 72 sen, valuing the company at RM426.95 million. CTOS’ shares were down one sen or 1.06% at 93 sen, giving it a market capitalisation of RM2.14 billion.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Tan Choe Choe</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759661",
            "pub_date": "2025-06-19 18:41:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FBM KLCI down 0.7% to 1,501.44 on June 19, 2025",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Below is a summary of how key Bursa Malaysia indices and the ringgit performed on Thursday:</p></div>\n<div class=\"pb-5 imgw-800 mx-auto d-block\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/full-market-closing-web-june19-2025_20250619175850.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/full-market-closing-web-june19-2025_20250619175850.jpg\"/></a></div>\n<div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div></div></div>",
            "link": "https://theedgemalaysia.com/node/759662",
            "pub_date": "2025-06-19 18:41:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Syria completes first global SWIFT transfer since war, governor says",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DAMASCUS (June 19): Syria has carried out its first international bank transaction via the SWIFT system since the outbreak of its 14-year civil war, its central bank governor said on Thursday, a milestone in Syria's push to reintegrate into the global financial system.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Central bank governor Abdelkader Husriyeh told Reuters in Damascus that a direct commercial transaction had been carried out from a Syrian to an Italian bank on Sunday, and that transactions with US banks could begin within weeks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The door is now open to more such transactions,\" he said.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Syrian banks were largely cut off from the world during the civil war after a crackdown by Bashar al-Assad on anti-government protests in 2011 led Western states to impose sanctions, including on Syria's central bank.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Assad was ousted as president in a lightning offensive by Islamist-led rebels last year and Syria has since taken steps to re-establish international ties, culminating in a May meeting between interim President Ahmed al-Sharaa and US President Donald Trump in Riyadh.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US then significantly eased its sanctions and some in Congress are pushing for them to be totally repealed. Europe has announced the end of its economic sanctions regime.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Syria needs to make transfers with Western financial institutions in order to bring in huge sums for reconstruction and to kickstart a war-ravaged economy that has left nine out of 10 people poor, according to the United Nations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Husriyeh chaired a high-level virtual meeting on Wednesday bringing together Syrian banks, several US banks and US officials, including Washington's Syria envoy Thomas Barrack.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The aim of the meeting was to accelerate the reconnection of Syria's banking system to the global financial system and Husriyeh extended a formal invitation to US banks to re-establish correspondent banking ties.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We have two clear targets: have US banks set up representative offices in Syria and have transactions resume between Syrian and American banks. I think the latter can happen in a matter of weeks,\" Husriyeh told Reuters.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Among the banks invited to Wednesday's conference were JP Morgan, Morgan Stanley and Citibank, though it was not immediately clear who attended.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759658",
            "pub_date": "2025-06-19 18:31:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's 618 shopping fest sets record, but daily spending slips",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BEIJING (June 19): China's largest mid-year shopping festival, 618, ended on Wednesday with record sales, though daily spending dropped amid an extended sales period aimed at enticing consumers to part with more of their hard-earned money.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The longer sales period helped the combined gross merchandise value (GMV), a business metric commonly used in e-commerce, reach an all-time high of 855.6 billion yuan (RM505.55 billion), according to retail data provider Syntun. That was 15.2% higher than the prior year's 742.8 billion yuan.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The festival, originally a single-day event celebrating JD.com's founding on June 18, has evolved into a month-long affair spanning all major e-commerce platforms.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This year's pre-sales began on May 13, a week longer than in 2024, leading to lower average daily spending of 23.1 billion yuan, compared with 24.8 billion yuan last year, according to <em>Reuters </em>calculations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Alibaba Group's Tmall kept its top position on sales, the data showed, followed by JD.com, ByteDance's Douyin and Pinduoduo Holdings' Pinduoduo. Syntun did not provide sales figures for each platform.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite the upbeat figures, the world's second-largest economy's retail sector continues to struggle due to concerns over employment stability, stalled wage growth and the ongoing property crisis.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Retailers and the government have sought to lift subdued spending by deepening discounts and expanding consumer subsidies but analysts say longer festivals and year-round discounts have dampened excitement for these kinds of events.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"I don't have anything special to buy during the 618 shopping festival. Because there are always great deals, I can buy whatever I need whenever,\" said Xu Binqi, who works in Beijing's film industry. \"Take skincare products as an example, I buy them whenever I run out, and the prices are no higher than during the 618 festival.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Rachel Lee, general manager of market research firm Worldpanel China and co-author of Bain &amp; Co's recent China Shopper Report, said that when consumers are budget-conscious, they seek affordable alternatives, and discounts play a lesser role.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Standalone promotional discounts will find it increasingly difficult to drive volume growth,\" she said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This year, JD.com said the number of users placing orders for the 618 event more than doubled year-on-year, with over 2.2 billion orders across its online, offline and food delivery platforms.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Alibaba said that 453 brands surpassed 100 million yuan in GMV over the 618 period.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Brands that surpassed one billion yuan in GMV included Apple, Xiaomi, Huawei, Nike, Adidas, L'Oréal  and Lululemon, Alibaba added.</p></div>\n<h3>Retail growth, subsidy impact</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the retail environment in China remains difficult, there are signs that consumption overall has picked up in recent months. Retail sales growth surpassed expectations in May, with official data showing a 6.4% increase, the fastest growth since December 2023.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Analysts pointed to the earlier start of 618, along with government consumer subsidies for goods such as home appliances and mobile phones, as twin drivers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Jacob Cooke, co-founder and CEO of WPIC Marketing + Technologies, said the extended 618 festival front-loaded consumer demand, encouraging earlier spending and smoothing consumption trends into May.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"A longer 618 festival with low prices helps sustain engagement across weeks and has contributed materially to May's strong retail performance,\" Cooke said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Analysts warn that a pause in subsidy programmes in several regions, as central government allocations dry up, could weigh on 618 sales and overall consumption this month, though more funds are likely to be allocated for those programmes in July.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Rapid sales growth of key subsidy categories [such as home appliances] driven by the 618 shopping festival starting from May... have quickly depleted funds,\" HSBC analysts wrote in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Eve Wang, 32, reflected on the shift in spending habits: \"In the past, for example during events like Singles' Day and 618, I used to spend a lot of money on stockpiling goods, but now ... I only buy what I need.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759654",
            "pub_date": "2025-06-19 18:21:33",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google faces setback as EU court adviser backs antitrust regulators",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BRUSSELS (June 19): Alphabet's Google faced a potential setback on Thursday as an adviser to Europe's highest court sided with EU antitrust regulators in the company's fight against a record €4.34 billion (US$4.98 billion or RM21.2 billion) fine levied seven years ago.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The European Commission in its 2018 decision said Google had used its Android mobile operating system to block rivals. A lower tribunal endorsed the EU finding in 2022 but trimmed the fine to €4.1 billion, prompting Google to appeal to Europe's top court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advocate general at the Luxembourg-based Court of Justice of the European Union (CJEU) Juliane Kokott, in her non-binding opinion, advised the court to dismiss Google's appeal and confirm the reduced fine set by the lower tribunal.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The legal arguments put forward by Google are ineffective,\" she said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kokott dismissed Google's argument that regulators should compare Google with a rival in assessing the situation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It is not realistic, in the present case, to compare the situation of Google with that of a hypothetical as-efficient competitor. Google held a dominant position in several markets of the Android-ecosystem and thus benefited from network effects that enabled it to ensure that users used Google Search,\" she said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Judges, who usually follow four out of five such non-binding opinions, will rule in the coming months.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Android has created more choice for everyone and supports thousands of successful businesses in Europe and around the world,\" a Google spokesperson said on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We are disappointed with the opinion which, if it were followed by the Court, would discourage investment in open platforms and harm Android users, partners and app developers.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Regulators said Google's illegal practices dated back to 2011, as it required manufacturers to pre-install Google Search and its Chrome browser together with its Google Play app store on their Android devices. It paid them to pre-install only Google Search and blocked them from using rival Android systems.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Google's Android system, which it lets device makers use for free, runs about 73% of the world's smartphones, according to Statcounter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The world's most popular internet search engine has racked up a total of €8.25 billion in fines linked to three investigations stretching back more than a decade, while other probes are ongoing.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The case is C-738/22 P Google and Alphabet v Commission.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759648",
            "pub_date": "2025-06-19 17:51:42",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan banks set to ban storage of cash in safe deposit boxes",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Japan’s main bank industry group is urging its members to prevent customers from keeping cash and other high-risk items in safe deposit boxes, following a series of thefts by employees.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Japanese Bankers Association has revised its sample agreement to explicitly prohibit the storage of cash in safe deposit boxes, it said on Thursday. Banks use the document as a model for their contracts with clients who use the service.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In recent months, incidents came to light in which workers at major lenders allegedly stole client valuables held in such boxes. That prompted regulators and banks to look more closely at the service, including the potential for it to be used for illicit activities.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>JBA chairman Junichi Hanzawa said cash kept in the facilities is at high risk of money laundering and other criminal use.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mitsubishi UFJ Financial Group Inc last year fired an employee who was accused of stealing millions of dollars from the safe deposit boxes of dozens of customers. Despite the theft, Japan’s biggest bank has said it plans to retain the service.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mizuho Financial Group Inc reported a similar incident in February.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759651",
            "pub_date": "2025-06-19 17:51:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nestlé picks ex-Inditex boss to succeed Bulcke as chairman",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Nestlé SA extended its leadership overhaul by proposing longtime Inditex SA executive Pablo Isla as its next chairman to succeed company veteran Paul Bulcke when he retires next year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move by the Swiss owner of Nespresso coffee and Purina pet food follows the surprise ouster of CEO Mark Schneider last year. His successor, Laurent Freixe, has been trying to restore sales growth as the Swiss company confronts challenges including rising costs and trade wars.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In contrast to the abrupt change of CEOs, Nestlé signalled an orderly transition from Bulcke to Isla, who’s currently vice-chairman of the board. He’ll stand for election to the new role at the next shareholder meeting in April, the company said Wednesday in a statement.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Isla was chief executive officer of Inditex, the Spanish apparel multi-national and owner of the Zara fashion brand, from 2005 to 2011, and chairman of the same company from 2011 until 2022. He has served on Nestlé’s board since 2018.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Spanish executive, 61, is credited with expanding on Inditex founder Amancio Ortega’s vision, boosting revenue and international reach to turn the company into one of the world’s largest sellers of apparel.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Pablo Isla has an impressive track record with Inditex and has the trust of investors,” Vontobel analyst Jean-Philippe Bertschy said in a note. Bulcke’s retirement was no surprise, he added, given that he’s 70.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Nestlé shares were little changed early Thursday in Zurich. They’ve risen 11% so far this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bulcke’s pending departure, while carefully orchestrated, nonetheless marks the end of an era for the world’s biggest food company. He’s a Nestlé veteran of nearly five decades, having served in management roles in several countries and as CEO for almost nine years before becoming chairman in 2017. During his time as CEO, the company made a big push into new areas such as infant nutrition.</p></div>\n<h3>CEO change</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bulcke played a key role in elevating Freixe to the top role, bringing back another Nestlé insider after the reign of Schneider, who had joined the company from the health-care industry. Freixe’s strategy emphasises making fewer but larger bets on key brands, supported by increased advertising investment and a cost-saving programme.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In recent years, Nestlé has had some mishaps, including a US$2.1 billion (RM8.9 billion) write-down on an investment in a peanut allergy medication. Then IT problems caused shortages at its vitamins and minerals unit.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Like other makers of branded consumer goods, the company has also struggled to keep consumers coming back to its products during periods of high inflation when private-label food and household items have gained popularity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759642",
            "pub_date": "2025-06-19 17:31:47",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nigeria to introduce real-time tracking for oil export shipments",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>LAGOS (June 18): Nigeria's oil regulator is set to bring in a new rule that requires oil producers to obtain an export permit, vessel clearance and a unique identification number to enable real-time tracking of cargoes, based on regulations seen by <em>Reuters</em>.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The government said the updated regulations are designed to enable real-time monitoring of oil cargo exports, aiming to combat theft and under-declaration at export terminals, and thereby significantly enhance government revenue.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The new rules mark a significant departure from the previous system which only required producers to declare cargoes to customs authorities for export permit issuance.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The new guidelines represent a significant step toward a more transparent, accountable and efficient oil export regime in Nigeria,\" the spokesperson for the regulator said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Reinforcing the necessity of these changes, Ayodele Oni, an energy lawyer at Lagos-based Bloomfield law firm, said the previous system was not equipped for real-time tracking.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"This deficiency led to issues such as under-reporting, theft, revenue loss and mismatches in export data,\" Oni said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the revised framework, known as the Nigerian Upstream Petroleum Advance Cargo Declaration Regulation, exporters must file comprehensive details of the vessel and cargo in advance, including the consignee, port destination, tonnage and estimated time of arrival.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Strict compliance with these new regulations is mandatory and non-compliance carries potential penalties of up to $20,000.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Siow Chen Ming</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759638",
            "pub_date": "2025-06-19 17:21:38",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Risk aversion grips Asian stocks, currencies; Philippines cuts rates as expected",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Asian stock markets and currencies fell on Thursday on broader risk-off sentiment as cautious investors weighed the possibility of US involvement in the Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, the Philippine central bank cut its policy rate by 25 basis points as expected. Bangko Sentral ng Pilipinas (BSP) Governor Eli Remolona stated that while an accommodative policy was needed, there were risks associated with geopolitical tensions and external policy uncertainty that had to be monitored.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The peso was largely unchanged after the decision, still trading down 0.6% near a two-month low. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Iran and Israel traded further air attacks as US President Donald Trump kept markets guessing on whether Washington would join Israel's strikes on Iranian nuclear facilities.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Israeli shekel weakened 0.3%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Indonesian rupiah fell 0.6% to a near three-month low and the Indian rupee dipped 0.3%. The South Korean won fell as much as 1% and the Vietnamese dong touched a record low.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Geopolitical developments remain fluid, and caution is warranted as we head into the weekend,\" said Christopher Wong, currency strategist at OCBC. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>With oil prices at risk of going higher as a result, net-oil importing currencies such as the peso, the rupee, the won and the Thai baht may be affected more than other peers, he added. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Taiwan dollar weakened 0.3% ahead of its central bank's rate decision, in which it is likely to maintain its policy rate.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Thai baht fell as much as 0.9% to a one-month low as political uncertainty weighed on already fragile sentiment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Thai Prime Minister Paetongtarn Shinawatra's government hangs by a thread, with coalition partners reconsidering their support after a major player's exit threatened to bring down the administration.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the near term, political uncertainty may weaken the baht further, as foreign investors lose confidence and sell Thai assets especially if the US dollar strengthens and gold prices continue to fall, said Poon Panichpibool, markets strategist at Krung Thai Bank.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bangkok equities dropped as much as 2.4% to their lowest since April 9.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Other stock markets also tumbled, with equities in Taiwan slipping 1.6% and those in Singapore down 0.6%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Indonesia stocks dropped 2.4% to their lowest since May 14, a day after the country's central bank paused its easing cycle just hours before the US Federal Reserve held rates steady as expected.        </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759639",
            "pub_date": "2025-06-19 17:21:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chevron seeks buyers for 50% stake in Singapore refinery — Reuters",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SINGAPORE (June 19): US oil major Chevron has sought non-binding bids for the sale of its 50% stake in Singapore Refining Company (SRC), including from joint venture partner PetroChina, eight sources familiar with the matter told <i>Reuters</i>.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Chevron is also gauging interest for the sale of other assets in Asia, including terminal and fuel storage facilities in Australia and the Philippines, one of the sources and a separate source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The potential sales come as Chevron restructures globally to streamline operations and reduce costs, a process that could see it lay off up to 20% of its workforce by the end of next year.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Chevron has appointed Morgan Stanley to explore the sale of the SRC refinery in Singapore and other Asian assets, one of the sources said. Morgan Stanley declined to comment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PetroChina, which owns the other 50% of SRC through its Singapore Petroleum Co Ltd unit, has first right of refusal to purchase Chevron's share, three of the sources said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Chevron does not comment on commercial matters as a matter of long-standing policy,\" a company spokesperson said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PetroChina did not respond to a request for comment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Other firms invited to review the refinery stake include global trading house Glencore, three of the sources said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Glencore does not comment on market rumour or speculation, a company spokesperson said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Buyers were asked to submit non-binding offers in July, the three sources said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One of the sources put the value of Chevron's stake in the Singapore refining business at hundreds of millions of dollars. Two industry experts not involved in the process gave estimated valuations for 50% of the plant ranging from US$300 million to US$500 million (RM1.3 billion to RM2.1 billion).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The SRC refinery has a crude processing capacity of around 290,000 barrels per day, making it the smallest refinery in Singapore. It includes seven shipping berths, all of which can handle very-large crude carriers (VLCCs), according to SRC's website.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Last month, Chevron sold its stake in Chevron Phillips Singapore Chemicals to Aster Chemicals and Energy, a joint venture between Chandra Asriand Glencore.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A deal for the refinery would mark the second recent exit by a global major from the Singapore refining sector, which is subject to a carbon tax that has raised operating costs and reduced competitiveness with operators elsewhere.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In April, Shell completed the sale of its facility on Singapore's Bukom and Jurong islands to the Chandra Asri-Glencore joint venture, exiting an operation dating to 1961. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759637",
            "pub_date": "2025-06-19 17:11:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}