{
    "data": [
        {
            "title": "US prepares action targeting allies’ chip plants in China, WSJ reports",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): A US official has informed leading global semiconductor companies of plans to cancel waivers allowing them to use American technology in China, the <i>Wall Street Journal</i> reported on Friday, citing people familiar with the matter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Jeffrey Kessler, under secretary of commerce for industry and security at the Commerce Department, told Samsung Electronics, SK Hynix and Taiwan Semiconductor Manufacturing this week that he wanted to cancel those waivers, <i>WSJ</i> reported.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Reuters</i> could not immediately confirm the report.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A Commerce spokesperson said in a statement, “Chipmakers will still be able to operate in China. The new enforcement mechanisms on chips mirror licencing requirements that apply to other semiconductor companies that export to China and ensure the United States has an equal and reciprocal process.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759868",
            "pub_date": "2025-06-21 10:21:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "In the spotlight",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 21): From early April to end-June, Chengco PLT resigned as auditors from as many as 35 public listed companies as a result of it being suspended for a two-year period by the Securities Commission Malaysia’s Audit Oversight Board (AOB).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The AOB among others alleged “serious audit quality issues” with Chengco’s work.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As a result, two of Chengco’s audit partners were suspended for two years, while another three partners were prohibited from accepting as clients and auditing any public interest entities or scheduled funds for a one-year period.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Interestingly, almost all the 35 companies from which Chengco resigned from recently are not doing well financially. They appear to have a penchant for large cash calls, raising funds via private placements and rights issues, and employee share option schemes (ESOS), among others.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Some of these companies seem prone to changing their financial year end, and may do so again now that their auditors have been reprimanded and unable to continue to audit them.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the spotlight is currently on Chengco and the companies it audited, the AOB says in response to questions from <em>The Edge</em> that it is the primarily the responsibility of the board of directors and management of the public interest entities to ensure that their financial statements are accurate, reliable and presented fairly in accordance with applicable accounting standards.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The AOB however adds that when audit deficiencies are found, the audit firm is expected to evaluate the implications of the relevant audits and if needed undertake corrective action.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This week’s cover story takes a closer look at some of the 35 PLCs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Grab a copy of <em>The Edge Malaysia</em> weekly today to read more.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Save by <a href=\"https://subscribe.theedgemalaysia.com/\" target=\"_blank\">subscribing</a> to us for \n      your print and/or \n      digital copy.</p></div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><strong>P/S: The Edge is also available on\n      <a href=\"https://itunes.apple.com/us/app/the-edge-markets/id990567068?ls=1&amp;mt=8\" target=\"_blank\">Apple's App Store</a> and \n      <a href=\"https://play.google.com/store/apps/details?id=com.bizedge.theedgemarkets.malaysia\" target=\"_blank\">Android's Google Play</a>.</strong></p></div></div></div>",
            "link": "https://theedgemalaysia.com/node/759872",
            "pub_date": "2025-06-21 10:21:24",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tg Malim-KL Sentral KTM and ETS train services delayed by an hour due to power supply disruption",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Tanjung Malim-KL Sentral-Tanjung Malim commuter train and electric train (ETS) services route experienced a power supply disruption on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to a Facebook post by Keretapi Tanah Melayu Berhad (KTMB), due to the power disruption, both KTM Commuter and ETS services on the route were delayed by more than an hour as trains used only a single track.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“KTMB apologises for all the inconvenience caused. Updates on train services will be given from time to time,” the post said.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759867",
            "pub_date": "2025-06-21 09:11:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cambodia Airways’ inaugural flight to Penang takes off on June 26 — Tiong",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Cambodia Airways is set to launch its inaugural flight from Phnom Penh to Penang on June 26, further enhancing bilateral ties between Malaysia and Cambodia, particularly in the tourism sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tourism, Arts and Culture Minister Datuk Seri Tiong King Sing announced the new route during a dinner with industry players in Cambodia on Thursday, held in conjunction with efforts to promote Visit Malaysia Year 2026 (VM2026).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said Cambodia Airways’ new route would operate twice a week, on Thursdays and Sundays, using an Airbus A319 aircraft with a capacity of 150 seats.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This is a significant achievement in efforts to enhance connectivity between the two countries, create more opportunities for cooperation in tourism, business and cultural exchange, and support the VM2026 campaign.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“At the same time, I’m calling on Cambodia Airways to increase the number of direct flights,” he said in a Facebook post on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tiong said that during the event he also emphasised the importance of strengthening Malaysia-Cambodia ties, particularly in the tourism, arts and culture sectors, as both nations are members of Asean.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Tourism remains a key driver of economic growth, cultural exchange and community empowerment. As the world recovers from the Covid-19 pandemic, a clear and effective strategy is essential to achieve the desired outcomes for the benefit of the people of both countries,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tiong noted that Malaysia’s diversity extends beyond its culture to its landscapes and travel experiences, each offering something unique to every traveller.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He also invited industry players and investors in Cambodia, including policymakers, to forge partnerships, open more air routes, offer attractive travel packages and facilitate easier visa access for travellers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Earlier, Tiong paid a courtesy call on Cambodian Prime Minister Hun Manet, during which they discussed, among other things, opportunities to enhance tourism cooperation between the two countries.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759864",
            "pub_date": "2025-06-21 08:21:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street edges up with Trump's Middle East decision in focus",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Wall Street's main indexes nudged higher on Friday, tracking strength in global stocks after President Donald Trump held off from making an immediate decision on US involvement in the Israel-Iran war.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump will take a call in the next two weeks, the White House said on Thursday, as hostilities between the two Middle Eastern countries approached their second week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Markets have been on edge as Trump has kept the world guessing on his plans — veering from proposing a swift diplomatic solution to suggesting the US might join the fight as Israel aims to suppress Tehran's ability to build nuclear weapons.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A senior Iranian official told <i>Reuters</i> Tehran was ready to discuss limitations on its uranium enrichment, but zero enrichment will be rejected \"especially now under Israel's strikes\". Foreign Minister Abbas Araqchi has arrived in Geneva to meet European counterparts, who are hoping to establish a path back to diplomacy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Any news flow that's going to lean in the direction of de-escalation is going to be a market positive and we're seeing that to a certain extent here,\" said Art Hogan, chief market strategist at B Riley Wealth.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Concerns about price pressures in the US were also in focus after Federal Reserve policymakers on Wednesday warned inflation could pick up pace over the summer as the economic effects of Trump's steep import tariffs kick in. They kept interest rates unchanged.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On Friday, Fed governor Chris Waller said the central bank should consider cutting interest rates at its next meeting given recent tame inflation data and because any price shock from tariffs will be short-lived.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At 10:06am ET, the Dow Jones Industrial Average rose 123.38 points, or 0.29%, to 42,295.04, the S&amp;P 500 gained 13.34 points, or 0.22%, to 5,994.21 and the Nasdaq Composite gained 38.74 points, or 0.20%, to 19,585.01.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Nine of the 11 major S&amp;P 500 sub-sectors rose. Real estate led sector gains with a 0.7% rise. On the flip side, healthcare stocks lost 0.5%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>All three main indexes are set for weekly gains.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Investors are also bracing for any potential spike in volatility from Friday's \"triple witching\" — the simultaneous expiration of single stock options, stock index futures, and stock index options contracts that happens once a quarter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Among megacap stocks, Apple advanced 1.3%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kroger rose 6.4% after the grocery chain increased its annual identical sales forecast.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mondelez International gained 2.4% after brokerage Wells Fargo upgraded the Cadbury parent to \"overweight\" from \"equal-weight\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Accenture fell 7.2% after the IT services provider said new bookings decreased in the third quarter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wall Street's strong gains last month, primarily driven by a softening in Trump's trade stance and strength in corporate earnings, had pushed the benchmark S&amp;P 500 index close to its record peaks before the ongoing conflict in the Middle East made investors risk-averse.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The S&amp;P 500 index now remains 2.4% below its record level, and the tech-heavy Nasdaq is 2.8% lower.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advancing issues outnumbered decliners by a 2.16-to-1 ratio on the NYSE and by a 1.45-to-1 ratio on the Nasdaq.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The S&amp;P 500 posted 12 new 52-week highs and 2 new lows while the Nasdaq Composite recorded 55 new highs and 31 new lows.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759863",
            "pub_date": "2025-06-21 07:41:25",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Meta partners with sports eyewear brand Oakley to launch AI-powered glasses",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Meta said on Friday it has teamed up with Oakley to release AI-powered smart glasses, expanding its push into wearable tech after the success of Ray-Ban Meta glasses.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The social media company is expanding its partnership with Oakley and Ray-Ban-parent EssilorLuxottica amid growing consumer interest in AI-powered wearable devices.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meta has sold millions of Ray-Ban Meta glasses since their launch and said its \"Oakley Meta HSTN\" will feature a hands-free high-resolution camera, open-ear speakers, water resistance and Meta AI capabilities.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The limited-edition product will be available for preorder starting July 11 at US$499 (RM2,125), with additional products starting at US$399 launching later this summer.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meta said the product line would roll out in North America, Australia and several European countries, with plans to expand to Mexico, India and the United Arab Emirates by the year-end.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Oakley Meta HSTN will debut this month at several major sporting events including Fanatics Fest and UFC International Fight Week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Smaller rival Snap said earlier this month it would launch its smart glasses, called Specs, for consumers next year. Companies such as Google are also exploring similar investments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759861",
            "pub_date": "2025-06-20 23:51:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SD Guthrie, Sime Darby Property, Wasco, Poh Huat, Gadang, Ecobuilt, Maxim, Vanzo",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Here is a brief recap of Friday’s top local business news and corporate announcements:</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Palm oil producer <b>SD Guthrie Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5285\" target=\"_blank\">SDG</a>), formerly known as Sime Darby Plantation Bhd, and its sister company <b>Sime Darby Property Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5288\" target=\"_blank\">SIMEPROP</a>) have entered into an agreement to jointly develop up to 2,000 acres of land on Carey Island, Selangor. The two parties said the agreement, following discussions that began in 2023, will be formalised through the establishment of a special purpose vehicle, which aims to support the Selangor state government’s aspiration to transform Carey Island into an industrial and logistics hub. The development will co-exist with the integrated palm oil operations on the island and complement the activities at Westport and Northport in Port Klang. — <a href=\"https://theedgemalaysia.com/node/759846\" target=\"_blank\"><i>SD Guthrie, Sime Darby Property to co-develop 2,000 acres on Carey Island into industrial, logistics hub</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Wasco Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5142\" target=\"_blank\">WASCO</a>) is planning to list its wholly-owned unit, Wasco Greenergy Bhd, which operates biomass and steam energy businesses, on the Main Market of Bursa Malaysia. The initial public offering will involve up to 150 million shares, comprising an offer for sale of up to 75 million shares by selling shareholders Wasco and Tema Energy Ventures Sdn Bhd, and a public issue of 75 million new shares. The offering represents 30% of Greenergy’s enlarged issued share capital of 500 million shares. — <a href=\"https://theedgemalaysia.com/node/759842\" target=\"_blank\"><i>Wasco plans spin-off listing of biomass energy unit on Bursa</i></a></p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Poh Huat Resources Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/7088\" target=\"_blank\">POHUAT</a>) reported a 92.05% year-on-year drop in quarterly net profit, as demand from the US softened amid tariffs and higher operating costs dented earnings. Net profit for the second quarter ended April 30, 2025 (2QFY2025) came in at just RM575,000, compared with RM7.23 million previously. This is the furniture maker’s worst earnings performance since 4QFY2024, when it reported a net loss of RM3.54 million. Quarterly revenue fell 9.24% to RM98.33 million from RM108.35 million in 2QFY2024 due to lower orders of office furniture from its Malaysian operations, as some customers had front-loaded their orders in the preceding financial period following the election of Donald Trump as US president. — <a href=\"https://theedgemalaysia.com/node/759841\" target=\"_blank\"><i>Poh Huat's quarterly profit slumps on weaker US demand, higher costs</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Gadang Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/9261\" target=\"_blank\">GADANG</a>) has secured a RM92.5 million contract to undertake earthworks for the proposed widening of the Kuala Lumpur-Karak Highway. The contract was awarded to its wholly-owned unit, Gadang Engineering (M) Sdn Bhd, by AFA Construction and Engineering Sdn Bhd on Friday. The scope of work covers Package 2A under the broader highway widening project spanning KM19.2 to KM61.5. — <a href=\"https://theedgemalaysia.com/node/759834\" target=\"_blank\"><i>Gadang bags RM92 mil contract for KL-Karak Highway widening project</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Ecobuilt Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0059\" target=\"_blank\">ECOHLDS</a>) chief executive officer Lim Chin Yen has resigned after just four and a half months at the helm of the construction company. He is succeeded by Fong Tuck Yong, effective June 20. Fong has more than 30 years of experience in leading and overseeing construction projects. — <a href=\"https://theedgemalaysia.com/node/759854\" target=\"_blank\"><i>Ecobuilt CEO Lim Chin Yen resigns after four months</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Maxim Global Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/4022\" target=\"_blank\">MAXIM</a>) has filed an appeal to overturn a stay order granted by the High Court this week that temporarily halts its high-rise residential project here. The stay applies to the development order issued by the Kuala Lumpur City Hall back in October 2017 for the development of five blocks of 30-storey apartments. — <a href=\"https://theedgemalaysia.com/node/759848\" target=\"_blank\"><i>Maxim Global files appeal to overturn court order halting high-rise project</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Vanzo Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0333\" target=\"_blank\">VANZO</a>) is making its entry into Taiwan’s fast-moving consumer goods market by appointing Taiwan-based Xishangxi International Marketing Co Ltd (XIMCL) as its exclusive distributor. The air fragrance maker said its wholly-owned subsidiary Vanzo Asia Sdn Bhd (VASB) has signed an agreement with XIMCL to distribute VASB products through both online platforms and physical retail stores via health and beauty retailer Watsons Taiwan. The two-year agreement takes effect from June 20, 2025, and runs through June 19, 2027. Vanzo products are expected to hit the shelves of some 500 Watsons outlets in Taiwan by September this year. — <a href=\"https://theedgemalaysia.com/node/759853\" target=\"_blank\"><i>Vanzo taps Taiwanese market via local distributor, Watsons</i></a></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759860",
            "pub_date": "2025-06-20 23:31:42",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil dives, stocks rally after Trump Middle East pause",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>LONDON (June 20): Stock markets ticked higher on Friday while oil headed for its biggest daily drop since April after President Donald Trump pushed back a decision on US military involvement in the Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Rising risks from the Middle East have loomed large on the world's top indexes again this week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Europe's main bourses were all between 0.5%-1.4% higher after similar gains across Asia, although it was touch and go whether it would be enough to prevent a second straight weekly loss for MSCI's main world index.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Israel bombed targets in Iran, and Iran fired missiles at Israel overnight as the week-old war continued but Friday's market moves, which also included a modest drop in the dollar, showed an element of relief.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That was largely pinned on Thursday's statement from the White House that Trump will decide in the next two weeks — rather than right away — whether the US will get involved in the war.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European foreign ministers were meeting their Iranian counterpart in Geneva on Friday, seeking a path back to diplomacy over its contested nuclear programme.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The relief the US wasn't charging into the conflict sent oil prices LCOc1 down as low as US$76.10 per barrel, although they are still up 4% for the week and 20% for the month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Brent crude is down 2.5% today in the clearest sign that fears over an imminent escalation in the Israel/Iran conflict have eased,\" MUFG strategist Derek Halpenny said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gold, another traditional safe-haven play for traders, was also lower on the day and Nasdaq, S&amp;P 500, and Dow futures had all moved into the green as Wall Street prepared to get going again having been closed on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Asian shares had gained 0.5% overnight thanks to a 1.2% jump in Hong Kong's Hang Seng and as newly elected President Lee Jae Myung's stimulus plans saw South Korea's Kospi top 3,000 points for the first time since early 2022.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China's central bank held its benchmark lending rates steady as widely expected in Beijing, while data from Japan showed core inflation there hit a two-year high in May, keeping pressure on the Bank of Japan to resume interest rate hikes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That in turn lifted the yen and pushed down the export-heavy Nikkei in Tokyo.</p></div>\n<h3>Oil retreats</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The dollar was ending an otherwise positive week on a modest downer, with the euro EUR=EBS up 0.3% against the US currency at US$1.1527 and the pound 0.2% higher at US$1.3494.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US bond market, which was also closed on Thursday, resumed trading with the key 10-year Treasury bond yield flat at 4.39%, while German 10-year yields, which serve as Europe's borrowing benchmark rate, fell 2.5 basis points to 2.49%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gold prices eased 0.8% to $3,345 an ounce, leaving them set for a weekly loss of 2.5%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But the main commodity market focus remained oil. Brent crude futures LCOc1 were last down US$2.45, or around 3%, at US$76.43 a barrel in London although they were still on track to end the week almost 3% higher.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PVM analyst John Evans said oil producers' \"nightmare scenario\" was that Iran or its proxies could block the Strait of Hormuz, something which has never happened and through which 20 million barrels is shipped each day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>JPMorgan estimates that amounts to about 20% of all global oil trade and 30% of seaborne oil trade.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The market is currently assigning a probability below 20% to this happening,\" JPMorgan's Francesco Arcangeli wrote in a note, estimating thought that a full closure of the Strait could see oil prices surge to US$120-US$130 a barrel.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759748",
            "pub_date": "2025-06-20 23:21:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla set to open India showrooms in July with made-in-China EVs — Bloomberg",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Tesla Inc is set to open its first showrooms in India in July, people familiar with the discussions said, kicking off formal operations in the world’s third-biggest automobile market as the Elon Musk-led firm hunts for growth amid falling sales in Europe and China.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The electric vehicle giant’s first set of cars have arrived in the country — Model Y rear-wheel drive SUVs shipped from Tesla’s China factory, according to the people, who asked not to be identified as the information is private, as well as documents seen by <i>Bloomberg New</i>s. The Model Y is the world’s largest selling electric car.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla is set to open its first showroom in Mumbai as early as mid-July, which will be followed by one in New Delhi, according to the people. It has also imported Supercharger components, car accessories, merchandise and spares from the US, China and the Netherlands, the documents show.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The debut will end a years-long on-again, off-again saga over Tesla’s entry into India — a market Musk has long eyed but held back from entering due to disagreements over tariffs and local manufacturing. The breakthrough in bringing Tesla to India comes after Musk met Indian Prime Minister Narendra Modi in the US in February. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Bloomberg News</i> reported in February that Tesla was set to ship a few thousand cars to a port near Mumbai.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla spokespersons did not immediately respond to an email seeking comment on opening of the India showrooms and the preparations underway. </p></div>\n<h3>Premium price</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Five Model Y vehicles have already arrived in Mumbai from Tesla’s Shanghai factory, according to documents reviewed by <i>Bloomberg News</i>. The cars were declared at 2.77 million rupees (US$31,988 or RM136,205) and attracted more than 2.1 million rupees in import duties — a levy that’s consistent with India’s 70% tariff on fully-built imported cars under US$40,000 plus surcharges, the documents show.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The model is expected to go on sale for more than US$56,000 before taxes and insurance, though Tesla will determine the final sticker price based on its margin and positioning strategy, according to people familiar with the plans.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That compares with an ex-showroom price of US$44,990 for the same model in the US, which sells for US$37,490 once tax credits are applied.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The premium price tag will likely be a major hurdle to Tesla’s plans as the automaker will need to convince value-driven consumers to open their wallets. EVs account for just over 5% of new passenger vehicle sales in India, but premium cars still represent less than 2% of the market, data with Indian government’s vehicle registration portal show.</p></div>\n<h3>Beefing up</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company hasn’t appointed a new country head following the departure of Prashanth Menon, but is beefing up hiring across charging, retail and policy teams, according to people familiar with the matter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Model Y imports represent an initial foray into the market and Tesla plans to expand its presence, including offering more models.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It’s leasing warehouse space in Karnataka, in India’s south, and is adding more in Gurugram, outside New Delhi, the people said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla executives from other countries are making weekly visits, the people said, to the Mumbai and New Delhi showrooms, which are in high-profile, luxury business precincts in an effort to attract affluent shoppers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759855",
            "pub_date": "2025-06-20 23:01:33",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ecobuilt CEO Lim Chin Yen resigns after four months",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Ecobuilt Holdings Bhd's (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0059\" target=\"_blank\">ECOHLDS</a>) chief executive officer Lim Chin Yen has resigned after just four and a half months at the helm of the construction company.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a bourse filing on Friday (June 20), the company said Lim, 48, resigned “to dedicate more time to family and pursue personal interest”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Lim is succeeded by Fong Tuck Yong, 52, effective June 20. The company said Fong has more than 30 years of experience in leading and overseeing construction projects.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ecobuilt has been in the red for the past three years. It posted a loss after tax of RM44.5 million in FY2024, RM31.1 million in FY2023 and RM13.6 million in FY2022, according to its annual report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The FY2024 result reflects a 15-month financial period — from June 1, 2023, to Aug 31, 2024 — following a change in the company's financial year-end from May 31 to August 31.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company remained in the red for its latest quarter. It posted a net loss of RM584,000 for the second quarter ended Feb 28, 2025 (2QFY2025) on the back of revenue of RM15.48 million. There is no comparative year-on-year figure due to the change in the company's financial year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company noted that the gross profit generated from ongoing projects during the quarter was insufficient to offset operating expenses, which mainly consisted of depreciation and staff costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ecobuilt’s shares closed up half a sen or 20% to three sen on Friday, bringing the group a market capitalisation of RM13 million. The stock has fallen 54% over the past one year.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759854",
            "pub_date": "2025-06-20 22:51:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vanzo taps Taiwanese market via local distributor, Watsons",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Vanzo Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0333\" target=\"_blank\">VANZO</a>) is making its entry into Taiwan’s fast-moving consumer goods (FMCG) market by appointing Taiwan-based Xishangxi International Marketing Co Ltd (XIMCL) as its exclusive distributor.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a bourse filing on Friday, the air fragrance maker said its wholly-owned subsidiary Vanzo Asia Sdn Bhd (VASB) has signed an agreement with XIMCL to distribute VASB products through both online platforms and physical retail stores via health and beauty retailer Watsons Taiwan.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The two-year agreement takes effect from June 20, 2025, and runs through June 19, 2027. Vanzo products are expected to hit the shelves of some 500 Watsons outlets in Taiwan by September this year.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The agreement will be automatically renewed unless either party provides written notice of its intention not to do so at least three months before the expiration date. It will also be automatically terminated if Watsons places no orders for three consecutive months or if the products are delisted by Watsons.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, under the agreement, VASB reserves the right to authorise XIMCL to expand distribution to additional key retail channels.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"This initiative shall enable VASB to further expand its market presence in Taiwan’s FMCG market through additional key retail channels, including pharmacies, supermarkets, minimarkets and convenience stores,\" the company said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The agreement is expected to contribute positively to the group’s revenue and earnings beginning from the financial year ending Sept 30, 2026 (FY2026). The working capital required under the agreement will be funded through Vanzo’s internally generated funds and resources.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company is principally involved in the design, marketing, and sale of air fragrances and fragrance-related products. Its product range primarily includes car fragrances, indoor fragrances, as well as personal and household care products. To complement these offerings, the company also markets and sells related accessories such as candle tool sets, rechargeable electric lighters and anti-slip car mats.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Since 2022, Vanzo has established several retail kiosks in shopping malls across Kuala Lumpur, Putrajaya, Selangor, Sarawak and Johor. Beyond Malaysia, it has also expanded its geographical footprint to Singapore, Brunei and Australia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At Friday’s close, Vanzo — which was listed on December 17 last year — saw its shares unchanged at 15.5 sen, hovering near its initial public offering (IPO) price of 15 sen, with a market capitalisation of RM72.3 million. The counter has declined 26.19% year to date.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759853",
            "pub_date": "2025-06-20 22:41:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Baltic Exchange shipping updates: June 20, 2025",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><strong>A weekly round-up of tanker and dry bulk market (June 20, 2025)</strong></p></div>\n<div class=\"pb-5 imgw-800 mx-auto d-block\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/BDI-BDI210624190625-20062025_20250620205607.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/BDI-BDI210624190625-20062025_20250620205607.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><strong>This report is produced by the Baltic Exchange.</strong></p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>The Baltic Exchange, a wholly-owned subsidiary of Singapore Exchange, is the world's only independent source of maritime market information for the trading and settlement of physical and derivative contracts.</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Its international community of over 650 members encompasses the majority of world shipping interests and commits to a code of business conduct overseen by the Baltic.</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>For daily freight market reports and assessments, please visit <a href=\"http://www.balticexchange.com/\" target=\"_blank\">www.balticexchange.com</a>.</em></p></div>\n<h3>Capesize</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Capesize market trended downwards this week, with sentiment consistently softening, particularly in the Pacific. C5 rates came under pressure as iron ore volumes from West Australia declined. While coal cargoes from East Australia offered some support, they weren’t enough to offset the broader weakening. C5 rates steadily fell from US$11.00 early in the week to the low-mid US$9.00s by week's end. In the Atlantic, the week began on firmer footing, with limited tonnage and a steady cargo flow sustaining rates. However, as the week progressed, both trans Atlantic and fronthaul routes saw offers ease. On the South Brazil to China (C3) route, a clear pattern of backwardation emerged, with rates slipping from the high US$26.00s to the low US$20.00s. Overall, the week marked a reversal of recent gains, with the BCI 5TC shedding over US$7,000 to settle at US$23,879 by Friday.</p></div>\n<h3>Panamax</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A subdued week for the Panamax sector. Trans-Atlantic trades were few and far between, and a general decline became evident in both grain and mineral demand in the basin. EC South America returned a contrasting week with some mixed rates reported, limited activity overall but P6 index dates appeared well balanced while first-half July arrival dates began the week on a firm footing only to weaken as limited demand pitted against an increased tonnage count undermined any potential upside in rates. Typically, midweek fixtures for index arrival dates hovered between US$11,500 and US$13,000 basis 82,000-dwt types delivery India-SE Asia range. The Asian market continued to ease throughout the week, with support hard to come by as the tonnage count continued to grow, and with limited enquiry ex NoPac mineral demand ex Australia and Indonesia returned insufficient to prevent the slow erosion of rates in the arena. On the period front, there were reports of an 82,000-dwt delivery Taiwan agreeing US$11,000 basis 6/8 months trading.</p></div>\n<h3>Ultramax/Supramax</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A rather positional week overall for the sector. The Atlantic saw better demand, a 58,000-dwt fixed delivery SW Pass for trip to EC Mexico at US$21,000. However, as the week closed this upward pressure seemed to be easing slightly. The South Atlantic remained active, a 63,000-dwt fixing delivery Recalada for a trip China at US$14,000 plus US$400,000 ballast bonus. By contrast the Continent-Mediterranean lacked much impetus and rates remained rather subdued. A rather slow start from the Asian arena although as the week progressed better levels of inquiry were seen from the NoPac and Indonesia. However, with aa good amount of prompt tonnage in the Indian Ocean rates remained in check. From the north, NoPac rounds from China for the 63,000-dwt were around the mid US$12,000s while from the south, a 56,000-dwt fixed a trip from SE Asia to China in the low US$10,000s. The Indian Ocean lacked impetus, a 61,000-dwt fixed a trip from the Arabian Gulf to Australia with steels billets at US$9,500.  </p></div>\n<h3>Handysize</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This week, the market showed varied trends across the regions. In the Continent and Mediterranean, conditions remained soft with limited fresh inquiries. A 32,000-dwt open Tema 20/24 June fixed for a West Africa coastal trip in the mid/high teens. In contrast, the South Atlantic and US Gulf regions maintained robust activity, supported by consistent fresh demand. A 33,000-dwt ballasting from West Africa was fixed delivery Recalada for a trip to the Continent at US$17,500. Meanwhile, a 37,000-dwt was fixed delivery Palm Beach end June via US Gulf redelivery UK-Continent with wood pellets at US$18,000. The Asian markets remained quiet, with reports of longer tonnage list in Southeast Asia and the North Pacific. Despite this, rates stayed largely steady. A 34,000-dwt vessel was fixed on delivery Hong Kong for a Far East redelivery at US$9,000. On the period front, interest remained limited. A 28,000-dwt vessel was reported fixed from delivery Southeast Asia for 4-6 months period at US$9,650.</p></div>\n<h3>Clean</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>LR2</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>LR2’s in the MEG saw the inevitable spike this week. The TC1 75kt MEG/Japan index sailed up 91.95 points to WS211.39. A TC20 90kt MEG/UK-Continent trip also went from US$3.56 million to $5.17 million. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>West of Suez, Mediterranean/East LR2’s also ticked up US$251,000 over the US$3 million mark to US$3.12 million for a TC15 index run.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>LR1</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MEG LR1’s also shot upwards this week. The TC5 55kt MEG/Japan index went from WS142.19 to WS218.13. A voyage west on TC8 65kt MEG/UK-Continent also gained US$1,125,020 to US$3.91 million. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the UK- Continent LR1 freight levels held static for the fifth week in a row. The TC16 60kt ARA/West Africa index crept up 1.81 points to WS115.56.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>MR</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MRs in the MEG also saw their freight spike dramatically this week. The TC17 35kt MEG/East Africa index as a result soared upward by 127.14 points to WS362.14.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>UK-Continent MRs were sedate this week. The TC2 37kt ARA/US-Atlantic coast leaked a few points of value across the week, going from WS132.19 to WS120 where it has settled for the last two days at time of writing. The Baltic Time Charter equivalent round trip, as a result dipped below US$10,000 and currently sits at US$9,134.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>USG MRs had an appreciation of their own this week. The TC14 38kt US-Gulf/UK-Continent trip went from WS112.86 to WS164.29 by Wednesday only to drop back to WS145.71 the following day. A Caribbean run on TC21, 38kt US-Gulf/Caribbean also ultimately was assessed US$100,000 better than the beginning of the week at US$717,857.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The MR Atlantic Triangulation Basket TCE went from US$20,716 to US$24,307 with a stop at US$27,409 mid-week.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Handymax</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Mediterranean Handymax of TC6, 30kt Cross Mediterranean, continued along their current path of WS130 for the second week on week. Up on the UK-Continent the TC23 30kt Cross UK-Continent dipped 16.11 points to WS143.89.    </p></div>\n<h3>VLCC</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Continued tensions and escalation of attacks between Israel and Iran have had a major impact on the VLCC market predominantly in the Middle East due to the increased risk and on the back of this markets elsewhere have been boosted. The rate for the 270,000 mt Middle East Gulf to China trip (TD3C) has shot up at least 22 points, with further gains likely, to WS75.8 corresponding to a round-trip TCE of US$57,758.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the Atlantic market, the rate for 260,000 mt West Africa/China (TD15) has risen 16 points to WS68.81 giving a round voyage TCE of just shy of US$50,000 per day. In the US Gulf region, the rate for the TD22 route of 270,000 mt US Gulf to China climbed US$1,352,500 to US$7,462,500 which shows a daily round trip TCE of US$35,656.</p></div>\n<h3>Suezmax</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Suezmax owners have managed to turn things around and see firmer rates on all the Baltic Exchange routes. The rate for the 130,000 mt Nigeria/UK Continent voyage (TD20) regained 12.5 points to WS89.72 meaning a daily round-trip TCE of US$35,251. The TD27 route (Guyana to UK Continent basis 130,000 mt) has improved a little over 12.5 points to WS86.94 translating to a daily round trip TCE of about US$33,100 basis discharge in Rotterdam. The TD6 route of 135,000 mt CPC/Augusta gained nine points to WS104.1 giving a daily TCE of around US$37,800. In the Middle East, due to the increased tensions and escalation of attacks, the rate for the TD23 route of 140,000 mt Middle East Gulf to the Mediterranean (via the Suez Canal) has increased by 16 points to WS102.5.</p></div>\n<h3>Aframax</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the North Sea market for the 80,000 mt Cross-UK Continent route (TD7) the rate eased two points to the WS120 level giving a daily round-trip TCE of about US$31,700 basis Hound Point to Wilhelmshaven.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the Mediterranean, the rate for 80,000mt Cross-Mediterranean (TD19) is firmer by just over eight points at WS139.44 (basis Ceyhan to Lavera, that shows a daily round trip TCE of a little over US$32,200).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Across the Atlantic, the shorter routes the Baltic Exchange produces has had a yo-yo week with rates climbing on Monday, falling Tuesday, and rising again on Wednesday. Overall, the 70,000 mt East Coast Mexico/US Gulf route (TD26) and the 70,000 mt Covenas/US Gulf route (TD9) has risen about 14-15 points week-on-week to the WS154 level and WS150, respectively. This translates into a daily round-trip TCE of about US$32,500 and US$30,500.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The rate for the trans-Atlantic route of 70,000 mt US Gulf/UK Continent (TD25) similarly ballooned nearly 20 points on Monday and has now steadily shrunk back to WS143.06, an increase of five points overall week-on-week, giving a round trip TCE basis Houston/Rotterdam of a little over US$32,100 per day.</p></div>\n<h3>LNG</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The LNG market surged this week across all major routes, as prompt vessel availability tightened significantly ahead of early July loadings. Gains were led by a spike in Atlantic activity, while the Pacific also posted strong advances amid a limited tonnage list.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the BLNG1 Australia–Japan route, rates jumped US$10,400 for 174k cbm vessels to US$33,000 per day, while 160k cbm ships rose US$8,200 to US$21,000 per day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Atlantic basin routes posted the strongest gains. BLNG2 US Gulf–Continent climbed US$11,500 for 174k cbm units to US$49,300 per day, and US$10,000 for 160k cbm ships, settling at US$26,900 per day. The sharp rise reflects a tightening list and heightened interest in mid-summer coverage.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BLNG3 US Gulf–Japan posted the largest increases of the week, surging US$18,900 to US$60,500 per day for 174k cbm vessels. Smaller 160k cbm units rose US$17,000 to US$36,400 per day, as long-haul demand accelerated.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Time charter markets also firmed. Six-month TC rates added US$300 to reach US$38,750 per day, and one-year rates gained US$500 to US$40,500. Three-year charters held flat at US$56,000 per day.</p></div>\n<h3>LPG</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The LPG market surged across all major routes this week, driven by heightened geopolitical tensions in the Middle East, which sparked a significant jump in freight levels and sharply tightened sentiment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the BLPG1 Ras Tanura–Chiba route, rates jumped by US$8.42 to US$85.83 per tonne, with TCE earnings gaining US$8,356 to US$71,244 per day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The BLPG2 Houston–Flushing route also rallied, with rates climbing US$4.50 to US$70.25 and TCE returns rising US$5,098 to US$74,232 per day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The BLPG3 Houston–Chiba route followed suit, gaining US$4.33 to US$125.67 per tonne. TCE earnings increased US$2,265 to US$53,756 per day, underpinned by healthy trans Pacific demand and tightening positions heading into July.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Overall, the market firmed significantly, with sentiment shifting higher on the back of mounting uncertainty and limited prompt availability.</p></div>\n<h3>Container</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The liner market looks to have peaked for now, there has been a reduction in rates on the trans Pacific trade and Far East to Mediterranean trade, over capacity may have played a part here with GRI’s hard to sustain by liner companies, however rates from the East to the Atlantic have remained steady over the week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the rising tensions in the Middle East and threats by Iran to close the Strait of Hormuz, there may not be too much change in the liner market as most large container vessels have been for some time been routing via the Cape of Good Hope, with only some smaller container vessels using the Suez Canal.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>FBX01 (China/East Asia – USA West Coast) ended the week at US$4,516/FEU, down US$1,415/FEU from the same time last week. FBX03 (China/East Asia – USA East Coast) closed the week at US$7,177/FEU marginally up from US$7,124/FEU the week before. FBX11 (China/East Asia – North Europe), finished the week at US$2,966/FEU, up US$26 on last week. FBX13 (China/East Asia to Mediterranean) rates dipped to US$4,360/FEU before finishing the week US$211 less than end of the previous week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Disclaimer:</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>While reasonable care has been taken by the Baltic Exchange Information Services Limited (BEISL) and The Baltic Exchange (Asia) Pte. Ltd. (BEA, and together with BEISL being Baltic) in providing this information, all such information is for general use, provided without warranty or representation, is not designed to be used for or relied upon for any specific purpose, and does not infringe upon the legitimate rights and interests of any third party including intellectual property. The Baltic will not accept any liability for any loss incurred in any way whatsoever by any person who seeks to rely on the information contained herein.</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>All intellectual property and related rights in this information are owned by the Baltic. Any form of copying, distribution, extraction or re-utilisation of this information by any means, whether electronic or otherwise, is expressly prohibited. Persons wishing to do so must first obtain a licence to do so from the Baltic.</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759851",
            "pub_date": "2025-06-20 21:51:24",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fomca backs new RP4 electricity tariff, calls it fair and timely",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Federation of Malaysian Consumers Associations (Fomca) has expressed full support for the implementation of the new electricity tariff structure under Regulatory Period 4 (RP4), describing it as timely, progressive and beneficial for Malaysian households.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Fomca chief executive officer Dr T Saravanan said the new tariff, which will take effect from July 1, 2025, to Dec 31, 2027, under the Incentive-Based Regulation (IBR) framework, reflects a fairer and more transparent energy pricing system.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This initiative comes at a crucial time when many households are facing financial pressures due to inflation and the rising cost of living,” he told Bernama.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said the revised tariff structure reduces the average base tariff from 45.62 sen/kWh to 45.40 sen/kWh, contributing to an estimated 19% reduction in total average electricity costs compared to the previous regulatory period.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Although the rate cut may appear marginal, Saravanan said it is supported by structural reforms that provide greater protection to domestic consumers, particularly those in the B40 and M40 income groups.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Saravanan said the introduction of the “Energy Efficiency Incentive” allows households that consume 1,000 kWh or less per month to avoid any tariff increase, thereby rewarding energy-efficient users and encouraging responsible consumption.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The updated structure also includes a more detailed billing system, with breakdowns of energy generation, network usage, capacity charges, and retail costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This level of transparency empowers consumers to understand their bills better and provides clarity on how costs are derived, thereby enhancing trust and enabling more responsible consumption decisions,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The expanded “Time of Use” (TOU) scheme now includes weekends and off-peak weekday hours from 10pm to 2pm the next day, enabling consumers to enjoy further savings by shifting high-usage activities to these periods.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Fomca also welcomed continued protection for vulnerable groups, including a RM40 monthly rebate for hardcore poor households under the e-Kasih programme, and dedicated tariffs for the agriculture, water, sanitation, and rail sectors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A 10% rebate for educational institutions, places of worship, and registered welfare homes will also remain in place.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Saravanan said the replacement of the Imbalance Cost Pass-Through (ICPT) mechanism with the new Automatic Fuel Adjustment (AFA) system would enhance price responsiveness to global fuel and currency movements, but stressed the need for clear communication on any resulting price changes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He also urged the Domestic Trade and Cost of Living Ministry to step up enforcement against unjustified price hikes in essential goods that may be triggered by the tariff adjustment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Fomca will continue to monitor the implementation closely and advocate for ongoing consumer engagement, education and regulatory enforcement to maximise the impact of this policy reform,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Energy Commission today announced that starting July 1, 2025, over 23.6 million domestic users in Peninsular Malaysia will benefit from fairer and more progressive electricity rates under the newly approved tariff schedule for Regulatory Period 4 (2025–2027).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This includes changes to the average base tariff rate, the tariff structure and the fuel cost adjustment mechanism, implemented under the Incentive-Based Regulation framework.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759847",
            "pub_date": "2025-06-20 21:21:42",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maxim Global files appeal to overturn court order halting high-rise project",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Maxim Global Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/4022\" target=\"_blank\">MAXIM</a>) has filed an appeal to overturn a stay order granted by the High Court this week that temporarily halts its high-rise residential project here.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a filing on Friday, Maxim said the stay applied to the development order issued by the Kuala Lumpur City Hall (DBKL) back in October 2017 for the development of five blocks of 30-storey apartments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to Maxim, the stay was granted pending the outcome of a judicial review initiated by a petitioner against DBKL.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The petitioner is challenging the development order on the grounds that it allegedly conflicts with the Kuala Lumpur Structure Plan 2020 and the Kuala Lumpur City Plan 2020.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Maxim said that it only became aware of the legal action in August 2024, and applied to be included as a respondent to safeguard its interests in the development.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The developer added that it has now filed an appeal to the Court of Appeal seeking to vacate the stay order.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Citing its solicitors, Maxim said it has a high chance of success in the appeal.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, the financial and operational impact remains uncertain until the matter is resolved. “Until the status of the matter is clearer, the board is not in a position to determine the financial impact on the group,” the company said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares in Maxim settled down half a sen or 1.32% at 37.5 sen on Friday, giving the group a market capitalisation of RM275.73 million.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759848",
            "pub_date": "2025-06-20 21:21:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Audi could build plant in US to placate Trump, Spiegel reports",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BERLIN (June 20): Volkswagen's premium brand Audi could build a plant at a new location in the United States under scenarios being considered to placate President Donald Trump in the tariff conflict, the <em>Spiegel </em>news magazine reported on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Audi is considering building a plant in the southern US, which would be the more expensive option out of a number of scenarios being considered, with company sources estimating costs of up to 4 billion euros (US$4.6 billion), the report said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>An Audi spokesperson said that the company aims to build up more of a presence in the United States.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We are currently examining various scenarios for this. We are confident that we will make a decision this year in consultation with the (Volkswagen) group on how this will look in concrete terms,\" she said in an emailed statement, reaffirming earlier comments made by the company.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Audi has no production of its own in the US, but Volkswagen has a plant in Chattanooga, Tennessee and one under construction near Columbia, South Carolina.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump's announcement of sweeping tariffs has already racked up hundreds of millions of euros in costs for German carmakers heavily reliant on their export business, according to an industry representative.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BMW, Mercedes-Benz and Volkswagen are in talks with Washington over a possible import tariff deal, seeking to use their US investments and exports as leverage to soften any blow, sources have told Reuters.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759844",
            "pub_date": "2025-06-20 21:11:33",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SD Guthrie, Sime Darby Property to co-develop 2,000 acres on Carey Island into industrial, logistics hub",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Palm oil producer SD Guthrie Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5285\" target=\"_blank\">SDG</a>), formerly known as Sime Darby Plantation Bhd, and its sister company Sime Darby Property Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5288\" target=\"_blank\">SIMEPROP</a>) have entered into an agreement to jointly develop up to 2,000 acres of land on Carey Island, Selangor.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The two parties said the agreement, following discussions that began in 2023, will be formalised through the establishment of a special purpose vehicle (SPV), which aims to support the Selangor state government’s aspiration to transform Carey Island into an industrial and logistics hub.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The development will co-exist with the integrated palm oil operations on the island and complement the activities at Westport and Northport in Port Klang.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We laud and greatly support this joint venture (JV) between SD Guthrie and Sime Darby Property, which aligns with national aspirations and GEAR-uP (Government-linked Enterprise Activation and Reform Programme) initiatives by the government in catalysing domestic investments,\" said Permodalan Nasional Bhd (PNB) president and group chief executive Datuk Abdul Rahman Ahmad in the joint statement by the two companies.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the shareholding structure of the JV was not disclosed, the companies noted that PNB will nominate the chairman of the newly formed SPV.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SD Guthrie currently owns 79% of Carey Island, or approximately 28,646 acres, which include two palm oil estates, palm oil mills, a kernel crushing plant, a biodiesel plant, research and development facilities, a robotics and innovation centre, and a nursery.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Palm oil produced on Carey Island is processed in two major refineries located in Langat and Port Klang, serving customers worldwide. The island is also home to 14 historical buildings listed as heritage sites by Jabatan Warisan Negara, in addition to a large biodiversity park and sensitive mangrove ecosystems managed by SD Guthrie.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Complementing the existing plantation business, the new development on Carey Island is expected to drive economic growth, create job opportunities, and uplift the local economy, while preserving the site's valuable heritage elements.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Abdul Rahman added that the collaboration between PNB's two strategic companies \"will provide a boost towards the sustainable development\" of this high potential area as well as \"help bolster further Malaysia's economic and industrialisation growth”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to the statement, Carey Island provides the scalability required for world-class logistics facilities, integrated supply chains and high-value industrial developments to attract global players and investments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It added that the port will thus be well-positioned to compete with regional ports in Singapore, Thailand, and Vietnam, giving a boost to Malaysia’s aspirations to become a logistics powerhouse in the region.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Carey Island has been identified by the government as the new site for a world-class port due to its suitable and strategic location near Port Klang, and proximity to Pulau Indah,\" said SD Guthrie group managing director Datuk Mohamad Helmy Othman Basha.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Additionally, the island is conveniently connected to the city via the South Klang Valley Expressway (SKVE) which integrates with the North-South Expressway, ensuring accessibility. The highways and connectivity offer tremendous potential for the area to grow into an industrial and logistics hub, while enabling the thriving plantation business in the area to continue,” he added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Sime Darby Property group managing director and chief executive officer Datuk Seri Azmir Merican said the partnership with SD Guthrie is a \"timely opportunity to unlock value in Carey Island\" as a dynamic port and advance the nation’s aspirations of becoming a regional logistics and economic hub.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The collaboration allows us to begin master planning and designing a future-ready industrial ecosystem that will serve the needs of businesses and communities for years to come, in line with 'our Purpose to be a Value Multiplier' for people, businesses, economies and the planet,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At market close, shares of SD Guthrie fell six sen or 1.3% to RM4.49, giving the plantation giant a market capitalisation of RM31.1 billion, while Sime Darby Property slipped four sen or 2.8% to RM1.39, valuing the property firm at RM9.45 billion.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759846",
            "pub_date": "2025-06-20 21:11:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK regulator to probe Amazon over delayed supplier payments",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The UK’s supermarket regulator is investigating Amazon.com Inc over delayed payments to the online retailer’s suppliers. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Groceries Code Adjudicator (GCA) said Friday it has reasonable grounds to suspect Amazon has breached rules relating to payments, based on evidence from a range of sources. The company could face a fine of as much as 1% of its annual revenue in the UK if a breach is confirmed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“While we are disappointed with this decision, we welcome the opportunity to further demonstrate our ongoing compliance with this particular section of the Code,” Amazon said in a statement. The company has already made improvements for grocery suppliers including payment practices, resulting in fewer complaints, it said. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The GCA told Amazon last year it must take “swift and comprehensive” action to comply with the code after suppliers’ complaints. The body said it has heard of other issues at Amazon and that a further investigation may be needed, without giving details.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It’s the first time the regulator is investigating Amazon since it was designated as a grocery retailer in 2022, bringing the company under the GCA’s watch and subject to the same rules as supermarket chains such as Tesco plc.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The GCA previously investigated Tesco over delayed payments to suppliers and the supermarket’s demand for payments in exchange for preferential product placement in stores. The retailer made an apology in 2016 and said it would work to rebuild trust with manufacturers. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759843",
            "pub_date": "2025-06-20 20:31:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Poh Huat's quarterly profit slumps on weaker US demand, higher costs",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Poh Huat Resources Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/7088\" target=\"_blank\">POHUAT</a>) on Friday reported a 92.05% year-on-year drop in quarterly net profit, as demand from the US softened amid tariffs and higher operating costs dented earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Net profit for the second quarter ended April 30, 2025 (2QFY2025) came in at just RM575,000, compared with RM7.23 million previously, the furniture maker's filing with Bursa Malaysia showed. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This is the company's worst earnings performance since 4QFY2024, when it reported a net loss of RM3.54 million.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Quarterly revenue fell 9.24% to RM98.33 million from RM108.35 million in 2QFY2024. The company attributed this to lower orders of office furniture from its Malaysian operations, as some customers had front-loaded their orders in the preceding financial period following the election of Donald Trump as US president.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shipment from its Vietnam factories for home factories remained low, with some US customers holding back orders in April following the imposition of US import tariff, the company added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat declared a second interim dividend of two sen per share, payable on July 24. This brings its year-to-date dividends to four sen per share.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat said higher material and labour costs, coupled with fixed factory overheads amid lower capacity utilisation in both its Malaysian and Vietnamese factories, contributed to the lower gross profit.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company booked a foreign exchange loss of RM1.8 million in the quarter, resulting in a lower net other income of RM700,000. It posted a forex gain of RM2.28 million and net other income of RM5.78 million in 2QFY2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the first six months of FY2025, Poh Huat's net profit declined 42.65% to RM10.06 million, from RM17.53 million in the previous corresponding period, as revenue decreased 2.05% to RM234.59 million from RM239.49 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On its prospects, Poh Huat said it will continue to stay informed about US trade policies as the industry remains in a “state of flux” under Trump’s administration.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat’s shares closed one sen or 0.93% lower at RM1.06 on Friday, giving the company a market capitalisation of RM295 million. The counter has dropped 27% over the past one year.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759841",
            "pub_date": "2025-06-20 20:11:46",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wasco plans spin-off listing of biomass energy unit on Bursa",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Wasco Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5142\" target=\"_blank\">WASCO</a>) is planning to list its wholly owned unit, Wasco Greenergy Bhd, which operates biomass and steam energy businesses, on the Main Market of Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The initial public offering (IPO) will involve up to 150 million shares, comprising an offer for sale of up to 75 million shares by selling shareholders Wasco and Tema Energy Ventures Sdn Bhd, and a public issue of 75 million new shares. The offering represents 30% of Greenergy’s enlarged issued share capital of 500 million shares.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The institutional offering will consist of up to 119.5 million shares, made up of 75 million offer shares and 44.5 million new shares, with the final price to be determined via bookbuilding.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The retail offering will involve 30.5 million shares, of which five million shares will be allocated to eligible employees and directors of Greenergy and Wasco, 15.5 million shares to entitled Wasco shareholders, and 10 million shares to the Malaysian public via balloting.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The initial retail price will be set prior to the launch of the prospectus, according to its filing with Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Proceeds from the public issue, which will accrue entirely to Greenergy, will be used to fund business expansion — particularly in biomass steam power plants — as well as its operations in Indonesia, capital expenditure, digitalisation initiatives, and research and development.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, proceeds from the offer for sale, which will go to Wasco, are earmarked for working capital and general corporate purposes. The final quantum will depend on the IPO pricing, which has yet to be finalised.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Greenergy currently owns a 100% stake in Wasco AgroTech Sdn Bhd and a 60% stake in Wasco Thermal Sdn Bhd (WTSB).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As part of a pre-IPO restructuring, Greenergy will acquire the remaining 40% stake in WTSB from Tema Energy for RM19.3 million, to be satisfied through the issuance of 14.4 million new shares at RM1.34 each. Following the acquisition, Greenergy will undertake a bonus issue of 295.6 million shares on a pro-rata basis to Wasco and Tema Energy. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tema Energy’s shareholders include Tee Kian Lim (26.35%), Teh Khim Choon (25.18%) and Soo Hock Tiong (22.26%).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The proposed acquisition is conditional upon, among others, approval from the Securities Commission Malaysia (SC) and is expected to be completed prior to the registration of Greenergy’s prospectus with the SC.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The proposals are expected to be completed by the fourth quarter of 2025. CIMB Investment Bank Bhd has been appointed as the principal adviser for the exercise.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of Wasco closed down 2.5 sen or 2.56% at 95 sen on Friday, giving it a market capitalisation of RM751.2 million. </p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759842",
            "pub_date": "2025-06-20 20:11:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SC adds 59 entities to Investor Alert List in 1Q",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Securities Commission Malaysia (SC) added 59 names to its Investor Alert List in the first quarter (1Q) of this year, said chairman Datuk Mohammad Faiz Azmi.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said this move is part of ongoing efforts to combat the increasingly rampant scams, alongside blocking fraudulent websites and social media pages.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“In 2024, we added 273 names to the Alert List, and in the 1Q this year, we added another 59,” he said during his opening remarks at the launch of the Bersama InvestSmart @ Pahang 2025 programme.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The event was officiated by Pahang Investment, Industrial Development, Science, Technology and Innovation Committee chairman Datuk Mohamad Nizar Mohamad Najib.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohammad Faiz added that the SC also collaborates closely with the Malaysian Communications and Multimedia Commission (MCMC) to block these deceptive sites.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Last year, we blocked 153 websites and 261 social media pages. In the 1Q, we blocked 29 websites and 91 social media pages. These numbers show how much illicit activity we are fighting daily,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As of May 2025, he said, the SC had received 1,218 complaints and enquiries about scams.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohammad Faiz also reminded the public to be cautious of scams that claim to be shariah<span style='font-family:\"Cambria Math\",serif'>‑</span>compliant, using religious sentiment to gain trust.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bersama InvestSmart @ Pahang 2025 is a three<span style='font-family:\"Cambria Math\",serif'>‑</span>day programme starting Friday, bringing together government officials, capital market industry players, and regulators under one roof as part of the SC’s investor outreach initiative.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>More than 40 exhibitors are participating in the event, themed <i>Bijak Labur, Hidup Makmur</i>.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759840",
            "pub_date": "2025-06-20 20:01:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}