{
    "data": [
        {
            "title": "FBM KLCI up 0.09% to 1,502.74 on June 20, 2025",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Below is a summary of how key Bursa Malaysia indices and the ringgit performed on Friday:</p></div>\n<div class=\"pb-5 imgw-800 mx-auto d-block\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/full-market-closing-web-june20-2025-1_20250620175458.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/full-market-closing-web-june20-2025-1_20250620175458.jpg\"/></a></div>\n<div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div></div></div>",
            "link": "https://theedgemalaysia.com/node/759821",
            "pub_date": "2025-06-20 18:31:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla, Shanghai sign US$557m energy storage station deal — report",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BEIJING (June 20): Tesla's first China grid-scale battery storage station using its megapack batteries will be located in Shanghai, local media <em>Yicai </em>reported on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The deal involving an investment of four billion yuan (US$556.8 million or RM2.3 billion) was signed between the US automaker, China Kangfu International Leasing Co and the Shanghai local government on Friday, according to the report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla's battery megafactory in Shanghai for making its megapack batteries began production in February.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Siow Chen Ming</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p> </p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759825",
            "pub_date": "2025-06-20 18:21:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Penang has enough industrial land for next 10 to 15 years, says CM",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>GEORGE TOWN (June 20): Penang still has 809.4 hectares of industrial land available to support the state’s economic development for the next 10 to 15 years, said Chief Minister Chow Kon Yeow.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said in addition to new sites, the available land includes areas undergoing reclamation, sites in the request-for-proposal process, and others at various stages of readiness for long-term use.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Although there is a perception that industrial land is running out, the reality is that Penang still has a sizeable land bank that can be developed. Land is not an issue. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"For example, the Batu Kawan Industrial Park, which spans over 404.7 hectares, has taken more than 15 years to develop since 2008,\" he told reporters after launching the Penang Industrial Master Plan 2030 on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He clarified that the current demand is relatively moderate, averaging around 40.4 hectares annually, and not all new investments require new land, as many investors utilise remaining space within their existing factory sites for expansion.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>When asked about the state’s revenue from industrial land sales, Chow said the returns were minimal and not the main priority.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“What matters more is the investment value generated. For instance, in the first quarter of this year, we recorded RM13 billion in total investments in various forms, including new land acquisitions, existing factories, digital investments and more,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Chow said the state government plans to establish centralised labour quarters (CLQs) within industrial areas to accommodate demand for foreign labour, as part of the newly launched Penang Industrial Master Plan 2030.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We are taking a holistic approach because industrial development goes beyond just land. It requires supporting infrastructure such as utilities, talent, ports, airports and also well-planned CLQs or worker dormitories within industrial zones,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Chow described the master plan as a timely move to drive the transformation of Penang’s industrial sector and strengthen the state’s position as a preferred investment destination in the region.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said the plan also takes into account key infrastructure projects such as the expansion of the Penang International Airport and the development of green and smart technology hubs to support the electrical and electronics sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Penang Industrial Master Plan 2030 outlines three core pillars, supported by nine high-impact projects, as well as short-term initiatives that include seven quick wins and 28 supporting projects.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759822",
            "pub_date": "2025-06-20 18:01:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Defence opportunity could finally make flying taxis a reality",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PARIS (June 20): Opportunities in defence, emergency healthcare and cargo could help make flying taxis a reality in the next few years after the sector recently received backing from the Trump administration, executives in the industry said at the Paris Airshow.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>President Donald Trump this month told regulators to speed up certification to accelerate the development of electric vertical take-off and landing aircraft (eVTOLs), aiming to secure a U.S. lead over Asia in the technology.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The executive order gave fresh impetus to an industry that has struggled to win over critics and regulators.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We take a lot of spears, people are like 'batteries are too heavy',\" said Kyle Clark, founder and chief executive of Beta Technologies, at the show. \"But the reality is, if you put the airplanes in the right places, the benefits are real.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Flying taxis <span jsslot=\"\"><span>—</span></span> seen in predictions of the future for decades <span jsslot=\"\"><span>—</span></span> need to shake off the idea that they are just for the rich to become viable at scale.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Their manufacturers say emergency medical services, cargo and defence could help, where they offer a cheaper and quieter alternative to helicopters in areas from passenger and goods transport to rescue missions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Beta, Joby Aviation and Archer Aviation are in the US Air Force Agility Prime Programme, which aims to develop technologies for autonomous cargo and hybrid-electric aircraft.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Joby and Archer have previously signed military contracts worth US$131 million (RM557.8 million) and up to US$142 million, respectively.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We have two aircraft at Edwards Air Force Base, and we are really grateful for all the support and all the learning we've gotten out of that,\" Joby Aviation's founder and chief executive JoeBen Bevirt said. \"We think there's incredible opportunities on the defence side.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Beta's Clark, who flew its conventional takeoff and landing aircraft in Paris, said the company had a clear position in defence: reliable aircraft that showed up to every mission.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We've gone to somewhere near 10 bases,\" he said. \"We've done 1,000s of takeoffs and landings with the military, we've had an exceptional dispatch rate.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We didn't just dabble in there. We've got contracts. I think that, like, we've got hundreds of millions of dollars of actual, tangible dollars flowing into us with defence.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The three companies, along with Wisk Aero, said Trump's order was a big deal in boosting the sector's prospects.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US Transportation Secretary Sean P. Duffy and acting FAA administrator Chris Rocheleau announced a US-led alliance with Britain, Canada, Australia and New Zealand to streamline the certification of eVTOLs globally at the Paris show on Tuesday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wisk Aero, owned by Boeing, differs from its rivals in that it is focused on launching fully automated services.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We have the political support, we have the industry support and then we have the money to make it happen,\" CEO Sebastien Vigneron said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Public concern over automated driving systems in cars suggests fully automated flying could have some convincing to do to gain wider acceptance.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Beta's Clark said once the aircraft were in the hands of customers, the business case would be clear.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said he had flown passengers from the Hamptons to JFK airport in New York using only US$7 of electricity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"You basically flip opex and capex on its head for recurring costs, and it just tells you what type of customers and applications you want for these airplanes,\" he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It's not a once-a-week flyer, it's a three, four, 10 times-a-day flyer where you exploit the benefits of electric propulsion.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Siow Chen Ming</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759819",
            "pub_date": "2025-06-20 17:51:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global trading giants step up India presence, fuelling talent rush, exchange upgrades",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MUMBAI (June 20): Half a dozen global trading giants, from Citadel Securities and IMC Trading to Millennium and Optiver, are ratcheting up their presence in India's booming derivatives markets, fuelling a hiring spree and pushing exchanges to improve technology.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The firms' hiring plans, being reported for the first time, come amid expectations that large domestic consumer and investor bases will help shield India from global turmoil sparked by the trade policies of US President Donald Trump.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The South Asian nation made up nearly 60% of global equity derivative trading volumes of 7.3 billion in April, the Futures Industry Association says, while its regulators say notional turnover of the contracts has grown 48 times since March 2018.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For Western firms, the gold rush is too big to ignore, particularly after US trading firm Jane Street earned US$2.34 billion from its India trading strategy last year, some of the firms' executives said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We have seen competition increasing both on the trading front, where you see more players going for the same opportunities, and on the job market as well,\" said Jocelyn Dentand of global high-speed trader IMC Trading.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The firm plans to grow its team by more than 50% by the end of 2026 to stand at more than 150, added Dentand, the managing director of its India unit.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Foreign investors turned buyers of Indian stocks in April and May, purchasing a net US$2.8 billion, as they abandoned their previous selling stance from October 2024 to March 2025, prompted by high valuations and slower growth in earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Citadel Securities, a market-making firm founded by well-known investor Kenneth Griffin, runs a leaner team of around 10, including a recently hired chief operating officer for India as well as a country head of trading, said a source familiar with the firm's plans, adding that it continued to seek talent.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Citadel Securities declined to comment for the report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hedge fund Millennium is expanding its India desk via Dubai and Singapore, said a source with direct knowledge of the matter, who also sought anonymity on the same grounds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Millennium declined to comment for the story.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Netherlands-based Optiver, which launched India operations in 2024, plans to grow its team to 100 by the end of 2025, a spokesperson said, up from 70 now.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Optiver is investing ambitiously in India, with a view to expanding to 100 FTEs by year-end and scaling further in the years ahead,\" the spokesperson added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Amsterdam-based trading firm Da Vinci and London-based Qube Research and Technologies are also recruiting for quantitative trading roles in India, public postings for jobs show.</p></div>\n<h3>Rush for tech, talent</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Global trading firms are also looking to expand in India by recruiting aggressively from top domestic universities and poaching from home-grown competitors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>They have hired about 300 people in India in the last two years across the trading, technology, compliance, risk and legal functions, Hong Kong-based recruiter Aquis Search estimates.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We foresee a good run for the next few years,\" said Annpurna Bist, its head of quant and tech.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Intensifying competition has driven up salaries, with even junior traders paid more than double the figure of three years ago, said Bhautik Ambani, head of AlphaGrep Investment Management, one of India's leading quant trading firms.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>India's top engineering schools have become the favoured hunting grounds for talent.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We almost solely hire our traders and software engineers from Indian Institutes of Technology (IITs),\" said IMC's Dentand, referring to the country's chain of prestigious engineering schools.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But hiring efforts are now being widened to the universities beyond the IITs, Dentand said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The influx of global trading firms has opened up opportunities for India's two main exchanges, which are both upgrading their tech infrastructure.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The National Stock Exchange of India (NSE) plans to add 2,000 co-location racks over the next two years while older stalwart the Bombay Stock Exchange (BSE) aims to scale up to 500 by the end of fiscal 2026, from none in March 2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Such racks are servers at exchanges that cut trade execution times to microseconds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We are a late entrant and need to provide additional value for the unfulfilled demand from high-frequency trading firms and quant firms, amongst others, for co-location racks,\" said BSE Chief Executive Sundararaman Ramamurthy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The exchange has spent between 4.5 billion rupees and 5 billion rupees (US$52 million to US$58 million) on technology in the last two years, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The NSE and regulator the Securities and Exchange Board of India (SEBI) did not respond to queries for the report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759817",
            "pub_date": "2025-06-20 17:41:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea says SK and Amazon to invest US$5b in country's biggest data centre",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SEOUL (June 20): South Korea's SK Group will invest around seven trillion won (US$5.11 billion or RM21.74 billion) including US$4 billion from Amazon Web Services (AWS), Amazon's cloud services provider, to build a data centre in the southern city of Ulsan, the Science Ministry said on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The artificial intelligence (AI) data centre, which will be the country's largest, will break ground in September and be fully operational with a capacity of 100 megawatts by 2029, the ministry said in a statement.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SK Group chairman Chey Tae-won said he plans to expand the data centre's capacity to one gigawatt in the future and make it a global hub that handles domestic AI demand during a meeting attended by president Lee Jae Myung and tech CEOs.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>AI is crucial for South Korea's growth, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It may set a good example that South Korea's high-tech industry is possible not only in the metropolitan area but also in the provinces,\" Lee said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>South Korea's AI-related stocks on Friday extended a rally on policy optimism, with SK Hynix rising more than 3%, Kakao surging 11%, and LG CNS gaining 9%, leading the benchmark Kospi above a key milestone of 3,000 points for the first time in three and a half years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The official announcement follows media reports earlier this month that SK Group and AWS are building a data centre in South Korea.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759818",
            "pub_date": "2025-06-20 17:41:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top India realtor DLF to roll out Mumbai comeback project in July",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): DLF Ltd plans to start bookings in a premium residential project in Mumbai next month, marking the return of India’s top developer to the financial capital after thirteen years as it seeks newer growth markets. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We’ll be launching the Mumbai project in July,” Aakash Ohri, joint managing director at DLF said in an interview, adding that the market held “immense potential”. The developer plans to build eight towers in two phases, with apartments priced upwards of 50 million rupees (RM2.45 million), according to its website.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DLF’s Mumbai push closely follows a record sale of luxury residences worth about US$1.3 billion (RM5.53 billion) near capital New Delhi this week. It also comes amid signs that the galloping home sales in key Indian markets over the last two to three years is slowing because of high base and elevated home prices. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DLF’s upcoming West Park project spans over 5.6 acres with three- to four-bedroom flats, duplex and penthouses. The first phase of four towers includes 416 apartments with a carpet area of 1150-1,550 sqe ft. The project is slated to be completed by mid 2032, according to the state level real estate regulator.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The real estate developer, whose shares are up 3% this year compared to a drop in a Nifty gauge of local property developers, will have its task cut out as it looks to enter an oversupplied market.</p></div>\n<h3>Replicating success</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Unsold luxury housing stock in Mumbai rose 36% on year in the March quarter, according to property consultant ANAROCK. Brokerage JM Financial said in a report last week that while the sector’s growth in larger Indian cities would moderate, the demand-supply scenario was comfortable.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DLF, which is a market leader in Delhi and adjoining regions, is keen to replicate the success in Mumbai, undeterred by how a foray in the past had not worked out.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DLF had acquired around 17 acres of Mumbai mill land in 2005 for around seven billion rupees. But the global financial crisis and its own mounting debt forced the developer to sell the plot in 2012 for 27 billion rupees.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“At that time, attention was to consolidate back home. Commitments here needed more attention,” Ohri said, referring to why DLF had to pull back from Mumbai in 2012.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>None of that is holding the developer back as it looks to make a comeback.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We have consistently received interest and inquiries about DLF’s entry into the city,” Ohri said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759808",
            "pub_date": "2025-06-20 17:31:36",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Currency traders are ditching dollar for euro on options bets",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The euro is taking on a bigger role in the global currency options market as traders skirt around the dollar given the risks from unpredictable US policy and a global trade war.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>There’s been a shift in trading volumes. Around 15% to 30% of contracts tied to the dollar versus major currencies were switched to the euro, looking at data from the Depository Trust &amp; Clearing Corporation for the first five months of this year versus the final five months of 2024. There are also signs the euro is being used as a haven — traditionally the dollar’s role — and for bets on big moves.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While deals involving the dollar still dominate in the US$7.5 trillion (RM31.9 trillion)-a-day currency market, this could be early evidence that the greenback is facing greater competition as the world’s reserve currency. Traders are sidestepping the dollar after its biggest slump in years, with Europe’s common currency looking like a key beneficiary as the region’s markets benefit from billions in government stimulus spending.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“If we’re moving to an environment in which the European flow story is more important, then we could be moving to an environment in which it’s euro pairs which are driving everything,” said Oliver Brennan, options strategist at BNP Paribas SA.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>So far this year, Europe’s common currency has rallied 11% against the dollar, hitting its highest since 2021 at above US$1.16. Meanwhile the dollar has slid against every major currency, with a gauge down over 7% to its lowest since 2022. That’s undermining trust in US assets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>And the slump may not be over yet. Hedge fund heavyweight Paul Tudor Jones just predicted another 10% drop for the dollar over the next year. Risk reversals, a gauge of options sentiment, are becoming increasingly negative on the dollar against the yen, whereas they are turning less bearish on euro-yen — a “really important signal” on the euro for Brennan.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As markets question the dollar’s stability, implied volatility in the euro against the yen is looking the calmest in nearly four years relative to swings between the greenback and Japanese currency.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The market is thinking that dollar-yen will be more volatile than euro-yen in a negative market shock, which is the opposite to how the market has traded these events in the past,” said Brennan. “If that’s the thinking, then it means the market sees the euro as more of a safe haven than the dollar.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The cost of options is also a driver, said Ben Ford, currency strategist at Macro Hive. While implied volatility generally has eased after spiking in April’s market chaos, it stands at nearly 11% over three months for dollar-yen, compared with under 9% for euro-yen.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The market is finding cheaper ways to express its view, especially given the view is probably for euro outperformance,” Ford said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Traders also seem to be favoring the euro over the dollar when it comes to hedging or betting on big directional moves on the yen. That’s evident in so-called 10-delta fly spreads, a gauge of demand for outsized swings, where the gap between euro-yen and dollar-yen has been steadily widening since April.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Of course, the dollar has been written off many times before. Just at the start of this year, the euro was languishing near parity with the greenback, with many investors certain the common currency’s value would fall below its US peer.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Instead Trump’s April’s tariff announcements saw investors dump dollar assets. While US stocks have recovered since then, the dollar risk premium remains elevated, and it may require a return to US exceptionalism to reverse the trend, according to Tanvir Sandhu, chief global derivatives strategist at Bloomberg Intelligence.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile the European Central Bank’s president Christine Lagarde has called on policymakers to seize the moment and increase the euro’s global profile.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There’s a push and a pull — the pull has been that there’s potentially more safe assets to buy in Europe and more growth expectations in Europe,” said BNP’s Brennan. “And the push has been tariff uncertainty, risks to US exceptionalism, and the macro story.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759809",
            "pub_date": "2025-06-20 17:31:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Goldman, Citi see Europe’s economic edge extending stock rally",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The perils of trade and geopolitics will only slow the rally in European stocks rather than derail it, according to Wall Street strategists.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Stoxx Europe 600 Index is expected to end the year around 557 points, according to the average of 19 strategists polled by <i>Bloomberg</i>. That implies a further 3% advance from Wednesday’s close, handing investors annual returns of about 10%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Europe’s loosening monetary policy and increased government spending are forecast to give the region’s stocks the impetus they need to overcome risks from tariffs and rising international tensions. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Equity markets have been remarkably resilient, despite many risks,” said Citigroup Inc strategist Beata Manthey. She noted that global equity market valuations reflected relatively average levels of geo-economic risk in the lead up to the Israel-Iran conflict. “This could be worrisome from a short-term perspective, but over the longer term we see many structural tailwinds to support European equities.”</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/434852310_20250620164850.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/434852310_20250620164850.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European stocks have posted moderate moves since mid-May, following a V-shaped recovery that erased all the losses triggered by the US tariff announcements of early April. Recent weeks have proved more volatile, as Middle East tensions intensified and pushed oil prices higher. The Stoxx Europe 600 is down 1.5% this month, with energy shares and utilities the only sectors in the green.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Many investors we are speaking with are awaiting the end of the truce on US tariffs on July 9 to gain better visibility,” said Societe Generale SA strategist Roland Kaloyan. “Looking ahead, we anticipate that the European equity market will remain within a trading range.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Most strategists have had to chase the rally in Europe as the outlook brightened, updating the cautious price targets they drew up in January. Challenges to so-called US exceptionalism in stocks, Europe’s improving economic prospects, as well as a wide interest-rate differential have fuelled bets on the region.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The positive sentiment is also evident among investors. The Bank of America Corp fund manager survey conducted this month before Middle East tensions escalated showed that a net 34% of European investors expect stocks in the region to rise in the coming months. While that’s broadly unchanged from May, the net proportion expecting gains in the coming 12 months has rebounded to the February high of 75%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On a relative basis, asset allocators are increasingly bullish on Europe. A net 34% of portfolio managers in the BofA survey said they are overweight European equities against their funds’ benchmark levels — close to a four-year high. A net 36% said they are underweight US equities, nearly the most in two years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While investors haven’t lost sight of the risks posed by trade tariffs, they are growing more optimistic about the economy, which will feed into corporate profits, the survey showed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Our view is that the diversification theme has further to go,” said Goldman Sachs Group Inc partner and chief global equity strategist Peter Oppenheimer, adding the weakening dollar favors European assets. “In total returns, European stocks offer quite a compelling story for investors, especially given their starting point of having very concentrated portfolios, particularly in US equities.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European stocks have outperformed US peers this year, but the gap is narrowing. Renewed appetite for American tech megacaps, potential tax cuts and optimism about trade negotiations helped the S&amp;P 500 erase its losses for 2025 last month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, for Deutsche Bank AG strategists led by Maximilian Uleer, who’ve been consistently bullish on the outlook for the Stoxx 600, tariffs will be a bigger burden for US companies than their European peers. Earnings momentum and valuations are more favorable in Europe, while political uncertainty remains more of a problem, they said. The outlook for fiscal policy and interest rates also favours Europe, while a potential ceasefire between Ukraine and Russia would be an additional boost.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Once we have more clarity on US tariffs, the One Big Beautiful Bill, the German budget and fiscal package, as well as Nato spending, markets could start moving higher again in late summer,” the Deutsche Bank team said. “In the medium-term, European equities could start outperforming US equities again.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759805",
            "pub_date": "2025-06-20 17:11:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thai baht hit by political turmoil; Asian currencies set for weekly losses",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The Thai baht weakened on Friday and was set for its biggest weekly drop in four months as political uncertainty weighed on already fragile sentiment, while other regional currencies were also headed for weekly losses on Middle East tensions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The baht fell 0.4% in its fifth session of losses and was on course to log its worst week since late February.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Prime Minister Paetongtarn Shinawatra was facing the prospect of losing her government's majority as the United Thai Nation party, a vital coalition partner, looked set to demand her resignation after just 10 months in power.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This follows the Bhumjaithai Party's withdrawal from the alliance after a leaked phone call with Cambodia's former leader.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The political instability comes against the backdrop of persistent bond outflows driven by low returns and vulnerability to US trade tariffs and the government's call for a weaker baht to support exports and tourism.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"At a time when unprecedented geoeconomic challenges are confronting Thailand, the lack of political leadership/certainty is an unwelcome handicap for trade/diplomacy and wider geopolitical leverage,\" said Vishnu Varathan, head of macro research for Asia excluding Japan at Mizuho Bank, in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The BOT (Bank of Thailand) arguably needs to compensate, hastening another 50-75bp of rate cuts,\" he said, adding that the optimal policy mix for the central bank would be to cut rates while stabilising the baht.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Thai stocks rose 0.3%. Poon Panichpibool, markets strategist at Krung Thai Bank, attributed the rise to a combination of technical rebound and some investors buying stocks on a dip after Thursday's 2.4% fall.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Other regional currencies inched up on the day but were set for weekly losses as investors weighed the possibility of US involvement in the Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Indonesian rupiah was on course for its worst weekly performance since early April, and the Philippine peso was poised for its biggest weekly drop since October.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The South Korean won rose 0.8% on Friday but was set for its second consecutive weekly fall.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, UBS analysts expect continued dollar selling on the back of forex hedging, front-loading of Asian exports before the tariff deadline, and Asia diversification, as evidenced by the won's gains since Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Taiwan's dollar added 0.4%, a day after the country's central bank kept its policy rate unchanged and signalled there was no need for a rate cut this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, the Hong Kong dollar hit the weak end of its trading band for the first time in two years.   </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Regional equities rose on the day, with Seoul shares rising 1.5% to cross the 3,000 mark for the first time since January 2022. Indian equities added 0.9%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759803",
            "pub_date": "2025-06-20 17:01:59",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HK stocks log worst week since April as absence of fresh stimulus weighs",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SHANGHAI (June 20): Hong Kong stocks rebounded on Friday but still logged their steepest weekly decline since April, as the lack of new stimulus measures this week weighed on investor sentiment amid broader global tensions surrounding the Iran-Israel conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Hong Kong stock market had witnessed a steady recovery over recent weeks, rebounding from losses triggered by reciprocal tariffs imposed by US President Donald Trump. The benchmark Hang Seng Index has advanced 17% year-to-date.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The Lujiazui forum this week offered no new measures to boost the capital market, which was a potential letdown for some investors,\" said Jason Chan, senior investment strategist at Bank of East Asia.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The two-day gathering of top financial regulators and market participants at the annual Lujiazui Forum wrapped up on Thursday, delivering few surprises for market participants.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Sentiment is expected to remain weak, with the persistent risk of an escalation in Middle East tensions continuing to cast a shadow over markets, Chan said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The market could stay range-bound in the short term.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China kept its benchmark lending rates unchanged on Friday, as expected, after rolling out sweeping monetary easing measures last month to support the economy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China's blue-chip CSI300 Index closed 0.1% higher, while the Shanghai Composite Index lost 0.1%. Hong Kong benchmark Hang Seng was up 1.3%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the week, the Hang Seng Index was down 1.5%, the biggest drop since the week of April 7, while the CSI300 Index was down 0.5%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hong Kong's pullback was also exacerbated by fading interest from mainland investors. Their purchases via the Stock Connect scheme have slowed sharply in recent weeks, with net buying this week amounting to just 16 billion yuan (US$2.23 billion) — only 20% of the peak recorded in April.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The CSI Liquor Index rose 2.2%, leading gains onshore, after the index lost 12% this year on weak consumer demand and a government ban on civil servants dining out.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Amid uncertainties related to China-US trade friction, onshore share valuations may be range-bound at low levels near term, UBS strategist Lei Meng said in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We expect limited downside, and potential upside catalysts mainly from stronger policy easing, the continual entry of medium or long-term funds and structural reforms,\" Meng said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of \"Blind Box\" toymaker Pop Mart dropped nearly 4% after state media outlet <em>People's Daily</em> called for stricter regulation of the blind box industry, citing expert views. The stock has fallen 13% this week, but soared 165% this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759804",
            "pub_date": "2025-06-20 17:01:52",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US tariff spike hits China’s small parcels, squeezing exporters",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): US tariff hikes on small packages from China triggered a slump in shipments last month, contributing to a huge drop in bilateral trade and roiling exporters like Shein Group Ltd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The value of small parcels sent from China to the US fell to just over US$1 billion (RM4.26 billion) in May, the least since early 2023, according to customs data released Friday. The 40% plunge from the same month last year marks a sharp reversal for a booming trade route, coming just as the US government eliminated a long-standing tariff loophole.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The policy shift is upending the business models of fast-fashion titan Shein and its rival Temu, which relied on the exemption to send goods directly to US customers free of tariffs. It’s also squeezing thousands of small merchants who relied on the model as a low-cost entry into the world’s largest consumer market.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Without the exemption, it would mean tougher business to us, and much fewer options for consumers, and potentially higher prices,” said Wang Yuhao, whose Kunming-based incense company, Shantivale, recently began selling to the US. “This is a lose-lose situation.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the entrepreneur, the new tariffs and logistical fees of direct shipping now would mean losing US$2 on every parcel. To avoid the additional cost, Wang said he has pivoted to bulk shipments to US warehouses, a move that demanded an upfront investment of more than 100,000 yuan (US$13,800 or RM59,197) for inventory and storage.</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/chinese-package-20062025-bloomberg_20250620145915.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/chinese-package-20062025-bloomberg_20250620145915.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The source of the disruption is the end of the “de minimis” rule exemption for Chinese and Hong Kong shipments. Previously, packages valued under US$800 could enter the US duty-free. Since May 2, those parcels face tariffs as high as 54% after the Trump administration moved to close what it deemed an unfair trade loophole.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The impact on the largest players was swift. Shein raised US prices on items from dresses to kitchenware ahead of the hike to cover the costs of the higher tariffs, according to data compiled by <em>Bloomberg News</em>. In the week after the tariffs took effect, both Shein and Temu saw double-digit sales declines, an early sign the punitive measures are eroding their popularity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Even with the drop, the US remained the largest single destination for China’s small parcels, the data showed. Malaysia followed by taking more than US$700 million worth of such shipments last month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Globally, small parcel shipments rose 40% in May compared to a year ago, with Belgium, South Korea, Hong Kong and Hungary among other large destinations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759784",
            "pub_date": "2025-06-20 16:41:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s rare earth magnet exports slump in May, especially to US",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Chinese exports of rare earth magnets slumped further in May, with shipments to the US showing an especially steep drop due to the trade war with Washington.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Rare earth minerals, and the products that use the elements, have been at the centre of the dispute since early April, when China imposed export controls in retaliation for punitive tariffs levied on Chinese goods. The two countries have since sought to reset relations, culminating in a meeting in London in early June, which prompted US President Donald Trump to declare that issues around rare earths had been resolved. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China accounts for about 90% of the world’s rare earth products, most of which are magnets, and whether it allows supplies to flow more freely after the agreement reached in London will be a key focus for governments and markets in the weeks and months to come. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"mt-3 imgw-300 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/Chinese-magnet-exports_20250620145615.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/Chinese-magnet-exports_20250620145615.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Chinese customs data on Friday showed the extent of the impact on supplies of rare earth magnets in particular, an item vital for high-tech industries from carmakers to defence contractors. The controls have affected sales to all countries, with China’s total exports roughly halving in April, and then halving again in May, to 1,238 tonnes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That comes to about US$60 million (RM255.41 million), the lowest-value month in data going back to 2015, barring February 2020 and the onset of the pandemic.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US portion by volume in May was just 46 tonnes, less than one-tenth of the magnets it imported in March. Other countries including Vietnam, host to a number of Chinese companies, and Germany saw their supplies hold up much better. Those two countries were the top destinations last month, accounting for 19% and 17% of sales, respectively.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759783",
            "pub_date": "2025-06-20 16:11:55",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stocks with momentum on June 20, 2025: Auro Holdings, TMK Chemical",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): theedgemalaysia.com highlighted two stocks with momentum at Bursa Malaysia’s afternoon close on Friday, one showing positive and the other negative momentum.</p></div>\n<h3>The stock with positive momentum was:</h3>\n<ul>\n<li>Auro Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5025\" target=\"_blank\">AURO</a>) — unchanged at 16.5 sen</li>\n</ul>\n<h3>The stock with negative momentum was:</h3>\n<ul>\n<li>TMK Chemical Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5330\" target=\"_blank\">TMK</a>) — up four sen or 3.3% at RM1.24</li>\n</ul>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The list of stocks with momentum is generated using a proprietary mathematical algorithm highlighting stocks with a build-up in trading volume and price. The algorithm differentiates between stocks that exhibit positive (+ve) momentum and negative (-ve) momentum.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This list is not a buy or sell recommendation. It merely tells you which stocks are seeing higher-than-normal volume and price movements.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The share price may move up or down from this point. But the “+ve” (suggesting a rising price trend on volume) and “-ve” (suggesting a falling price trend on volume) indicators should give readers a better idea of what the market is buying and when to sell. Note also that momentum generally only persists for a short period of time.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, each stock has an accompanying fundamental score and valuation score to help readers evaluate the attractiveness of the stocks if they want to ride the momentum.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For more detailed financial information and reports on the above-mentioned stocks, please subscribe to AbsolutelyStocks at <a href=\"http://bit.ly/AbsolutelyStocks\" target=\"_blank\">www.absolutelystocks.com</a></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759780",
            "pub_date": "2025-06-20 15:11:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SoftBank pitches US$1 tril US AI hub to TSMC, Trump team, Bloomberg reports",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): SoftBank Group Corp founder Masayoshi Son is seeking to team up with Taiwan Semiconductor Manufacturing Co (TSMC) to realise what could be his biggest bet yet — a trillion-dollar industrial complex in Arizona to build robots and artificial intelligence (AI).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son envisions a version of the vast manufacturing hub of China’s Shenzhen that would bring back high-tech manufacturing to the US, according to people familiar with the billionaire’s thinking. The park may comprise production lines for AI-powered industrial robots, they said, asking not to be named as the plan remains private.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank officials are keen to have the Taiwanese maker of Nvidia Corp’s advanced AI chips play a prominent role in the project, although it’s not clear what part Son sees for TSMC, which already plans to invest US$165 billion (RM702.16 billion) in the US and has started mass production at its first Arizona factory. Nor is it clear that TSMC would be interested. A person familiar with the chipmaker’s thinking said that SoftBank’s project has no bearing on TSMC’s plans in Phoenix.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of SoftBank jumped as much as 2.3% in Tokyo Friday. TSMC’s stock price rose 1.9% in Taipei.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Codenamed “Project Crystal Land”, the Arizona complex represents the 67-year-old SoftBank chief’s most ambitious attempt in a career that’s spanned numerous bet-the-house bids, thousands-fold returns and billions of dollars in losses. Son, who’s often expressed disappointment in his own legacy, has repeatedly said he means to do everything he can to hurry AI development. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank officials have spoken with federal and state government officials to discuss possible tax breaks for companies building factories or otherwise investing in the industrial park, including talks with US Secretary of Commerce Howard Lutnick, the people said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Japanese billionaire is also personally sounding out interest among an array of tech companies, they said. The project has been floated to executives at South Korea’s Samsung Electronics Co, they said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Representatives of SoftBank, TSMC and Samsung declined to comment. A Commerce Department spokesperson did not immediately respond to a request for comment. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son has pulled together a list of SoftBank Vision Fund portfolio companies that might take part in the Arizona manufacturing hub, the people said. SoftBank-backed startups working on robotics and automation technologies — such as Agile Robots SE — may set up production facilities at the industrial complex, they said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The plans are preliminary and feasibility hinges on support from the Trump administration and state officials. While the cost of the project as envisioned by Son may require as much as US$1 trillion to execute — a sum previously reported by the Nikkei — the actual scale depends on interest from big technology companies. If successful, Son has floated building multiple cutting-edge industrial parks across the US.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank is exploring the Arizona project as it also moves forward on plans to invest as much as US$30 billion into OpenAI and plans a US$6.5 billion acquisition of Ampere Computing LLC. It’s also seeding money into the Stargate venture with OpenAI, Oracle Corp and Abu Dhabi’s MGX, seeking to ferry hundreds of billions of dollars into data centres and related infrastructure around the world.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Those outlays come as SoftBank’s cash stood at ¥3.4 trillion (US$23 billion or RM100 billion) at the end of March. The Tokyo-based company has since tapped its T-Mobile US Inc stake, selling roughly a quarter of what it held in March to raise US$4.8 billion this month. SoftBank also has net assets valued at ¥25.7 trillion, of which chip designer Arm Holdings plc makes the single largest portion, allowing it to borrow billions more as needed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank’s exploring project financing for Stargate data centres, a model that could be adapted to a big endeavour like Crystal Land. Common for large-scale infrastructure like oil or gas pipelines, the project finance template would allow the tech investor to raise funding on a project-by-project basis and require less money upfront.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son’s restless search for growth has resulted in projects that proceed in fits and starts, making it difficult to gauge how committed he is to any one venture. The billionaire is often goaded by the desire to boost SoftBank’s stock price and repay retail investors who’ve held onto the company’s shares from before the dot-com boom and bust, people close to the SoftBank chief have said. Many investors have waited for decades for the stock to regain dot-com bubble levels — something it’s flirted with only a few times since 2020. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>If Son’s primary motivation is to clear the way for AI, it may be more cost-efficient to encourage partnerships that link manufacturing expertise with that of AI engineers and specialists in fields from medicine to robotics, and incubating smaller companies, according to Melissa Otto, head of research at Visible Alpha. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But pouring cash into data centres may help lower the cost of developing AI applications and spur broader adoption, she said. “He’s a long-term thinker, and he takes risks,” Otto said. “It’s just too early to tell.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759781",
            "pub_date": "2025-06-20 15:11:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rakuten Trade lowers FBM KLCI target to 1,630 on absence of strong catalysts",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Rakuten Trade Sdn Bhd has cut its year-end projection for the benchmark FBM KLCI target to 1,630 from 1,730 previously, citing earnings downgrades across key sectors and a lack of strong domestic catalysts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Its head of research Kenny Yee Shen Pin said that Malaysian equities remain fundamentally sound but have suffered from diminishing investor interest, both foreign and retail, due to the uninspiring outlook.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“In terms of fundamentals, there were notable earnings downgrades following the recent results season, most prominently in the banking sector, where projected earnings growth was slashed from 6.6% to 3.3%. Telcos were also hit, particularly Axiata [Axiata Group Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/6888\" target=\"_blank\">AXIATA</a>)], which saw negative earnings growth,” he said during the Rakuten Trade 3Q2025 virtual market outlook media briefing.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Overall, the fund manager has cut its earnings growth forecast across all industries for 2025 to 5.0% from 9.2% previously.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Yee noted that the local bourse is currently trading at 12 to 13 times forward earnings, below the historical average of 16 times. “This suggests Malaysian equities are relatively undervalued. However, in the absence of fresh catalysts, sentiment remains tepid,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The bearish sentiment comes at a time when the market is bracing for a volatile mix of external and domestic headwinds, including the potential direct US involvement in the Israel–Iran conflict. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The heightened geopolitical risks in the Middle East have raised worries of US stagflation risks to the impending rollout of Trump’s reciprocal tariffs, alongside the looming maturity of over US$1 trillion in US Treasury bills by month-end. Domestically, sentiment is expected to remain cautious, weighed down by uncertainty over a pending US–Malaysia tariff agreement. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Yee also expressed concern over sustained net foreign outflows from Malaysian equities, amounting to RM11.2 billion so far this year, on top of the RM4 billion in 2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, he highlighted that foreign shareholding has held steady at around 19%, indicating that “longer-term investors are still in the market while short-term funds continue to exit”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Retail participation has also dwindled, with average trading volumes remaining low and initial public offering interest waning. Yee said the daily trading volume on Bursa Malaysia is struggling to exceed six billion shares, adding that retail investors appear to be waiting for a clear market catalyst before re-entering.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Despite Malaysia being relatively stable both economically and politically, the lack of excitement in the market is evident. Investors are staying on the sidelines,” he added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On strategy, the fund manager maintains an \"overweight\" call on sectors such as construction, banking, oil and gas, and healthcare — supported by robust infrastructure spending, resilient earnings, and strong demand drivers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the other hand, it remains neutral on the consumer, property, and plantation sectors due to headwinds such as sales and service tax expansion, crude palm oil (CPO) price volatility, and subsidy rationalisation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“If tensions in the region were to escalate further, we may see commodity prices, including CPO, spike as part of a broader flight to food and resource security,” Rakuten Trade vice president of research Thong Pak Leng added. “If CPO prices breach the RM4,500 threshold sustainably, we may revisit our sector call and upgrade to overweight.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Its top choices include RHB Bank Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/1066\" target=\"_blank\">RHBBANK</a>) because, despite a shortfall in net interest margin, it believes it could improve towards its target of 1.86% for the year; CelcomDigi Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/6947\" target=\"_blank\">CDB</a>) due to upcoming annual cost savings and ongoing integration efforts; and Gamuda Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5398\" target=\"_blank\">GAMUDA</a>) because of a strong order book that provides long-term earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759773\" target=\"_blank\">Ringgit seen strengthening amid global de-dollarisation, US policy headwinds, says Rakuten Trade</a></em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Isabelle Francis</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759775",
            "pub_date": "2025-06-20 15:01:41",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NTT secures backing for US$16.3b deal to take over AI arm",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Nippon Telegraph and Telephone Corp said it has secured enough bids to buy NTT Data Group Corp, with the deal worth ¥2.37 trillion (US$16.3 billion or RM69 billion) expected to boost its AI ambitions and simplify the corporate structure.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Japanese company will start the settlement on June 26, it said in a statement Friday. NTT, which owns about 58% of NTT Data, had last month offered ¥4,000 for every share it doesn’t already own in the company with plans to take it private.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The takeover of NTT Data, one of the world’s largest data centre operators, would put artificial intelligence at the heart of NTT group, expanding the global reach of its various units.  About one-third owned by the government, NTT competes with KDDI Corp and SoftBank Corp in the growing AI race, at a time Tokyo is pushing companies to develop a homegrown AI platform to vie with the likes of OpenAI and China’s DeepSeek.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move also comes as Japanese conglomerates are under pressure from regulators to streamline their corporate structures. In February, the Tokyo Stock Exchange cautioned companies with parent-affiliate listings to better protect minority shareholders’ interests, stepping up its long-burning campaign to reduce such arrangements. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Since then, NEC Corp has acquired unit NEC Networks &amp; System Integration Corp, while <em>Bloomberg News</em> reported Toyota Motor Corp chairman Akio Toyoda’s plan to buy Toyota Industries Corp. The moves have fuelled speculation that more firms may follow suit. NTT previously acquired its cash-generating wireless carrier NTT Docomo Inc in 2020.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759771",
            "pub_date": "2025-06-20 14:51:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tencent Music shares double on break from China price cut script",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): China tech investors weary of the nation’s relentless price competition can look to one pocket that’s thriving by moving in the opposite direction: online music.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hong Kong-listed shares of Tencent Music Entertainment Group and smaller rival NetEase Cloud Music Inc have more than doubled since the end of 2023, outperforming most Chinese internet peers. That’s come as they shift to focus on monetisation of their loyal user bases while beefing up their podcast and live event offerings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tencent Music has notched four-straight quarters of growth in revenue per paying user by successfully driving subscribers to more expensive plans. That’s a refreshing break from the frequent headlines on deep price cuts for EVs and e-commerce that has sparked volatility in China tech stocks in recent years.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Music is becoming more important to the lives of young people in China, and you’re not going to just save one or two yuan to abandon all your playlists and jump to another platform,” said Ivan Su, an analyst at Morningstar Inc. “The monthly subscription price — which costs about the same as a cup of coffee — is very low.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Chinese online music industry has consolidated over the past few years, leaving the units of Tencent Holdings Ltd and NetEase Inc in a virtual duopoly. Spotify is blocked by a firewall in China.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tencent Music is the leader with about 555 million monthly active users as of the end of March, some 22% of which were paid subscribers. That compares with a paid penetration rate of around 40% for Spotify.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One of the key planks of Tencent Music’s monetisation strategy is its Super Premium VIP tier, where users pay roughly US$4 per month for exclusive content plus early access to special artist merchandise and live events. Subscribers pay about US$2 for a basic monthly subscription.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The percentage of premium members relative to all paying users could rise to 19% in 2027 from 12% this year, Goldman Sachs Group Inc analysts including Lincoln Kong wrote in a note this week. The bank added they expect 10% growth in average revenue per paid user this year and high-single digits for 2026 onward.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Like Spotify, Tencent Music is also making moves into other services. This month it announced a plan to buy Chinese podcasting start-up Ximalaya, and in May it disclosed its purchase of a stake in South Korean K-pop agency SM Entertainment Co.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There are a lot of innovative ways for the leading players to monetise their users, and all of these are very affordable items in this environment,” said Agnes Ng, a portfolio specialist at T Rowe Price Group Inc. “With only two major players left in the market, competition is very benign and market share is stable.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Morningstar’s Su said that NetEase Cloud’s stock has outperformed as it “turned profitable a lot quicker than people expected”. On the other hand, Tencent Music has a “much more robust content library”, with a broader user base.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The subsector’s big gains have made the stocks somewhat pricier. Tencent Music shares are trading at 21 times forward earnings estimates, above their three-year average but well below Spotify’s nearly 60 times. NetEase Cloud Music is at 24 times.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tencent Music’s valuations “still look attractive, particularly when compared to Spotify”, while content-related stocks overall have been enjoying a premium due to lower exposure to tariffs, said Kevin Net, the head of Asian equities at Financiere de L Echiquier. “I think investors like its 70%+ market share in an underpenetrated market, with potential for price increases.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Siow Chen Ming</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759774",
            "pub_date": "2025-06-20 14:51:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SST expansion: CIMB Securities sees limited direct impact on auto sector",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): CIMB Securities has projected the upcoming sales and service tax (SST) expansion in July to have limited direct impact on the automotive sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">In a research note, it said vehicle sales are already subject to a 10% sales tax, while maintenance and repair services incur an 8% service tax. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"That said, there may be a slight increase in dealership and showroom rental costs due to the measure, although we believe the impact will be minimal. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"Indirectly, however, weaker consumer sentiment could weigh on new vehicle sales in the second half of 2025 (2H2025),\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">The Malaysian Automotive Association has reportedly projected a 4.5% year-on-year (y-o-y) decline in total industry volume (TIV) to 780,000 units in 2025, attributing this to demand normalisation and a reduced industry order backlog. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">CIMB Securities has, however, forecasted a sharper 7.0% y-o-y decline in TIV to 760,000 units, due to potential headwinds from the planned removal of the RON95 petrol subsidy in 2H2025, which Prime Minister Datuk Seri Anwar Ibrahim has affirmed will proceed as part of the government’s subsidy rationalisation. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"Despite this, we expect demand in the sub-RM100,000 segment to remain resilient, supported by national brands and selective entry-level Japanese models. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"We project national brands to retain a dominant 64.5% market share in 2025, with non-national marques accounting for the remaining 35.5%,\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">CIMB Securities also believes the removal of fuel subsidies could accelerate battery electric vehicle (BEV) adoption. BEV sales nearly doubled y-o-y in the first quarter (1Q2025) to 5,394 units from 2,703 units a year ago, with combined BEV and hybrid penetration rising 1.9 percentage points y-o-y to 7.3%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"With full duty exemption for imported EVs set to expire by end-2025, and the government unlikely to extend it beyond the deadline, we expect a potential spike in EV demand in 4Q2025 as buyers rush to benefit from tax savings,\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">CIMB Securities maintained its 'neutral' call on the sector due to a subdued growth outlook amid intensifying market competition. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\"><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759433\" target=\"_blank\">MAA sees vehicle sales remaining soft in June after 3% y-o-y dip in May</a></em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759769",
            "pub_date": "2025-06-20 14:41:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia’s exports dip for first time in 2025, sharply shrinking trade surplus, official data show",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Malaysia’s exports fell in May for the first time this year amid sharp decline in shipments of petroleum products and lower deliveries to China and Japan, official data on Friday showed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The decline overshadowed continued surge of exports to the US amid a 90-day pause on a sweeping set of steep tariffs. All in all, exports slipped 1.1% year-on-year and 5.2% month-on-month to RM126.62 billion, the Ministry of Investment, Trade and Industry (Miti) said in a statement.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Malaysia stands to benefit “significantly” from expansion in global semiconductor sales despite uncertainties in global economic conditions, Miti said. “While the sector’s outlook remains positive, proactive policy responses will be crucial to sustain this growth momentum,” the ministry added.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shipments of electrical and electronics (E&amp;E) products — which made up over 42.4% of total exports — rose 7% year-on-year in May followed by a 16.4% increase in exports of machinery, equipment, and parts. However, exports of petroleum products fell nearly 30%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In terms of markets, deliveries to Malaysia’s largest trading partner China fell 4.3% in May when compared with the same month last year, due to lower exports of liquefied natural gas, metal and paper products.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Exports to the US were up 16%, the eighth consecutive month of double-digit growth, driven by electronics and processed food as well as machinery, equipment and parts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, gross imports climbed 6.6% year-on-year to RM125.86 billion, lifted by higher inbound shipments of E&amp;E products and machinery-related goods.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Capital goods imports surged 63.7%, mainly due to increased purchases of non-transport capital goods. Imports of intermediate goods — components and materials used in the final assembly of products such as cars and computers — fell 4.4% due to primary fuels and lubricants.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Imports of consumption goods dipped 1.1% from softer demand for primary food and beverages for household consumption.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On a month-on-month basis, total imports were down 2%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The decline in exports, coupled with the rise in imports, sharply narrowed the trade surplus in May to RM766.3 million in May. Trade surplus was down 92.3% on a year-on-year basis and shrank 85.2% month-on-month. </p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759764",
            "pub_date": "2025-06-20 14:21:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}