{
    "data": [
        {
            "title": "China’s warning on blind-box toys sends Pop Mart shares sliding",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Pop Mart International Group Ltd shares dropped in Hong Kong after a Chinese state media commentary called for stricter regulation of blind-box toys and trading cards, stoking concern over the company’s wildly popular Labubu dolls business.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the commentary didn’t call out Pop Mart by name, it spooked traders who have propelled the company’s stock to a nearly 170% gain this year amid the craze for its toothy monster dolls. Pop Mart often sells its dolls inside a blind box, which means the buyer doesn’t know what specific character is inside until they open it. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of the Beijing-based toymaker, which has a market value of about US$40 billion (RM170.16 billion), dropped as much as 6.2% after tumbling 5.3% on Thursday. Bloks Group Ltd, which sells similar products, fell as much as 7.7%. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China should further refine regulations for “blind cards” and “mystery boxes” as some of the current business models induce minors to become addicted to purchasing these products, according to a feature story carried on the 19th page of the<em> People’s Daily</em>, the flagship newspaper of the Chinese Communist Party, citing legal experts. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The commentary has weighed on investor sentiment, flashing some overheating signs in its business,” said Steven Leung, an executive director at UOB Kay Hian Hong Kong Ltd, referring to Pop Mart. “Still, it’s a mild reminder as it didn’t come directly from a government official.”</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/Labubu_20250620120241.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/Labubu_20250620120241.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In China, the government prohibits sales of blind boxes to children under the age of eight due to concern over potential addiction. Before the authorities imposed such guidelines in 2023, regulatory risk was a key concern among investors. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But even with the slump this week, Pop Mart shares are still the best performers in the MSCI China Index, as consumer fervour for its toys has turned it into one of the hottest Chinese growth companies. Wall Street analysts have been increasing their price targets for the company, citing the growing influence of its intellectual property.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Celebrities including Rihanna and BlackPink’s Lisa have been spotted carrying Pop Mart’s toys, making it one of China’s most notable consumer brands to gain popularity globally. Policymakers in Beijing have sought to encourage such success stories, which may temper expectations for a more disruptive crackdown.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kayou, a Chinese maker of trading cards, pushed back its plan for an initial public offering in Hong Kong last year after negative publicity surrounding the industry from Chinese state media. It refiled for the listing in April.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759760",
            "pub_date": "2025-06-20 13:01:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Industry working group set up to boost cyber-resilience across Malaysian stockbroking system",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): A dedicated industry working group has been formed to boost cyber resilience across the Malaysian stockbroking ecosystem, the stock exchange operator announced on Friday. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The industry working group, chaired by Bursa Malaysia Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/1818\" target=\"_blank\">BURSA</a>) chief regulatory officer Julian M Hashim, comprises representatives from four bank-backed brokers, two non-bank brokers, and two subject matter experts in the field of cybersecurity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The industry working group targets to finalise its recommendation paper within four months, with the subsequent implementation phase focused on the execution of the recommendations,” the operator of the Malaysian stock exchange said in a statement.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move follows a widely-reported incident of unauthorised trades of a handful of securities on April 24 involving about 80 accounts at several brokers. Since then, stockbrokoing firms have been asking their clients to reset their passwords and take other precautionary measures.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On May 21, Bursa Malaysia sent out a directive to mandate that all stockbroking firms implement multi-factor authentication by the end of 2025.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The industry working group represents a concerted effort to strengthen the cyber resiliency of our trading ecosystem,” Bursa Malaysia chief executive officer Datuk Fad’l Mohamed said. “Cyber resiliency is not just a technology best practice — it is the cornerstone of a trusted and vibrant capital market.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The group held its inaugural meeting on June 17, where it finalised its terms of reference, including assessing current cybersecurity practices and identifying systemic vulnerabilities within the stockbroking ecosystem.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Its mandate also calls for developing industry-wide standards and best practices for information and communication technology risk management and incident response as well as recommending enhancements to regulatory frameworks and operational protocols to improve cyber resilience.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Recognising the diversity in operational complexity across stockbroking firms, consultation with the industry will be carried out to ensure the recommendation paper is practical and fit for purpose,” Bursa Malaysia added.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759756",
            "pub_date": "2025-06-20 12:51:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Morgan Stanley says Hong Kong’s housing sector is bottoming out",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Hong Kong’s residential property market is poised for a recovery after enduring a seven-year downturn, according to Morgan Stanley.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Home prices in the city are set to bottom out, driven by an influx of mainland Chinese buyers, improved capital markets and a recent plunge in interest rates, analysts led by Praveen Choudhary said in a report dated June 19.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“While we may be early, we see several reasons to be optimistic that we could be at the onset of an up cycle, which could last four to five years,” the analysts said. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mainland buyers are bolstering Hong Kong’s residential market, as the city’s rental yields now surpass those in tier-one Chinese cities, fuelling increased investment demand. Additionally, a recovering capital market is generating a wealth effect that further supports housing demand, they added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The lower interest rates will also support the market. The one-month Hong Kong Interbank Offered Rate is hovering at the lowest level in three years after plunging last month. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, challenges remain with a surging number of unsold apartment inventory, rising underwater mortgage cases, and an increasing unemployment rate in the city, according to the report. Some developers will still have a hard time operating despite a recovering market. The bank cautions on New World Development Co because of its liquidity crunch.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Morgan Stanley expects home prices to stop their decline and grow 2% in the second half of the year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759758",
            "pub_date": "2025-06-20 12:51:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KLCI's next pullback could spark opportunities to accumulate blue chips — analysts",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Investors should stand ready to accumulate blue-chip stocks, anticipating that the next pullback in the FBM KLCI, particularly if it dips below the critical 1,500-point psychological level, said analysts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At the Friday opening bell, the benchmark index slipped as much as 1.4 points to 1,500.04 from the previous day’s close of 1,501.44. It later rebounded slightly to 1,501.77 points.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Broader market sentiment remained negative, with 341 decliners outnumbering 205 gainers, while 383 counters were unchanged.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Financial Services index was the only sector in the green, rising 0.5%. Among the worst performers were real estate investment trusts (REITs), down 0.86%, followed by telecommunications and media (-0.77%) and construction (-0.59%).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The cautious mood in the stock market comes amid heightened geopolitical risks in the Middle East, as US President Donald Trump is reportedly set to decide within two weeks whether to involve the US in the ongoing Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Sentiment was also dampened by the US Federal Reserve’s hawkish surprise, projecting only one rate cut in 2025 and signalling higher long-term interest rates.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Rakuten Trade has advised clients to accumulate blue-chip stocks, expecting continued foreign selling pressure on Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We would advocate our clients to accumulate blue chips if and when the index dips below the 1,500 mark, around the 1,480 level,\" it said in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Separately, Apex Securities said investors are likely to focus on defensive sectors such as REITs, banks, and utilities, as the market is expected to remain range-bound and volatile until clearer catalysts emerge.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The energy sector may also remain in favour due to the ongoing geopolitical tensions, it added, while the consumer and industrial sectors could continue to face pressure from the upcoming expansion of the sales and service tax (SST), which will take effect in less than two weeks.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Isabelle Francis</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759754",
            "pub_date": "2025-06-20 12:11:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Leong Bank upgraded to ‘buy’ as associate Bank of Chengdu's shares rally — CIMB Securities",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): CIMB Securities upgraded Hong Leong Bank Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5819\" target=\"_blank\">HLBANK</a>) to a 'buy' rating, viewing its recent share price weakness as a buying opportunity, especially given the notable gains at its Chinese associate Bank of Chengdu Co Ltd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bank of Chengdu’s share price rally was boosted as part of the finalisation of the US’ tariffs on China, with its share price hitting a new high of 19.57 yuan (RM11.58), up 21.7% from a recent low of 16.05 yuan in February, according to CIMB Securities in a research note on Friday. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As a result, the value of Hong Leong Bank’s 17.8% stake rose, with its portion of the Chinese associate’s market capitalisation increasing by 11.9% in value, or RM922 million, reaching RM8.7 billion as of June.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Subsequently, the research firm upgraded its target price for Hong Leong Bank to RM21.50 from RM21.40 previously.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We believe the risk-reward trade-off for Hong Leong Bank is now tilted to the upside given the diverging share price performances,” said CIMB Securities.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite a recent 2% dilution in Hong Leong Bank’s stake following the full conversion of Bank of Chengdu’s convertible bonds by other stakeholders, the group has faced further financial impact, added the house.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the third quarter ended March 31, 2025 (3QFY2025), Hong Leong Bank reported a drop in net profit, mainly due to dilution-related losses in its associate. CIMB Securities said Hong Leong Bank’s market cap dropped 9.3% to RM42.1 billion, weighed by a one-off RM408 million dilution loss booked in the quarter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Analysts noted this non-cash loss — largely related to Bank of Chengdu — is unlikely to recur and does not reflect the bank’s underlying fundamentals.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a show of unanimity, all 17 analysts covering Hong Leong Bank’s stock have assigned a 'buy' rating, according to <em>Bloomberg</em>, which underscores analysts’ confidence in the bank’s prospects. The 12-month average target price is RM24.11.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>CIMB Securities also expects Hong Leong Bank’s dividend outlook to improve, projecting yields of 4.5% for FY2026 and 5.1% for FY2027, underpinned by higher payout ratios following the implementation of Basel III reforms in 2026. The reforms are expected to raise the bank’s common equity Tier 1 capital buffer, allowing greater flexibility for capital returns.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The bank’s asset quality continues to outperform industry peers, with a gross impaired loans ratio of 0.57% in 3QFY2025 — well below the sector average of 1.42%, according to the research house. While Hong Leong Bank’s loan loss coverage fell to 95% following the release of pre-emptive provisions, CIMB Securities believes the bulk of impaired loans are backed by strong property collateral and remain well covered.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>CIMB Securities noted that Hong Leong Bank has strong fundamentals, resilient asset quality and improved dividend potential to strengthen its position for a re-rating.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/757015\" target=\"_blank\">Hong Leong Bank’s 3Q profit drops due to dilution losses, lower earnings from associate companies</a></em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Isabelle Francis</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759752",
            "pub_date": "2025-06-20 12:01:44",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia’s timber exports may gain edge due to higher US tariffs on competitors — Frim director",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Malaysia’s timber exports may gain a competitive edge in the American market due to higher tariffs imposed on regional rivals such as Vietnam and Indonesia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Vietnam, once a leading furniture exporter in the region, now faces tariffs as high as 46% compared with Malaysia’s import levy of 24%, director of Forest Products Division, Forest Research Institute Malaysia (Frim) Wan Tarmeze Wan Ariffin said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“US President Donald Trump imposed higher tariffs on Vietnam probably because they’re afraid China might use Vietnam as a manufacturing hub” to bypass American trade restrictions,” he said.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US is the largest buyer of Malaysian furniture, accounting for over half of furniture exports.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, the tariffs announced on April 2 have been paused for 90 days till early July to allow America’s trading partners to negotiate for lower tariffs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“If they don’t impose high tariffs on Vietnam, China could exploit that route. So, on paper, the advantage actually lies with us [Malaysia],” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In 2022, Malaysia exported timber and timber products worth RM7.73 billion to the US. This was a steady increase from RM3.76 billion in 2018.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Malaysia’s timber exports worldwide include furniture, logs, veneer, plywood and medium-density fibreboard. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Asked on the challenges faced by the timber industry, Wan Tarmeze said Malaysia’s furniture sector primarily relies on processed wood rather than solid timber, with wood-based materials accounting for up to 85% of inputs in the making of the furniture.</p></div>\n<h3>Geopolitical tensions may create opportunities</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said the ongoing Iran-Israel military conflict was not expected to have a direct impact on Malaysia's timber exports.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Nevertheless, post-conflict reconstruction could open up new market opportunities and raise demand for Malaysian timber.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Wars often lead to widespread destruction, but once the situation stabilises, there’s usually a surge in demand for rebuilding — including homes and infrastructure,” he said.</p></div>\n<h3>Calls for shift from OEM to OBM in timber exports</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>When asked how Malaysia can position itself as a high-value timber exporter rather than a volume-based player, he said the shift ultimately depends on the industry players themselves.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This has been a long-standing conversation as Malaysia is still heavily reliant on the original equipment manufacturer (OEM) model, manufacturing timber products for others without having its own strong, internationally recognised brands.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Take IKEA for example, which is a Swedish brand while Italy has its own well-known brand names, but Malaysia has yet to produce a brand that stands out globally,” he said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>OEM refers to manufacturing products for other brands, whereas original brand manufacturers (OBM) involves developing and marketing products under one’s own brand name.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wan Tarmeze said that despite the government's repeated calls for the industry to move from being OEMs to OBMs, the shift has yet to happen.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The issue is not about identity but branding, and without branding we can’t build value.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The truth is Malaysia tends to shy away from copying, but we should be more open to learning from others, even “stealing” ideas in the sense of adapting best practices and making them our own,” he said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em><br/>\n </p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759753",
            "pub_date": "2025-06-20 12:01:37",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "White sugar will not be taxed, refiners can ask for exemption for raw sugar, says Finance Ministry",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20) Refined sugar, more commonly known as white sugar, will not be taxed under the expanded sales and services tax to be enforced on July 1, the Ministry of Finance reiterated on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Raw sugar, the input used in the manufacturing of refined sugar, however will be taxed 5% as previously announced, the ministry said in a statement. However, refiners such as MSM Malaysia Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5202\" target=\"_blank\">MSM</a>) are allowed to apply for tax exemption, the ministry said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There is no reason for an increase in prices of refined sugar, especially since refiners like MSM continue to receive monthly incentives from the government to ensure stability in supply and prices,” the ministry stressed.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The statement comes after MSM, one of only two sugar refiners in the country, flagged cost pressures from the expanded tax regime. Retail sugar prices in Malaysia have been capped at RM2.85 per kilogramme since 2011, despite rising global raw sugar prices in recent years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MSM chief executive officer Syed Feizal Syed Mohammad told reporters on Thursday that the company was seeking clarification from the government.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Refiners and manufacturers in Malaysia can apply for tax exemption from the Customs Department, the Ministry of Finance said on Friday. The exemption is provided under Item 1, Column (2), Schedule B in the sales tax order (persons exempt from payment of tax), the ministry added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759646\" target=\"_blank\">MSM flags cost pressures from 5% SST on raw sugar; still in talks with govt on price mechanism</a><br/>\n<br/>\n </p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759749",
            "pub_date": "2025-06-20 11:51:41",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s Baidu eyes robotaxi expansion to Malaysia, Singapore this year — Bloomberg",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Baidu Inc is planning to launch its Apollo Go robotaxi service in Malaysia and Singapore as early as this year, according to a person familiar with the matter, as the company continues to expand its global footprint.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Apollo Go is in discussions with potential partners to explore the right business models for the two markets, said the person, who asked not to be identified discussing private matters. Baidu chief executive officer Robin Li has previously said the company was seeking partners such as mobility service providers, local taxi companies and third-party fleet operators for an asset-light approach.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The development comes as Tesla Inc prepares to launch its Cybercab robotaxi network within days, with Elon Musk staking the electric car maker’s future growth on autonomous driving technology. At the same time, Chinese robotaxi companies including Apollo Go, and US-listed Weride Inc and Pony AI Inc are expanding into international markets such as the Middle East, Europe and Southeast Asia.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Baidu didn’t immediately respond to a request for comment. Dow Jones Newswires reported the plans earlier. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Apollo Go is fast scaling up. It has deployed than 1,000 self-driving vehicles worldwide, most of which are in China. It reached 11 million rides by the first quarter of this year, surpassing Alphabet Inc’s autonomous driving unit Waymo’s 10 million paid rides as of May 23. The Baidu unit is also exploring entering Europe and Turkey, and was in talks with Swiss Post unit PostAuto to roll out a robotaxi service in Switzerland.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759751",
            "pub_date": "2025-06-20 11:51:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Court grants Najib temporary discharge in second case linked to SRC",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The High Court has granted former prime minister Datuk Seri Najib Razak a discharge not amounting to acquittal (DNAA) in his money-laundering trial linked to SRC International Sdn Bhd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>High Court judge K Muniandy on Friday said that the case — which was initiated in 2019 and of which trial is yet to start — has been pending in the court's schedule for too long.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Moreover, the judge said that the DNAA order, which means the charges are dropped temporary, does not prejudice the prosecution as they are free to re-charge Najib when they are ready.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The case against the accused person has been pending in this court for a period [of] six years since 2019,” he continued, “not an iota of witness testimony has been pursued with but only a plethora of postponements indicating that the prosecution is not ready with the prosecution of the case.”</p></div>\n<div class=\"mt-3 imgw-300 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/Najib-update_20250620100329.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/Najib-update_20250620100329.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The court should only issue DNAA orders \"sparingly and grudgingly\", but there was nothing to show that the prosecution can proceed with the case expeditiously in the immediate future, he noted.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Judge Muniandy also said that it is the principle in law that an accused is innocent until proven guilty and that once someone is charged, it cannot be \"hanging over his head for an indeterminate or indefinite period\" as it would be \"harsh and illegal\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The decision on Friday comes after a brief case management last week, where deputy public prosecutor Mohd Ashrof Adri requested that the case proceed to trial but requested some time to prepare all the related documents.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohd Ashrof had explained that there were over 800 documents linked to the first SRC case which needed to be located within the various courts as the prosecution last saw them during the trial in 2020.</p></div>\n<h3>Letters of rep rejected, Shafee asked for DNAA</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohd Ashrof also informed the court that Najib's latest letter of representation to drop the three money laundering charges had been rejected.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Senior counsel Tan Sri Muhammad Shafee Abdullah then repeated his request for the court to granted his client a DNAA, \"in the interest of justice\", as the case has been pending for quite some time.</p></div>\n<div class=\"mt-3 imgw-300 embed-right\"><a class=\"mobx embedimg-icon\" data-desc=\"Tan Sri Muhammad Shafee Abdullah, senior counsel for Datuk Seri Najib Razak, repeated his request for the court to granted his client a discharge not amounting to acquittal as the case has been pending for quite some time.\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/Tan-Sri-Muhammad-Shafee-Abdullah-2-3-ZHD-theedgemalaysia-theedgemalaysia-20250620103855-theedgemalaysia_20250620104133.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/Tan-Sri-Muhammad-Shafee-Abdullah-2-3-ZHD-theedgemalaysia-theedgemalaysia-20250620103855-theedgemalaysia_20250620104133.jpg\"/></a>\n<div class=\"thumb-cap\">Tan Sri Muhammad Shafee Abdullah, senior counsel for Datuk Seri Najib Razak, repeated his request for the court to granted his client a discharge not amounting to acquittal as the case has been pending for quite some time.</div>\n</div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Najib, who turns 72 next month is slapped with three counts of money laundering by accepting proceeds from illegal activities amounting to RM27 million through his three AmPrivate Banking accounts in July 2014.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The case has been pending mainly to accommodate his other criminal trials.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The ex-PM is currently serving his prison sentence in the first SRC case, after the apex court dismissed his appeal and review bid.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In February last year, the Pardons Board reduced his initial 12-year jail sentence and fine of RM210 million to six years and RM50 million fine.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/758587\" target=\"_blank\">Najib's bid to drop second SRC charges rejected; prosecution pushes for trial to proceed</a> </em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759744",
            "pub_date": "2025-06-20 11:31:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stocks struggle, oil up for third week as Trump weighs US action on Iran",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SYDNEY (June 20): Share markets in Asia struggled for direction on Friday as fears of a potential US attack on Iran hung over markets, while oil prices were poised to rise for a third straight week on the escalating Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Overnight, Israel bombed nuclear targets in Iran, and Iran fired missiles and drones at Israel as a week-old air war intensified with no sign yet of an exit strategy from either side.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The White House said President Donald Trump will decide in the next two weeks whether the US will get involved in the Israel-Iran war. The US president is facing uproar from some of his MAGA base over a possible strike on Iran.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Brent fell 2% on Friday to US$77.22 (RM328.30) per barrel, but is still headed for a strong weekly gain of 4%, following a 12% surge the previous week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The 'two-week deadline' is a tactic Trump has used in other key decisions, including those involving Russia and Ukraine, and tariffs,\" said Tony Sycamore, an analyst at IG.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Often, these deadlines expire without concrete action, (similar to 'Trump always chickens out' or TACO), and there is certainly a risk of this happening again, given the complexities of the situation.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, a cautious mood prevailed in markets with Nasdaq futures and S&amp;P 500 futures both 0.3% lower in Asia. US markets were closed for the Juneteenth holiday, offering little direction for Asia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The MSCI's broadest index of Asia-Pacific shares outside Japan edged up 0.1% but was set for a weekly drop of 1%. Japan's Nikkei slipped 0.2%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China's blue chips rose 0.3%, while Hong Kong's Hang Seng gained 0.5%, after the central bank held the benchmark lending rates steady as widely expected.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the currency markets, the dollar was on the back foot again, slipping 0.2% to 145.17 against the yen after data showed Japan's core inflation hit a two-year high in May, which kept pressure on the Bank of Japan (BOJ) to resume interest rate hikes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Investors, however, see little prospects of a rate hike from the BOJ until December this year, which is a little over 50% priced in.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US bond market, which was also closed on Thursday, started trading in Asian hours on a subdued note. The 10-year Treasury bond yield was flat at 4.389%, while two-year yields slipped two basis points to 3.925%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Overnight, the Swiss National Bank cut rates to zero and did not rule out going negative, while the Bank of England held policy steady but saw the need for further easing and Norway's central bank surprised everyone and cut rates for the first time since 2020.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gold prices eased 0.2% to US$3,363 an ounce, but were set for a weekly loss of 2%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759748",
            "pub_date": "2025-06-20 11:31:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JD.com billionaire’s viral stunt reignites China’s food-delivery feud",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): One unusually warm evening in April, Richard Liu revved his scooter through Beijing’s traffic-snarled streets alongside other delivery workers, and then personally handed food orders to surprised customers. Later that night, over spicy hotpot and ice-cold beer, the JD.com Inc founder welcomed a pair of riders from two rival delivery firms to his company. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The publicity stunt, broadcast on viral online videos, reignited a fight for China’s US$80 billion (RM340.24 billion)-plus food delivery market. In just a few months, JD, China’s largest online retailer by revenue, amassed 25 million daily takeout orders across 350 cities, capturing more than half the volume of Alibaba Group Holding Ltd’s Ele.me, the runner-up to market leader Meituan. Neither saw Liu coming.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China’s food delivery industry has been in an effective duopoly after brutal price wars forced out many smaller players almost a decade ago. Takeout became more expensive even as merchants and riders complained about making less. Liu is now turning to an old playbook: charging restaurants no commission, generous hiring bonuses for 100,000 new full-time riders, plus a 10 billion yuan (US$1.4 billion or RM5.9 billion) discounting campaign for consumers. During its flagship shopping festival this month, JD sold coffee and bubble tea for as cheap as 1.68 yuan.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The food delivery war is indicative of the bifurcation in China’s mammoth tech industry. On the one hand, players like DeepSeek are spurring major tech firms to invest in innovations like generative artificial intelligence (AI). On the other, the effects of Beijing’s years-long Covid lockdowns and regulatory campaigns against Big Tech still linger, and many companies are desperately searching for sources of growth in a saturated market.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Liu’s marketing stunt is also personal. The viral videos of him waiting to pick up boxed lunches and downing beers with other riders mark a surprise return to the public eye for the 52-year-old tech mogul, who faded from the spotlight in 2018 when he was arrested in the US on suspicion of rape, though prosecutors in Minneapolis ultimately declined to press charges. During Beijing’s crackdown on the tech sector in 2022, Liu joined a long list of tech founders who stepped down.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>His departure coincided with some of JD’s toughest times since its founding as a tiny electronics outlet in 1998. Its premium online shopping service ran into China’s slowing economy, its own bargain app flopped, and an overseas foray was abandoned. That left JD with no growth story, as giants Alibaba and Tencent Holdings Ltd bet big on generative AI and smaller rivals such as Meituan and Didi Global Inc exported their gig-economy models abroad. Even Meituan has begun selling and delivering everything from iPhones to washing machines in a few hours.</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/JD_20250620102628.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/JD_20250620102628.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“For JD, it’s a lost five years, to put it bluntly,” Liu said during a rare news conference at the company’s Beijing headquarters on Tuesday. “No innovation, no growth, no progress. It should be considered the most unremarkable and least valuable five years in my entrepreneurial history.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Explaining their rationale of getting into food delivery, Liu said that it’s about leveraging JD’s battle-tested logistics network to acquire new users, 40% of whom have already been converted into e-commerce customers. “Our losses are smaller than what we would have spent on advertising,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Not everyone is convinced. JD’s takeout business could generate as much as 18 billion yuan in annualised losses, wiping out 36% of its parent’s operating profit for 2025, says JPMorgan Chase &amp; Co. Arete Research estimates that as the market leader, Meituan will only need to spend about a quarter of JD’s costs to defend its position. JD’s loss per order will narrow to three yuan in the second half of 2025 from eight yuan this quarter as it pares back subsidies to confront the economic reality, the equity research house predicts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We do not think JD will find material success in local services like insta-commerce, but understand management’s sense of urgency in needing to diversify its business mix and feeling threatened by Meituan,” Arete analysts Shawn Yang and Richard Kramer wrote in a note in June.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Representatives of JD, Alibaba, and Meituan didn’t respond to requests for comment for this story.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>What’s clear is that JD has injected new life into a long-dormant market.<strong> </strong>Ele.me, hardest hit by JD’s offensive, gave out 10 billion yuan in subsidies to customers, then another one billion yuan to restaurants. Alibaba also integrated the takeout app into its flagship e-commerce platform Taobao in the hope of diverting more traffic to it. Meituan for the first time ever is giving away vouchers on things like smartphones and liquor during the June 18 sales event that JD invented more than a decade ago. Its founder Wang Xing declared to investors in May that it would do “whatever measure it takes to win the game”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The renewed food-delivery battle is reminiscent of the all-out war in online shopping just years ago, when alleged abuses like forcing merchants into exclusive arrangements helped fuel Beijing’s Big Tech crackdown, wiping out trillions in wealth. Though pressure has eased, government scrutiny remains heightened as high youth unemployment drives more and more people to take up gig work. Regulators in May<strong> </strong>summoned executives from the three takeout firms into meetings on fair competition and protection of riders, among other topics.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>By 2024, China had more than 10 million delivery riders, official data showed. In Beijing, there were 17,000 riders in the first half of 2024, up 50% from a year ago. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>And amid growing awareness of how riders often prioritise speed over safety to earn more, Ele.me said in April that it would gradually phase out a cash penalty system for riders who miss their deadlines.<strong> </strong>JD is going further in worker benefits by paying social security — a government-sponsored welfare system including pensions and medical insurance — for all of its full-time riders. Meituan and Ele.me followed suit with similar policies.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>JD has won over riders like Jiang Xiaoxi, a migrant worker in Shenzhen who joined Meituan before Covid but quit last year to take care of her sick grandfather in her hometown in the Hunan province. When the 25-year-old returned to Shenzhen this year, she picked JD instead for regular eight-hour shifts and persuaded her peers to jump ship. “I signed a contract on day one,” she said. “Having social security as a full-time employee gives me a sense of belonging.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Others are wary of such promises, with memories of the past delivery price-war still fresh. Tang Zequan, 36, recalls how in 2016 he could make more than 10 yuan per order as a new driver for Meituan in Guangzhou. After Meituan emerged dominant, his earnings went down to 7 yuan per order. As a high-school dropout, he acknowledges that no other job could have helped him pay off debts so quickly after his real estate brokerage business went under during Beijing’s crackdown on the property market.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“I have great gratitude for the food delivery industry, but I won’t pay allegiance to any firm,” Tang said. “Without choices we are left with a monopoly.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759747",
            "pub_date": "2025-06-20 11:21:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore’s banking hub has a corner where cash is still king",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): In the heart of Singapore, a financial hub where billions of dollars zip around the world over computer screens in nanoseconds, there’s a crowded building where cash still reigns.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Six days a week, hundreds of people line up in a rundown mall abutting Raffles Place square to buy and sell hard currency at one of around 30 money changer stalls. All manner of notes can be had in minutes: Singapore dollars for British pounds? Coming right up. Indonesian rupiah for Vietnamese dong? Icelandic króna? Maldivian rufiyaa? No problem. Some 150 currencies are available.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Cash will remain forever,” said Abdul Haleem, 65, a veteran of the industry whose kiosk sits at the entrance to the narrow, three-storey plaza called The Arcade. The towering offices of global banking giants JPMorgan Chase &amp; Co and Bank of China Ltd are just steps away.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The number of licensed money changers in Singapore dropped during the Covid-19 pandemic when many people were unable to travel and retail shops struggled to pay rent. But there are close to 250 physical stalls still operating, and new ones continue to spring up across the city state’s 284 square miles of land. That’s even though multi-currency payment apps such as YouTrip, Wise and Revolut have grown in popularity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>To understand how so many cash dealers can survive the digital age, you need to know a bit about Singapore’s place in the world. Though it’s now among the richest countries — where financial titans from UBS Group AG to BlackRock Inc. manage more than US$4 trillion (RM17 trillion) and billionaires including James Dyson, Ray Dalio and Sergey Brin have set up family offices — the island nation remains a shipping and transit hub at its core.</p></div>\n<div class=\"pb-5 imgw-800 mx-auto d-block\"><a class=\"mobx embedimg-icon\" data-desc=\"City Money Changers at Raffles Place in Singapore.\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/SG2_20250620093302_bloomberg.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/SG2_20250620093302_bloomberg.jpg\"/></a>\n<div class=\"thumb-cap\">City Money Changers at Raffles Place in Singapore.</div>\n</div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hundreds of vessels anchor in Singapore’s harbour each day, many waiting to load and unload cargo at one of the world’s busiest maritime ports. For decades, that’s made Raffles Place a prime location for money changers, just a few blocks from where the Singapore River empties into the Singapore Strait. Many sailors need to swap cash from their previous locations, and change money for their next destination.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“They get off the boat and come right here,” said Haleem, whose uncle Abdul Gaffoor, now 99, started City Money Changers on the Arcade’s ground floor in 1980.</p></div>\n<h3>Old-world relic</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Many office workers also come in search of the best exchange rates — which are often better than what banks offer. It’s an old-world relic resisting the bits and bytes revolution. Mobile phones and tablets have replaced newspapers, while emails and social media have supplanted faxes and letters. Now digital payments are coming for the ancient culture of coins and paper notes.</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/SG1_20250620093114.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/SG1_20250620093114.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohamed Rafik, 55, a partner at Arcade Money Changers, a stall opposite Haleem’s, remains optimistic. His evidence is that there are new licensees entering the industry who wouldn’t do it if they couldn’t make a living.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Money changers won’t go out of business,” said Rafik, while handling cash and paper receipts on a busy afternoon. Digital payment wallets may seem attractive now, but the companies also have overheads and may try to increase rates in the long run, he predicted. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Right now, a thriving tourism industry is driving demand during the summer school holidays. Singapore is close to Southeast Asian holiday hotspots like Phuket in Thailand, Vietnam's Ha Long Bay and Bali, Indonesia, where cash is still needed to pay for food at street stalls or small restaurants, or to offer tips.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Travellers with cash also avoid the higher exchange rates and foreign transaction fees imposed by many credit cards.</p></div>\n<h3>Life lesson</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For Christina Ng, a teacher in her 40s who came to Haleem’s stall for South Korean won, cash gives a sense of security while traveling. Paying with notes and coins is also a lesson for her three children.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“I want them to learn how to use the cash and do the transaction, so they need to see the physical money,” she said. “We don’t want them to just tap, tap, tap without actually knowing what they are spending on.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The money changers are good leading indicators of travel trends. Whereas demand used to be strongest for US dollars and ringgit, the Japanese yen is now most sought-after, along with South Korean won and Taiwanese dollars, Haleem said. A record number of tourists have flocked to Japan to visit historic sites, dine on sushi and take advantage of the weakened currency.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At the Arcade, the money changers carve out an existence on the fringes of the multi-trillion dollar global foreign-exchange market. Customers throng the narrow passages to scrutinize buy and sell rates at tightly packed stalls, which are required to post rates on electronic screens.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Frugality gives them an edge against the financial institutions that occupy the opulent towers surrounding Raffles Place, according to Rafik at Arcade Money Changers. The changers will survive even if digital platforms cut their margins to zero to gain market share, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Congregating in one location attracts more customers, but it also pares margins to the bone. Foreign currency bought at a commercial bank can cost 1% to 4% or more once you factor in a poorer exchange rate and transaction fees. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At City Money Changers, it’s a high-volume, low-margin business where Haleem typically makes fractions of a penny on the dollar in a swap. “Everybody wants to see the best price so they will shop around,” he said, while taking a break from his tiny kiosk.</p></div>\n<div class=\"pb-5 imgw-800 mx-auto d-block\"><a class=\"mobx embedimg-icon\" data-desc=\"Abdul Haleem, 65, a veteran of the industry.\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/SG3_20250620093302_bloomberg.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/SG3_20250620093302_bloomberg.jpg\"/></a>\n<div class=\"thumb-cap\">Abdul Haleem, 65, a veteran of the industry.</div>\n</div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On Thursday afternoon, Haleem's stall was selling the greenback at S$1.2900, versus the S$1.2972 offered by DBS Group Holdings Ltd, Singapore’s largest bank, on its retail app. The cash exchange rate wasn't as favourable as YouTrip's rate of S$1.2877 per US dollar.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>With all this cash on hand — some changers can turn over S$500,000 (US$389,000 or RM1.65 million) a day, he says — you would expect to see armed guards all over the plaza. Not in Singapore, where violent crime is almost non-existent.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Instead, the stall-holders rely on security cameras — there are some 90,000 across the city — to monitor activity. The dealers are the eyes and ears for each other, on the alert for any suspicious customers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Regulators have scrutinised the industry in the past, concerned about the potential for money laundering.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In 2016, the Monetary Authority of Singapore (MAS) cited a Raffles Place currency changer, along with other banks, for their roles in the scandal at 1Malaysia Development Bhd (1MDB). The probe revealed inadequate risk management practices at the changer, and failure to identify the beneficial owners of funds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Money changers are now required to conduct customer due diligence measures for cash transactions exceeding S$5,000, or for those topping S$20,000 where the money is funded from an identifiable source like a bank account. That includes verifying customers’ identities and keeping proper transaction records. The industry poses a “moderate level” of money-laundering threats due to its cash-intensive nature, said a spokesperson for the MAS, the country’s financial regulator. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Haleem, who’s been at this trade for 40 years, concedes that the future isn’t all bright for his industry. Business is about half that of pre-Covid levels, and the increased competition is eroding margins, while wild currency swings can leave him sitting on devalued cash overnight.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He predicts the trend towards digital payments is only going to accelerate. “It will become worse and worse,” he said, though he thinks there will always be a little room in people’s wallets for cold hard cash.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One floor up at Crown Exchange, Thamim AK, a money changer in his 60s, is more sanguine. Sitting in a backroom surrounded by wads of South Korean won and Indonesian rupiah, he says his 40 years of trading, with all its ups and downs, gives him hope for the future.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“I have seen everything, all the currencies, fluctuations,” Thamim said. “The bank notes business is still there. It’s growing, in fact. It’s fighting with digital.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759743",
            "pub_date": "2025-06-20 11:11:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada moves to protect steel and aluminium firms, considers higher tariffs against US",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Canada has opened the door to increasing its tariffs on US steel and aluminium next month if trade talks with the Trump administration stall.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The government “will adjust its existing counter-tariffs on steel and aluminium products on July 21, to levels consistent with progress that has been made in the broader trading arrangement with the US”, according to a statement on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US has 50% tariffs on foreign steel and aluminium, and Canada currently has 25% counter-tariffs on US-manufactured steel and aluminium products. But the two countries are currently negotiating on a trade deal, with a provisional deadline for the middle of July. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We will continue these negotiations, of course, in good faith,” Prime Minister Mark Carney said at a news conference. “In parallel, we must reinforce our strength at home and safeguard Canadian workers and businesses from the unjust US tariffs that exist at present.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Canadian government will also introduce new rules for federal projects, restricting them to using steel and aluminium produced in Canada or by “reliable trading partners” that provide reciprocal access through trade agreements, according to the statement. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The plan “falls short of what our industry needs at this most challenging time”, the Canadian Steel Producers Association and the United Steelworkers Union said in a joint statement. “We will continue to review the details of the measures and work constructively with the federal government to get a plan that works for Canadian steel producers.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Canadian steelmaker Algoma Steel Group Inc closed at C$9.54 (RM29.61) in Toronto, up 4.5% and its highest level since March 6.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Canada is establishing new tariff-rate quotas to limit imports of steel from countries with which it doesn’t have a trade agreement — and it plans new tariff measures within weeks to address the risk of steel and aluminium dumping. Carney and his officials are worried that the Trump administration’s 50% tariffs on metals imports will cause global manufacturers to divert shipments to Canada. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The new quotas were not a request of the US during the trade talks, but are “a consequence of the US actions”, Carney told reporters.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The prime minister also highlighted a C$10 billion federal loan facility that provides liquidity to large businesses struggling to access traditional market financing.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He made the announcement alongside Cabinet ministers Dominic LeBlanc and Melanie Joly. Carney said he is speaking with US President Donald Trump “relatively frequently”, and LeBlanc added he’s having ongoing conversations with Commerce Secretary Howard Lutnick and will speak with Trade Representative Jamieson Greer on Friday. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Asked whether Canada would be willing to accept some US tariffs as part of a deal, Carney responded that true free trade is in the best interests of both countries. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“It’s a negotiation,” he said. “If it’s in Canada’s interest, we will sign it. If it’s not, we won’t.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759742",
            "pub_date": "2025-06-20 10:51:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Evergrande tycoon’s ex-wife spent millions on homes as firm sank",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The ex-wife of China Evergrande Group’s chairman spent millions on luxury apartments in London, nine months after the developer defaulted on its loans. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While a court document in January unveiled her ownership of 33 units at the high-end residential development Thames City, it didn’t include the timing of the purchase. The properties worth £49.8 million (US$67.0 million or RM285.4 million) were acquired in September 2022, according to data compiled by <em>Bloomberg News </em>based on UK land registry filings. That’s almost a year after Chinese authorities asked Evergrande chairman Hui Ka Yan to pay debt with his personal wealth.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ding Yumei holds the homes through five British Virgin Islands companies. She has hired Jones Lang LaSalle (JLL) as a letting and management agent, according to a UK court filing in January. The 68-year-old is living in one of the most expensive homes she purchased, worth £5.4 million, with two of her children and two grandchildren, according to court filings.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>She was no longer listed as a spouse of Hui in Evergrande’s filing in August 2023, while it’s unclear when the two divorced.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The properties add to a list of more than US$350 million global assets that Ding amassed, including a record-breaking mansion at the heart of London in 2020 and other ones in Vancouver. It underscores the challenges liquidators face in gaining full view of the assets held by Hui and his confidantes, and the obstacles to asserting control across multiple jurisdictions. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Once Asia’s second richest, Hui and Evergrande exemplify China’s real estate boom and bust. His sprawling empire was forced into liquidation in 2024, as China’s property meltdown continued into a fourth year. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Last year, JLL sought permission from the Business and Property Courts of England and Wales to continue managing Ding’s properties, following an injunction issued against her — a request that was granted by a UK judge. The move came after courts in both Hong Kong and London imposed worldwide asset-freeze injunctions on Ding in July, part of a broader effort to recover US$6 billion from her, Hui, and former Evergrande executives.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ding has been told to provide detailed asset disclosure to liquidators in Hong Kong, yet she has delayed the process by applying for a confidentiality summons and asking for other technical clarifications. Ding’s representatives have argued that she didn’t hold a management role in the company and wasn’t involved in operations. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ding’s representatives didn’t respond to requests for comment. Hui couldn’t be located, as he was taken away by Chinese police in 2023 and put under control. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The monthly rental for the Thames City apartments go from about £3,800 for a one-bedroom flat to more than £34,000 for a five-bedroom penthouse, according to listings from property platform Zoopla.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Thames City project was co-developed by Guangzhou R&amp;F Properties Co and C C Land Holdings Ltd, run by Cheung Chung Kiu, a poker-playing friend of Hui. In April 2022, R&amp;F sold a 50% stake in the project to a private vehicle wholly owned by Cheung at a loss of HK$1.8 billion (US$234 million or RM1.0 billion).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Later that year, R&amp;F’s co-founder Zhang Li chose to stay confined in one of the project’s penthouses when he was on bail after facing bribery charges from the US. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759740",
            "pub_date": "2025-06-20 10:41:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan’s stocks still under shadow of BOJ unwinding bond holdings",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The Bank of Japan (BOJ) is fine-tuning its pullback from the bond market but this mustn’t obscure the fact that quantitative tightening is well underway and likely to cause instability in some stocks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The potential impact of quantitative tightening may cast a shadow on the Nikkei 225 Stock Average’s chances of climbing further after hitting four-month highs this week. The blue-chip index is skewed towards growth stocks such as Fast Retailing Co, which owns the Uniqlo casual clothing chain, and chip-related firms Advantest Corp and Tokyo Electron Ltd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On top of growth stocks, which are known to be susceptible to higher bond yields, large-cap shares are vulnerable. The negative correlation of these shares with bond yields is increasing, said Akemi Hatano, the chief quantitative analyst of SBI Securities Co.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This highlights the need for vigilance among investors even after the BOJ this week announced a plan to reduce the pace of tapering in its bond purchases. That move was seen as stabilising the market after recent sharp moves higher in Japanese government bond yields that rippled across global debt markets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Rising bond volatility will have a big impact on how investors select stocks,” said Hatano. Large and blue-chip shares are vulnerable when it spikes because “they are the most convenient to reduce risks when investors want to cut their risk exposure in a short period of time”, she said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The BOJ started unwinding its massive bond buying last August but the pace has been slow. Its holdings fell ¥16.7 trillion (US$115 billion) over the past year. That’s a drop of less than 3%, which compares with a decline of about 10% in Treasuries on the Federal Reserve’s (Fed) balance sheet in its first year of quantitative tightening (QT).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The real impact of the BOJ’s will still be felt longer-term, said Masao Muraki, a senior analyst at SMBC Nikko Securities Inc. “We now expect QT to enter a phase of reducing excess liquidity in the banking sector, and this will trigger fiercer competition for deposits, and market instability,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>To be sure, fears that balance sheet reductions will hugely unsettle Japan’s markets may be overblown. One could argue that US stocks have remained resilient overall, despite the Fed’s unwinding of its holdings that began in 2022. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Even so, the big sell-off in Japanese bonds last month was a wake-up call for equity investors on the risk of rising yields.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Asset classes that have benefited from quantitative easing such as stocks could be affected by quantitative tightening,” said Muraki. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded</em> <em>by</em> <em>Isabelle</em> <em>Francis</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759737",
            "pub_date": "2025-06-20 09:51:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US futures drop as Trump weighs strikes on Iran",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Oil trimmed earlier gains and equity futures remained lower after White House press secretary Karoline Leavitt said US President Donald Trump will decide within two weeks whether to back Israel militarily in its conflict with Iran. The remarks offered some short-term clarity but did little to resolve broader uncertainty around potential US involvement and the risk of renewed energy-driven inflation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>S&amp;P 500 contracts slipped 0.9% in thin holiday trading. Europe’s Stoxx 600 dropped 0.8%, falling for a third straight session. Asian equities declined 1.4%, with losses concentrated in Japan and South Korea.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>West Texas Intermediate rose 0.7% to US$75.8 a barrel. Brent crude advanced past US$78 a barrel, extending gains in a week where market reaction to the Middle East conflict has been most concentrated in oil. The dollar was little-changed against a basket of currencies, after paring earlier gains.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Traders’ sentiment turned more cautious following a Bloomberg report that senior US officials are preparing for a possible strike on Iran in the coming days. Markets were already on edge after the Federal Reserve downgraded its estimates for growth this year and projected higher inflation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“If the US does strike, you are going to see a big knee-jerk reaction,” said Neil Wilson, an investor strategist at Saxo UK. “No one will be wanting to make big long bets.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Israel struck more of Iran’s nuclear sites on Thursday and warned its attacks could bring down Tehran’s leadership as both sides awaited a decision from Trump on whether to join the offensive.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The odds for the US to become involved are “quite high at this moment in time,” said Anna Rosenberg, the head of geopolitics at Amundi Investment Institute.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“For the US, this is a moment to take out a big geopolitical headache, which is Iran potentially developing a nuclear weapon,” Rosenberg told <em>Bloomberg</em> <em>TV</em>. “Having said that, acting comes with a lot of consequences too. Trump will have to make a really difficult decision.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Among a flurry of monetary policy decisions in Europe, the Bank of England kept its benchmark rate on hold at 4.25%. While the outcome was in line with economists’ expectations, more committee members than anticipated had voted for a cut. The pound fell before erasing the loss.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Earlier, the Swiss National Bank cut its interest rate to zero as policymakers sought to deter investors from pushing up the franc, which has gained almost 10% against the dollar this year. In Norway, officials surprised with the central bank’s first post-pandemic reduction of borrowing costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Some extreme scenarios resulting from increased US involvement in the Israel-Iran war could push oil prices as high as US$130 to US$150 a barrel, particularly if Iran retaliates in a major way, said Jennifer McKeown, the chief global economist of Capital Economics Ltd. Such a development would pause further policy easing by central banks, she said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Even though central banks would like to think that would be a temporary impact, I think it would be a brave central bank that would cut interest rates,” McKeown told <em>Bloomberg</em> <em>TV</em>.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Brent futures have been pricing in a geopolitical premium of about US$8 a barrel since Israel and Iran began attacking each other last week, according to a survey of analysts and traders. US intervention in the conflict would bolster that further, but exactly how much would depend on the nature of the involvement, the nine respondents said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded</em> <em>by</em> <em>Isabelle</em> <em>Francis</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759735",
            "pub_date": "2025-06-20 09:41:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says signed order extending deadline for TikTok closing",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>WASHINGTON (June 20): US President Donald Trump said on Thursday that he extended the June 19 deadline for China-based ByteDance to divest the US assets of short-video app TikTok for 90 more days.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"I've just signed the Executive Order extending the Deadline for the TikTok closing for 90 days (September 17, 2025),\" he said in a Truth Social post, which included a copy of the document.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump had already twice granted a reprieve from federal enforcement of a law that mandated the sale or shutdown of TikTok that was supposed to take effect in January.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump has said he wants to keep the app, which helped him woo young voters in the 2024 presidential election, active. He has also expressed optimism that Chinese President Xi Jinping would approve a deal that preserves the app in the United States.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>TikTok said in a statement that \"we are grateful for President Trump's leadership and support in ensuring that TikTok continues to be available for more than 170 million American users and 7.5 million US businesses that rely on the platform as we continue to work with Vice President (JD) Vance's office.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759731",
            "pub_date": "2025-06-20 09:31:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU increasingly resigned to 10% baseline tariff in US trade talks, European sources say",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BRUSSELS (June 19): European officials are increasingly resigned to a 10% rate on \"reciprocal\" tariffs being the baseline in any trade deal between the United States and the European Union, five sources familiar with the negotiations said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>President Donald Trump has announced wide-ranging tariffs on trade partners and wants to reduce the US goods trade deficit with the EU. US Commerce Secretary Howard Lutnick has ruled out going below a 10% baseline rate for the so-called reciprocal tariffs that cover most goods the EU exports to the US.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>EU negotiators are still pressing for the rate to be lower than 10%, said the European sources, who spoke on condition of anonymity because of the sensitivity of the talks.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But one of the sources, an EU official, said negotiating the level down had become harder since the US started drawing revenues from its global tariffs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"10% is a sticky issue. We are pressing them but now they are getting revenues,\" said the official.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A second European source said there had been no acceptance by the EU of 10% as the baseline rate at talks, but acknowledged that it would be difficult to change or abolish that baseline.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A spokesperson for the European Commission, the EU's executive body which negotiates trade deals for the 27-nation bloc, did not respond to a Reuters request for comment. The US government also did not immediately comment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US officials have long worked on the assumption that America will end up with higher tariffs with its trading partners and do not expect to move away from the 10% tariff rate in talks with the EU.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US Treasury Secretary Scott Bessent told the \"Pod Force One\" podcast in an interview broadcast Wednesday that Trump’s decision to double tariffs had spurred greater willingness on the part of European leaders to negotiate.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The EU has said publicly it will not settle for a double-digit baseline rate — as did Britain, which agreed a limited trade deal in May that retains 10% tariffs on British exports while cutting higher rates for steel and cars.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump has hit Europe with a 50% tariff on steel and aluminium and a 25% levy on cars, and the EU is trying to secure a deal before July 9, when reciprocal tariffs on most other goods could rise from 10% to up to 50%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>With an annual trade surplus of US$236 billion with the U.S. in 2024, the EU has more to lose from tariffs than non-EU member Britain, which runs a trade deficit with the U.S.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump, who has said he wants to use tariff revenues to help finance his sweeping tax-cut and spending bill, said on Tuesday the EU was not offering a fair deal.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Washington has sought to fold non-tariff barriers, such as digital services taxes and corporate sustainability reporting rules, as well as LNG sales and food standards into the talks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US posted a US$258-billion budget surplus for April, up 23% from a year earlier, and the Treasury Department said net customs duties in April more than doubled versus the same period last year.</p></div>\n<h3>Tariff impact</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The sweeping tariffs imposed by Trump since early April and the subsequent pauses on some of them have generated upheaval for companies worldwide, causing some to withdraw or refrain from giving financial guidance.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European automakers have been hit hard. Mercedes pulled its earnings guidance, Stellantis suspended its guidance and Volvo Cars withdrew its earnings forecasts for the next two years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One European car executive said premium carmakers could stomach a 10% tariff but that it would be much tougher for a mass-market producer.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The tariffs targeting steel and aluminium, and cars and car parts, were applied on grounds of national security, with investigations into pharmaceuticals, semiconductors, timber and trucks possibly leading to further increased duties. EU officials say they are not willing to accept these.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump said on Tuesday that pharma tariffs were \"coming very soon\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A pharma industry source said the European Commission was resisting sector-specific tariffs. The Commission has told the pharma industry that while it does not want the 10% baseline reciprocal tariffs, accepting a 10% base tariff may provide leverage in those negotiations, the source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A European beverage industry source said the wine and spirits sector would rather have a deal at 10% than protracted negotiations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Not securing a deal would have a \"huge negative impact... on our market,\" said Rob van Gils, CEO of Austrian company Hammerer Aluminium Industries. \"It can be 0 it can be 10%. If it’s both ways that’s all manageable. It will not kill business.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One EU official said a 10% baseline rate would \"not massively erode competitive positions, especially if others receive the same treatment.\" </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759728",
            "pub_date": "2025-06-20 09:11:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MSM, Malakoff, Astro, Cuckoo International, Oriental Kopi, Bank Islam, Ivory Properties, Petron Malaysia, Deleum, Advancecon, CTOS Digital, Infomina, Theta Edge, Agmo",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Here is a brief recap of Thursday’s top local business news and corporate announcements:</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>MSM Malaysia Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5202\" target=\"_blank\">MSM</a>) expects the 5% sales and service tax (SST) on raw sugar to pressure input costs, which could in turn push up prices of refined sugar for industrial buyers. Although the tax only applies to raw sugar and not refined sugar, it would still indirectly push up the cost of production for local refiners, said group chief executive officer Syed Feizal Syed Mohammad. MSM, one of only two sugar refiners in the country, is currently seeking clarification from the government regarding the tax imposed on raw sugar effective July 1. — <a href=\"https://theedgemalaysia.com/node/759646\" target=\"_blank\"><i>MSM flags cost pressures from 5% SST on raw sugar; still in talks with govt on price mechanism</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The country’s second waste-to-energy (WTE) plant, costing RM660 million, will be built in Sungai Udang, Melaka, and is expected to be fully operational by 2029. Housing and Local Government Minister Nga Kor Ming said the Sungai Udang WTE project had undergone an open tender process and would be implemented through a public-private partnership approach between the Ministry of Housing and Local Government (KPKT) and a consortium comprising <b>Malakoff Corporation Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5264\" target=\"_blank\">MALAKOF</a>) and Alam Flora Environmental Solutions Sdn Bhd, based on the build, operate and own model. — <a href=\"https://theedgemalaysia.com/node/759627\" target=\"_blank\"><i>Malaysia's second WTE plant costing RM660m to be built in Sungai Udang, Melaka, says Nga</i></a></p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Astro Malaysia Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/6399\" target=\"_blank\">ASTRO</a>) said it will continue to invest in expanding its content offerings in lower subscription tiers and lowering entry pricing for Astro and its over-the-top platform sooka to grow its customer base, as it reported a 20.8% drop in its first quarter earnings. The group's net profit for the three months ended April 31, 2025 (1QFY2026) dropped to RM13.48 million from RM17.01 million, as revenue fell 9% from RM772.53 million to RM703.09 million. This decline was primarily driven by a 6% drop in television subscription revenue and a 13% fall in advertising revenue. — <a href=\"https://theedgemalaysia.com/node/759699\" target=\"_blank\"><i>Astro to continue to prioritise local content, affordable tiers as 1Q profit drops 21%</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Cuckoo International (MAL) Bhd</b>, which is set to be listed on the Main Market of Bursa Malaysia on June 24, said its net profit for the first quarter ended March 31, 2025 came in at RM27.86 million. Revenue for the quarter was RM296.38 million, said the Malaysian unit of South Korean home-appliance maker Cuckoo Holdings Co. Of the total revenue, 80% or RM237 million was contributed by the Cuckoo-branded segment while the Cuckoo co-created segment accounted for 19.7% or RM58.3 million. — <a href=\"https://theedgemalaysia.com/node/759698\" target=\"_blank\"><i>Cuckoo Malaysia reports RM27.9m 1Q net profit ahead of listing</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Newly listed kopitiam chain operator <b>Oriental Kopi Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0338\" target=\"_blank\">KOPI</a>) has entered into an agreement to acquire the premises it currently rents as its head office and warehousing facility in Puchong, Selangor, for RM23 million. The property comprises a 5,260.8-square-metre leasehold parcel of land with a factory unit erected on it. The vendor is Icon Facade Sdn Bhd, whose shareholders are Heng Ngeng Choo and Siau Fui Chien. — <a href=\"https://theedgemalaysia.com/node/759700\" target=\"_blank\"><i>Oriental Kopi to acquire Puchong HQ and warehouse for RM23 mil</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Bank Islam Malaysia Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5258\" target=\"_blank\">BIMB</a>) has secured a summary judgement against financially distressed <b>Ivory Properties Group Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5175\" target=\"_blank\">IVORY</a>) over unpaid loans totalling RM17.76 million. The High Court granted the judgement under Order 14 of the Rules of Court, allowing the case to be decided without a full trial.  Bank Islam terminated the facilities in October last year and demanded full repayment of the loan within 14 days, which Ivory Properties failed to settle. — <a href=\"https://theedgemalaysia.com/node/759703\" target=\"_blank\"><i>Bank Islam secures summary judgement against Ivory Properties over RM17.76 mil loan</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Petron Malaysia Refining &amp; Marketing Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/3042\" target=\"_blank\">PETRONM</a>) said it has been sued by its former transportation services provider over alleged negligent misrepresentation. The oil and gas company said Konsortium Lord-Saberkat Sdn Bhd is seeking a court declaration of negligent misrepresentation, along with RM135 million in special damages, RM5 million in aggravated damages and RM34 million in restitution. The claim relates to services provided under a transportation agreement between the two parties that expired in November 2013. — <a href=\"https://theedgemalaysia.com/node/759671\" target=\"_blank\"><i>Petron Malaysia sued again by ex-transport provider over alleged misrepresentation</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Deleum Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5132\" target=\"_blank\">DELEUM</a>) has secured a five-year contract from Hess Exploration and Production Malaysia BV for maintenance services and material supply of solar gas turbine generators in the North Malay Basin. The contract, effective June 10, was awarded via its 90%-owned indirect unit, Turboservices Sdn Bhd. While the contract value was not disclosed, it includes the supply of parts, engine exchanges, field services and equipment health management on a reimbursable basis. — <a href=\"https://theedgemalaysia.com/node/759676\" target=\"_blank\"><i>Deleum clinches turbine maintenance contract from Hess</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Advancecon Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5281\" target=\"_blank\">ADVCON</a>) said the group has issued a notice of adjudication to China Communications Construction (ECRL) Sdn Bhd (CCC) over a payment dispute relating to the East Coast Rail Link (ECRL) project. Its wholly-owned subsidiary, Advancecon Infra Sdn Bhd, is seeking RM15.22 million in outstanding payments from CCC, along with interest and other relief. The amount claimed is for subgrade, drainage and culvert works along two stretches of the ECRL for which Advancecon Infra was appointed as sub-contractor in 2020. — <a href=\"https://theedgemalaysia.com/node/759702\" target=\"_blank\"><i>Advancecon initiates adjudication over ECRL project works payment dispute</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Credit information provider<b> CTOS Digital Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5301\" target=\"_blank\">CTOS</a>) has entered into a strategic partnership with <b>Infomina Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0265\" target=\"_blank\">INFOM</a>), one of only four authorised service providers for Suruhanjaya Syarikat Malaysia (SSM) data, to gain access to real-time corporate data. The collaboration will enable CTOS to get direct Application Programming Interface (API) access to SSM data via Infomina’s advanced search platform, allowing real-time integration of company information into CTOS’ credit reporting ecosystem. — <a href=\"https://theedgemalaysia.com/node/759661\" target=\"_blank\"><i>CTOS partners Infomina to gain real-time access to SSM corporate data</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Theta Edge Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/9075\" target=\"_blank\">THETA</a>) is forming a joint venture company (JVCo) with <b>Agmo Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0258\" target=\"_blank\">AGMO</a>) to accelerate the commercialisation of artificial intelligence (AI), blockchain and platform-based services, with an initial emphasis on public sector transformation. The JVCo will be incorporated via Theta Technologies Sdn Bhd and Agmo Capital Sdn Bhd, holding 51% and 49% stakes respectively.  The initial growth strategy will centre around three core pillars: halal traceability intelligence, AI-driven digital health solutions, as well as super analytics and infrastructure dashboards. — <a href=\"https://theedgemalaysia.com/node/759690\" target=\"_blank\"><i>Theta Edge and Agmo form JV to drive AI and blockchain innovation</i></a></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759727",
            "pub_date": "2025-06-20 08:11:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flexidynamic buys loss-making manufacturer of glove formers",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Flexidynamic Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0231\" target=\"_blank\">FLEXI</a>) said on Thursday it is acquiring a loss-making manufacturer of glove formers, Formtech Engineering (M) Sdn Bhd, for RM10.39 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Although Formtech has accumulated losses of RM4.5 million, the acquisition offers long-term value and growth opportunities, as it will expand Flexidynamic’s portfolio and diversify its income streams, the group said in a filing with Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Formtech, which is based in Nilai, Negeri Sembilan, has been loss-making for the past three years, following industry-wide overexpansion in glove production capacity during the Covid-19 pandemic. It recorded a net loss of RM739,000 for the financial year ended Dec 31, 2022 (FY2022), RM8.89 million for FY2023 and RM828,000 for FY2024.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Flexidynamic said Formtech's audited net asset (NA) was RM3.8 million as at end-December 2024. \"Based on this, the purchase consideration of RM10.4 million represents a price to NA ratio of 2.75 times,\" the group noted.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Flexidynamic is acquiring Formtech from HARPS Investment Asia Pte Ltd (a 69.88% stake) and Dietmar Trumm and Valluvan Peramuthu (a 30.12% stake). The purchase will be fully funded through internally generated funds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Flexidynamic’s principal activities involve the provision of design, engineering, installation and commissioning of glove chlorination systems, as well as design and installation of storage tanks and process tanks for the glove manufacturing industry.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The group shall tap into its existing clientele to offer additional products (i.e. glove formers) and is confident to turnaround the financial results of Formtech,” Flexidynamic said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It noted that Formtech has an installed production capacity of 180,000 pieces per month, with a utilisation rate of 30% in the year ended Dec 31, 2024. The excess capacity at its existing glove former manufacturing facility allows Formtech to accommodate any increase in demand without incurring the time and cost of building a new facility. This will also enable Formtech to leverage Flexidynamic’s existing customer network to tap into additional untapped capacity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Moving forward, as both Formtech and Flexidynamic operate in the glove industry with non-overlapping customer bases, this allows for strong synergies and cross-selling opportunities for both companies. The proposed acquisition is expected to ramp up production capacity of both companies by leveraging on its respective existing marketing resources and is expected to improve the financial performance of both companies in future financial years,” said Flexidynamic.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of Flexidynamic rose 9.68% or 1.5 sen to close at 17 sen on Thursday, giving it a market capitalisation of RM46.5 million.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759726",
            "pub_date": "2025-06-20 07:51:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}