{
    "data": [
        {
            "title": "Advancecon initiates adjudication over ECRL project works payment dispute",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Advancecon Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5281\" target=\"_blank\">ADVCON</a>) said the group has issued a notice of adjudication to China Communications Construction (ECRL) Sdn Bhd (CCC) over a payment dispute relating to the East Coast Rail Link (ECRL) project.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a filing with Bursa Malaysia on Thursday, the civil engineering group said its wholly owned subsidiary, Advancecon Infra Sdn Bhd, is seeking RM15.22 million in outstanding payments from CCC, along with interest and other relief.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The amount claimed is for subgrade, drainage and culvert works along two stretches of the ECRL for which Advancecon Infra was appointed as the sub-contractor in 2020.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advancecon said that on March 12, 2025, Advancecon Infra submitted a payment claim for outstanding sums of RM10.17 million and RM5.05 million, but CCC allegedly failed to make any payment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advancecon Infra then served the notice of adjudication issued under the Construction Industry Payment and Adjudication Act 2012 to CCC to refer the dispute arising from the payment claim to adjudication, the group said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Save for Advancecon Infra’s claim and disbursement involved in the adjudication, the company is not expected to have any material financial and operational impact at this point in time,\" Advancecon said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advancecon shares rose half a sen or 2.2% to 23.5 sen on Thursday, giving the group a market capitalisation of RM137.4 million. The stock has declined 9.62% year-to-date.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759702",
            "pub_date": "2025-06-19 21:41:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oriental Kopi to acquire Puchong HQ and warehouse for RM23 mil",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Newly listed kopitiam chain operator Oriental Kopi Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0338\" target=\"_blank\">KOPI</a>) has entered into an agreement to acquire the premises it currently rents as its head office and warehousing facility in Puchong, Selangor, for RM23 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to a bourse filing, Oriental Kopi said further details — including the salient terms of the sale and purchase agreement (SPA), the rationale for the transaction, and associated risks — will be disclosed upon execution of the SPA, which is expected within 21 days from June 2, 2026, or at a later date mutually agreed upon by both parties.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The property comprises a 5,260.8-square-metre leasehold parcel of land with a factory unit erected on it. The vendor is Icon Facade Sdn Bhd, whose shareholders are Heng Ngeng Choo and Siau Fui Chien.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Oriental Kopi said the acquisition is expected to generate cost savings by eliminating rental and logistics expenses, while also mitigating the risk of losing the right to use the property.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares in Oriental Kopi were down three sen or 3.5% at 82 sen, valuing the group at RM1.64 billion. Since its listing on Jan 23 at 44 sen, the stock has gained 86%.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759700",
            "pub_date": "2025-06-19 21:21:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Astro to continue to prioritise local content, affordable tiers as 1Q profit drops 21%",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Astro Malaysia Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/6399\" target=\"_blank\">ASTRO</a>) said it will continue to invest in expanding its content offerings in lower subscription tiers and lowering entry pricing for Astro and its over-the-top platform sooka to grow its customer base, as it reported a 20.8% drop in its first quarter earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It also continues to be focused on increasing intake for its adjacent businesses, such as sooka, Astro Fibre and Studios to tap into broader market segments, and to strengthen local content through signature programmes and movies, in which it has a competitive advantage, while streamlining legacy cost structures to support these initiatives.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"This quarter was a challenging one, for adex (advertising expenditure) in particular, as it was shaped by economic headwinds such as rising input costs, cautious consumer spending, and uncertainty in global trade and tariffs,\" said Astro group chief executive officer Euan Daryl Smith.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The group's net profit for the three months ended April 31, 2025 (1QFY2026) dropped to RM13.48 million from RM17.01 million, as revenue fell 9% from RM772.53 million to RM703.09 million. This decline was primarily driven by a 6% drop in television subscription revenue and a 13% fall in advertising revenue.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The group reported a 4.2% year-on-year (y-o-y) decline in earnings margin, which was mainly attributed to higher content costs, licensing, copyright and royalty fees, staff-related expenses, impairment of receivables, and professional and consultancy fees.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Radio revenue experienced a 27.3% y-o-y decline, falling to RM33 million from RM45.4 million, due to soft consumer sentiment that dampened advertising spend. No dividends were declared for the quarter under review.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But Smith stressed that tough quarters test resilience, and Astro's lies in resilience. \"Our edge is local. Now, 82% of viewing time on Astro is spent on local and vernacular programming, up three percentage points from the last quarter. To meet this demand, we are continuing to produce over 10,000 hours of fresh content annually; from Astro Originals to signature dramas and beloved variety shows,\" Smith said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Getting local content right means they can capture hearts and create leverage, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It gives us negotiating power with content partners and enables us to stretch every ringgit that we spend on content further.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We’re also still extending well beyond the screen; into radio, digital, and on-ground experiences like concerts and festivals. These are uniquely Astro moments that cannot be pirated,\" he said, adding the group is laying the groundwork for stronger performance ahead.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It is also enhancing cross-platform monetisation of its content rights across cinemas, video, and digital platforms through licensing, advertising partnerships, and on-ground engagement initiatives.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Given the challenging environment, the group remained cautious on its outlook, as it monitors business conditions and prioritises cost discipline, while both consumers and businesses adjust to internal reforms and external uncertainties.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Astro shares are currently trading near their all-time low at 17.5 sen, valuing the group at RM913.33 million. Year-to-date, the stock has declined by 22%.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Tan Choe Choe</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759699",
            "pub_date": "2025-06-19 20:51:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MSM on track to sustain profitability in FY2025 despite volatile costs, says management",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): MSM Malaysia Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5202\" target=\"_blank\">MSM</a>) is optimistic about sustaining its profit recovery in the financial year ending Dec 31, 2025 (FY2025) despite volatile input costs, foreign exchange challenges and the impact of dumped imported sugar on margins.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MSM group chief executive officer Syed Feizal Syed Mohammad said the group remains focused on improving operational efficiency and managing costs to support consistent earnings performance after marking a turnaround to profitability in FY2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We believe that we have taken measures in the turnaround that included transformation of MSM itself,” Syed Feizal said.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Moving forward, I believe that the path is made towards consistent performance because we have, for example, enough risk management knowledge. We have instituted certain processes and procedures to manage our input costs,” he said at a post-annual general meeting (AGM) press conference on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A key contributor is its Johor refinery, which has ramped up operational efficiency and is now positioned to handle larger export volumes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Our yield now is about 94% compared to 80% last year. So, all these [including a 50% utilisation factor] will basically drive better profitability from Johor,” MSM group chief operating officer Hasni Ahmad said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, Hasni noted that the current utilisation rate remains about 30% at the Johor plant, which is still below the 40%-45% breakeven level, meaning that more export demand is key to optimising production.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Therefore, the country's largest sugar refiner is targeting to increase its total export volumes to 360,000 tonnes in 2025 — up from about 240,000 tonnes last year — mainly to China and Asean markets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“China is currently sourcing from countries like (South) Korea. So, we believe we can compete against the Koreans because our refining cost is cheaper than theirs, with premium quality sugar,” Syed Faizal said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite MSM’s aim to maintain positive full-year profitability, the company's quarterly earnings could remain volatile.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We would like to have all our quarters to be in a positive position but it depends on the parameters — on the sugar price, utilisation factor, labour costs,” MSM chief financial officer Ab Aziz Ismail said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On dividends, MSM chairman Datuk Syed Hisham Syed Wazir said any payout will depend on the group’s sustained profit improvement.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Perhaps, by the end of 2025, we will be able to see what the results are. We have a dividend policy and we will consider it at a time,” Syed Hisham said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MSM, the sugar arm of FGV Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5222\" target=\"_blank\">FGV</a>), has not announced any distribution since FY2022.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>After two years of net losses, MSM returned to black with a net profit of RM31.25 million in FY2024, compared to a net loss of RM49.88 million in FY2023.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, in the first quarter ended March 31, 2025 (1QFY2025), MSM's net profit fell by 91% to RM3.73 million, down from RM41.71 million a year earlier, no thanks to lower margins and reduced capacity utilisation despite a decrease in production costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares in MSM closed down two sen or 1.92% to RM1.02 on Thursday, valuing the group at RM717.04 million. The counter has dropped over 17% year to date.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759646\" target=\"_blank\">MSM flags cost pressures from 5% SST on raw sugar; still in talks with govt on price mechanism</a></i></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759695",
            "pub_date": "2025-06-19 20:41:49",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cuckoo Malaysia reports RM27.9m 1Q net profit ahead of listing",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Cuckoo International (MAL) Bhd, which is set to be listed on the Main Market of Bursa Malaysia on June 24, said its net profit for the first quarter ended March 31, 2025 (1QFY2025) came in at RM27.86 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Revenue for the quarter was RM296.38 million, the Malaysian unit of South Korean home-appliance maker Cuckoo Holdings Co said in a bourse filing on Thursday (June 19).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>There are no comparative figures as this is Cuckoo Malaysia’s first interim financial report ahead of its listing.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Cuckoo Malaysia said 80% or RM237 million of the company's revenue was contributed by the Cuckoo-branded segment, while the Cuckoo co-created segment contributed 19.7% or RM58.3 million</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Cuckoo Malaysia's chief executive officer Hoe Kian Choon said the company's performance in 1QFY2025 underscores the effectiveness of its business model, the strength of its brand presence, and the success of its omni-channel distribution strategy across both Malaysia and Singapore.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We are operating in a highly conducive environment for growth, with the number of households increasing at a faster rate than the population — a trend that directly supports demand for home appliances and wellness solutions,\" said Hoe in a statement. \"At the same time, rising household debt is driving a shift in consumer preference toward rental options, which aligns strongly with our resilient rental business model.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“To capture this demand, we will strategically allocate capital to fund our expansion. This includes expanding our product SKUs (stock keeping units) and home care service offerings while strengthening our distribution network through the introduction of Cuckoo cash-and-carry Brandshops, increased product availability on our e-commerce platforms, and the recruitment of more sales personnel nationwide,” Hoe added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company's IPO consists of an offering of up to 365.36 million shares — including an institutional offering of up to 322.38 million shares to institutional and selected investors, as well as government-approved Bumiputera investors — and a retail offering of 42.98 million shares for eligible employees, contributors to the group’s success and the Malaysian public.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company is expected to raise gross proceeds of RM154.74 million from the new issued shares, based on its revised IPO price of RM1.08, which is 16.3% lower than the initial set price of RM1.29.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The price revision came after Cuckoo Malaysia postponed its planned listing by two months, from April 30 to June 24, citing heightened global market volatility.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The proceeds raised from IPO will be used to fund the expansion of the company's rental business, repayment of bank borrowings, capital expenditure for new Brandshops, IT system upgrades and regional expansion into Singapore.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/758985\" target=\"_blank\">Cuckoo International’s Main Market IPO shares oversubscribed by less than 1.5 times</a><br/>\n<a href=\"https://theedgemalaysia.com/node/749333\" target=\"_blank\">Cuckoo launches Malaysia’s biggest IPO in seven months at RM1.29 per share</a><br/>\n<a href=\"https://theedgemalaysia.com/node/758619\" target=\"_blank\">Cuckoo International lowers IPO price to RM1.08</a><br/>\n<a href=\"https://theedgemalaysia.com/node/747362\" target=\"_blank\">Cuckoo International gets RHB, AmInvestment to back upcoming IPO's retail tranche</a></i></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759698",
            "pub_date": "2025-06-19 20:41:42",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Theta Edge and Agmo form JV to drive AI and blockchain innovation",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Theta Edge Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/9075\" target=\"_blank\">THETA</a>) is forming a joint venture company (JVCo) with Agmo Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0258\" target=\"_blank\">AGMO</a>) to accelerate the commercialisation of artificial intelligence (AI), blockchain, and platform-based services, with an initial emphasis on public sector transformation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The JVCo will be incorporated via Theta Technologies Sdn Bhd and Agmo Capital Sdn Bhd, holding 51% and 49% stakes respectively, according to bourse filings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The initial growth strategy will centre around three core pillars: halal traceability intelligence, AI-driven digital health solutions, as well as super analytics and infrastructure dashboards.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to a press statement, the JVCo will serve as the execution arm for Theta Edge’s proprietary AI suite, ThetaNeuron, enabling rapid deployment of AI-powered applications across digital health, halal traceability and smart analytics.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It will also leverage Agmo’s ready-to-market technologies, including generative AI chatbots, e-invoicing middleware, localised large language models, telehealth platforms, and blockchain-based verification tools.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Theta Edge group managing director and chief executive officer Datuk Nuraslina Zainal Abidin said the venture marks the beginning of a new chapter for the company, anchored on platform monetisation and industry-focused AI innovation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>By combining Agmo’s agile development capabilities with Theta’s domain expertise, the JVCo aims to drive transformative outcomes across financial services, healthcare, halal trade, smart logistics, and the public sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Agmo CEO Tan Aik Keong noted that the collaboration enables his company to extend its scalable technologies into regulated environments, prioritising service efficiency and accessibility, with the goal of delivering secure, future-ready systems tailored to rapidly digitising sectors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At Thursday’s close, Theta Edge shares fell four sen or 4.1% to 94 sen, translating to a market capitalisation of RM110.89 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Agmo’s stock price declined one sen or 2.2% to 44 sen, valuing the group at RM143 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Year-to-date, Theta Edge has dropped 34.3%, while Agmo is down 14.6%.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759690",
            "pub_date": "2025-06-19 20:21:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Op Hazard 2.0: IRB to probe financial records of 57 raided e-waste premises",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): The Inland Revenue Board (IRB) will scrutinise the financial records of 57 premises raided during the integrated Op Hazard 2.0 operation, launched on June 16 to crack down on the illegal processing of electrical and electronic waste (e-waste).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>IRB deputy chief executive officer (Compliance) Datuk Hisham Rusli said preliminary investigations discovered that the illegal e-waste processing factories had collectively evaded taxes exceeding RM500 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Based on current information, several of the premises appear to be operated by the same owner, and we are investigating this further,” he said at a joint press conference with the director of the Bukit Aman Internal Security and Public Order Department (JKDNKA) on Thursday.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hisham said that from a taxation standpoint, illegal factories typically either fail to report their income or declare figures significantly lower than their actual earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We will thoroughly examine their financial records. What we’ve discovered is that these e-waste processing products are often re-exported at prices many times higher than their original value,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A total of 57 premises involved in the illegal processing of electrical and electronic waste (e-waste) were raided nationwide during the three-day integrated Op Hazard 2.0 operation, with total seizures estimated at RM500 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The breakdown of the seizures during the operation includes RM240 million worth of e-waste, RM182 million in e-waste components, and RM50 million in worn-out goods. Additionally, items linked to other offences were valued at RM32 million. The value of tax-related investigations stemming from the raids is estimated at approximately RM500 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p> </p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759685",
            "pub_date": "2025-06-19 20:11:58",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Air India warned for flying Airbus planes with unchecked escape slides",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>NEW DELHI (June 19): India's aviation regulator has warned Air India for breaching safety rules after three of its Airbus planes flew despite being overdue checks on emergency equipment, and for being slow to address the issue, government documents show.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The warning notices and an investigation report — both reviewed by <i>Reuters</i> — were not in any way related to last week's crash of an Air India Boeing 787-8 plane that killed all but one of the 242 people onboard, and were sent days before that incident.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the report, the Directorate General of Civil Aviation said spot checks in May on three Air India Airbus planes found that they were operated despite mandatory inspections being overdue on the \"critical emergency equipment\" of escape slides.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In one case, the watchdog found that the inspection of an Airbus A320 jet was delayed by more than a month before being carried out on May 15. AirNav Radar data shows that during the delay the plane flew to international destinations such as Dubai, Riyadh and Jeddah.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Another case, involving an Airbus A319 used on domestic routes, showed checks were over three months late, while a third showed an inspection was two days late.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The above cases indicate that aircraft were operated with expired or unverified emergency equipment, which is a violation of standard airworthiness and safety requirements,\" the DGCA report said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Air India \"failed to submit timely compliance responses\" to deficiencies raised by the DGCA, \"further evidencing weak procedural control and oversight,\" it added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Air India, which was taken over by the Tata Group in 2022 from the government, said in statement that it was \"accelerating\" verification of all maintenance records, including dates of the escape slides, and would complete the process in the coming days.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In one of the cases, Air India said, the issue came to light when an engineer from AI Engineering Services \"inadvertently deployed an escape slide during maintenance\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The DGCA and Airbus did not respond to <i>Reuters</i> queries.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Checks on escape slides are \"a very serious issue. In case of accident, if they don't open, it can lead to serious injuries,\" said Vibhuti Singh, a former legal expert at the government's Aircraft Accident Investigation Bureau.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The DGCA said in its report that the certificates of airworthiness for aircraft that miss mandatory checks were \"deemed suspended\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The warning notices and the report were sent by Animesh Garg, a deputy director of airworthiness in the Indian government, to Air India CEO Campbell Wilson as well as the airline's continuing airworthiness manager, quality manager and head of planning, the documents showed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>An Indian aviation lawyer said such breaches typically attract monetary and civil penalties on both individual executives and the airline.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wilson told <i>Reuters</i> last year that global parts shortages were affecting most airlines, but the problem was \"more acute\" for Air India as its \"product is obviously a lot more dated\", with many planes not refreshed since they were delivered in 2010-2011.</p></div>\n<h3>'Systemic control failure'</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Indian regulator, like many abroad, often fines airlines for compliance lapses. India's junior aviation minister in February told parliament that authorities had warned or fined airlines in 23 instances for safety violations last year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Around half of them — 12 — involved Air India and Air India Express, including in one case for \"unauthorised entry into cockpit\". The biggest fine was US$127,000 (RM541,147) on Air India for \"insufficient oxygen on board\" during a flight to San Francisco.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Last week's crash, the causes of which are still being investigated, will further challenge Air India's attempts to rebuild its image, after years of criticism from travellers for poor service.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Air India's chairman N Chandrasekaran on Monday told staff the crash should be a catalyst to build a safer airline, urging employees to stay resolute amid any criticism.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In its report, the DGCA also said several Air India aircraft checked by officials had outdated registration paperwork. Air India told <i>Reuters</i> all but one aircraft complied with such requirements and this \"poses no impact\" to safety.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The DGCA investigation report pulled up the airline for what it described as \"inadequate internal oversight.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Despite prior notifications and identified deficiencies, the organisation’s internal quality and planning departments failed to implement effective corrective action, indicating systemic control failure,\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759687",
            "pub_date": "2025-06-19 20:11:51",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wilmar woes weigh on PPB, stock hits 16-year low",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Shares of PPB Group Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/4065\" target=\"_blank\">PPB</a>) fell below the RM10 mark on Thursday — a level last seen more than 16 years ago, on April 10, 2009.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The agrifood conglomerate has fallen for three consecutive trading days after news emerged that its 18.8%-owned associate, Wilmar International Ltd, has placed a US$729 million (RM3.1 billion) security deposit with Indonesia’s Attorney General Office amid corruption charges. The deposit is pending a ruling by the Supreme Court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the past three trading days, PPB shares dropped 9.2%, or RM1.01, to RM9.97, bringing the group’s market capitalisation to RM14.18 billion. Year-to-date, the stock has declined 19.6%.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Total volume over the three-day period reached 2.243 million shares, averaging 747,800 shares per day — slightly above the 200-day moving average of 545,682 shares.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Wilmar declined 11 cents, or 3.6%, over the same period to S$2.91 (RM9.63), valuing the Singapore-listed firm at S$18.6 billion. It has declined 6.1% year-to-date.</p></div>\n<div class=\"mt-3 imgw-300 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/pbb-share-price_20250619191235.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/pbb-share-price_20250619191235.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to <em>Bloomberg</em>, PPB’s average target price from five analysts has been revised down to RM12.18 from RM13.30, primarily due to a downgrade by Kenanga Research. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The firm cut its target price to RM10.50 from RM15, citing a higher risk premium, and lowered its rating from ‘outperform’ to ‘market perform’. Currently, the stock carries three ‘hold’ calls and two ‘buy’ calls.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kenanga Research observed that the development could raise the group’s risk premium and weigh on the stock for as long as the matter remains unresolved, especially given that Indonesia accounts for approximately 10% of its business operations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The research house also highlighted that the US$729 million security deposit will be forfeited if the Supreme Court rules against Wilmar, but refunded if the court upholds the earlier decision by the Central Jakarta Court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kenanga estimated PPB’s share of the deposit would be about RM600 million or 42 sen per share. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As of end-March 2025, PPB held total cash of RM1.761 billion, compared to total borrowings of RM305.16 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wilmar remains PPB’s key profit contributor. In FY2024, Wilmar contributed RM992 million to PPB’s total profit before tax of RM1.33 billion.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a statement to the Singapore Exchange (SGX) on April 14, Wilmar stated that, to its knowledge, the investigations had not implicated the group or any of its employees. The company also affirmed its willingness to cooperate with authorities if required.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wilmar added that it does not believe it is guilty of the charges, explaining that its actions at the time were intended to assist the government in improving domestic availability and lowering prices.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also: <br/>\n<a href=\"https://theedgemalaysia.com/node/759398\" target=\"_blank\">PPB faces higher risk premium after Wilmar's US$729m deposit in Indonesia case</a></em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759683",
            "pub_date": "2025-06-19 20:01:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tax expansion vital to ensure fiscal sustainability — PMO",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): The country’s revenue generation remains limited, and tax expansion is necessary to ensure fiscal sustainability, according to the Prime Minister’s Office (PMO).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Senior press secretary to the prime minister, Tunku Nashrul Abaidah, said that Malaysia is among the countries with the lowest tax-to-gross domestic product (GDP) ratios in the world, at about 12%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tunku Nashrul emphasised that the government’s core principle is clear — the burden will not fall on the majority of the people. Instead, tax revenue will be reinvested into programmes that benefit the people.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Among these are the RM13 billion allocated for the Rahmah Cash Contribution (STR) and Sumbangan Asas Rahmah (Sara), benefiting nine million recipients.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He also said that RM400 million has been allocated to refurbish dilapidated clinics, and over RM600 million to repair more than 8,000 school toilets, benefiting over five million students. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This is the true foundation of every Madani government policy, to improve the people’s quality of life through responsible and comprehensive measures,” he said during the PMO briefing, which was streamed live on Anwar Ibrahim’s Facebook page and the PMO Malaysia Facebook page on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On June 9, the government announced a targeted review of the sales tax rate and an expansion of the service tax scope, both of which will take effect from July 1.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The sales tax rate remains unchanged for esential goods, while a five or 10% rate will be imposed on selected items.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, the scope of the service tax will be expanded to include six new services: leasing or rental, construction, finance, private healthcare, education, and beauty services.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Treasury secretary-general Datuk Johan Mahmood Merican reportedly said that revenue from the Sales and Service Tax (SST) collection is expected to increase by RM5 billion in 2025 and by RM10 billion in 2026, following the implementation of the SST revised and expanded scope starting next month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p> </p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759681",
            "pub_date": "2025-06-19 19:51:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global IPO activity slumps in 2025 as tariffs, volatility weigh",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Global equity IPOs have plunged this year, weighed down by heightened business uncertainty from US tariffs, elevated market volatility and higher interest rates that have raised funding costs and made listings less appealing for issuers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to LSEG data, as of June 17, global IPO volume has declined about 9.3% year-on-year to US$44.3 billion, the lowest level in nine years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US IPO volumes dropped 12% to US$12.3 billion, while Europe saw a sharper 64% decline to US$5.8 billion. In contrast, Asia-Pacific IPO volumes have risen 28% to US$16.8 billion so far this year.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>President Donald Trump's tariffs, which included a 10% blanket levy plus targeted duties on US trading partners, re-ignited tensions in April. Despite his subsequent pause and negotiations on trade and tariffs, businesses globally are uncertain about demand and investment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It’s not prudent for companies to go public right now. The volatility in the market is unprecedented,\" said Isabelle Freidheim, founder and managing partner at Athena Capital.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"There’s real risk for tech companies that are still figuring out profitability. If the stock drops after the IPO, it’s very hard to recover, especially for companies with less steady cash flow or that aren’t as mature.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite the broader slowdown, China and Japan have seen a sharp pickup in listings, driven by regulatory easing and improved sentiment. A standout was Chinese battery giant CATL, which raised US$4.6 billion in the world’s largest IPO so far this year, boosted by renewed market momentum following the US tariff truce.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At the same time, some analysts are cautiously optimistic about a second-half recovery. US IPO interest is showing signs of a rebound, led by fintech firm Chime, which surged on its debut. High-profile names such as Klarna, Gemini and Cerebras are slated to list later this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"With US, European defence contractors and Indian consumer names also filing, late-2025 could deliver a textbook “trickle-then-torrent” if volatility behaves,\" said Michael Ashley Schulman, chief investment officer at Running Point Capital Advisors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759680",
            "pub_date": "2025-06-19 19:41:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "'Duta enclave' land dispute: Govt valuer further explains how she went about evaluation",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): A government property valuation expert continued to testify on Thursday on how her valuation methods differed from the private valuer’s, over the long-standing \"Duta enclave\" land dispute.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Halimatul Saeidah Abd Ghani, 49, said that although she agreed that some plots of land in Mont Kiara and Kenny Hills were comparable property to the ‘Duta enclave’, she did not use them in her valuation as those plots contained tiny bungalows.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The real estate in question is agricultural land with the potential to be residential land, and is not the right comparison with the plots containing the small bungalows,\" she said on Thursday.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Halimatul said this during re-examination by senior federal counsel Mohammad Al-Saifi Hashim. She is taking the stand as part of court proceedings on assessing \"mesne profits\" that are to be paid out to the liquidators of Semantan Estate (1952) Sdn Bhd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>She added that she did use residential land comparison, which differed from the plaintiff's valuation. She said she considered large tracts of land converted into residential land, as opposed to the plaintiff's valuation, which was comparisons to bungalows in land which was already subdivided into smaller lots.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It is the government's stance that their valuation of mesne profits is RM289.846 million, a mere fraction compared to the maximum RM13.242 billion valuation by Semantan Estate’s appointed valuer.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mesne profits are “the rents and profits which a trespasser has, or might have, received or made during his occupation of the premises, and which therefore he must pay to the true owner as compensation for the tort which he has committed”, according to Jowitt’s Dictionary of English Law.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Previously, Halimatul had testified that she used the Decapitalisation of Market Value method, and said that the private valuer's reliance on year-to-year valuation to get the value of the land was not accurate as it was based on assumptions.  </p></div>\n<h3>Trial to continue in July</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The trial is slated to continue on July 9 and 10, with a second government valuer taking the stand.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The 263.27 acres were acquired by the government in 1956 to be transformed into what they called “the Duta enclave”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Currently, it houses government buildings that include the Tun Razak hockey stadium, the Malaysian Institute of Integrity, the National Archives, the Kuala Lumpur Syariah Court, the government complex building along Jalan Duta (the Inland Revenue Board building), the Malaysian Anti-Corruption Commission Academy, as well as the flyover and a section of Jalan Duta (now Jalan Tuanku Abdul Halim) heading towards Segambut, and possibly portions of the Federal Territory mosque.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The land was acquired by the government in 1956 for the price of RM1.32 million under the then-Land Acquisition Enactment, for the purpose of developing a diplomatic (Duta) enclave.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In 2009, the High Court ruled that the government had trespassed on the land, and in 2012, this decision was upheld by the Court of Appeal and the Federal Court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In November 2018, a Federal Court bench, led by then-Court of Appeal president Tan Sri Ahmad Maarop, dismissed the Malaysian government’s application to review the 2012 decision, resulting in that judgement remaining intact.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Semantan Estate claimed it had retained its beneficial interest in the land in Mukim Batu, which it alleged the government had taken unlawful possession of, and that the government should pay the company mesne profits as damages for trespassing, with the said damages to be assessed by the court.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759354\" target=\"_blank\">Govt valuer disagrees with Semantan Estate’s private valuation</a><br/>\n<a href=\"https://theedgemalaysia.com/node/683295\" target=\"_blank\">Federal counsel offers seven reasons why compensation in decades-long Jalan Duta land dispute should be only RM290 mil, not billions</a><br/>\n<a href=\"https://theedgemalaysia.com/article/costly-53-year-old-land-tussle\" target=\"_blank\">A costly 53-year-old land tussle</a><br/>\n<a href=\"https://theedgemalaysia.com/node/721994\" target=\"_blank\">Semantan Estate decision: What happens to the Duta enclave now?</a></em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Aniza Damis</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759678",
            "pub_date": "2025-06-19 19:31:41",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deleum clinches turbine maintenance contract from Hess",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Deleum Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5132\" target=\"_blank\">DELEUM</a>) announced it has been awarded a five-year contract by Hess Exploration and Production Malaysia BV.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The contract, which was secured via its 90%-owned indirect subsidiary Turboservices Sdn Bhd and began on June 10, involves providing maintenance services and supplying materials for solar gas turbine generators in the North Malay Basin. The value of the contract was not disclosed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the agreement, Turboservices Sdn Bhd will supply service parts, provide field service call-outs, exchange engines, manage equipment health, and offer other maintenance services for the solar gas turbines as needed, on a reimbursable cost basis.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Deleum’s shares closed unchanged at RM1.63 on Thursday, giving the group a market capitalisation of RM654.53 million. The stock has climbed 23 sen or 16.43% year to date.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Tan Choe Choe</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759676",
            "pub_date": "2025-06-19 19:21:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Technology alone won’t save you - it takes vision and execution",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"ceonothumb mx-auto pb-5\">\n<div>\n<div class=\"iframe-w100-wrapper\"></div>\n</div>\n</div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Read more in the June 23 edition of The Edge Malaysia Weekly. Pick up from the newsstands or subscribe at https://theedgemalaysia.com/subscription</p></div>\n<!----- =================== Related Start HERE =================== ---->\n<div class=\"related-news-container\"><span class=\"related-news\">More Issues</span>\n<div id=\"related-news\"> </div>\n</div>\n<link href=\"//advertisement2.bizedge.com/www/images/ads/ad-scripts/related-article.css?=cachev1\" rel=\"stylesheet\" type=\"text/css\"/>\n\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759673",
            "pub_date": "2025-06-19 19:11:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thai stocks decline to five-year low on political upheaval",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Thailand’s equity benchmark index closed at its lowest level since March 2020, after the government’s second-largest party quit the ruling coalition, piling further pressure on Prime Minister Paetongtarn Shinawatra.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Stock Exchange of Thailand Index fell 2.4%, marking its longest losing streak since February in a sixth straight day of decline. The gauge has plunged nearly 24% this year, making it the worst performer among the world’s major markets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The market sees knee-jerk selling on the back of rising political uncertainty, though the underlying developments actually point toward greater clarity ahead,” said Bob Tachasirinugune, head of Thailand equities at Citigroup Inc. “A reset would break the political deadlock that has paralyzed policymaking for over a year.”</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Thailand’s stock market has faced a series of headwinds this year, with slower economic growth, looming US tariffs and elevated household debt among the concerns curbing sentiment. Global funds have already dumped a net US$2.3 billion (RM9.8 billion) of Thai stocks in 2025, according to data compiled by <i>Bloomberg</i>.</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/434847472_20250619184135.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/434847472_20250619184135.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Thai baht fell for a fifth session against the dollar and on track for its longest losing streak in more than seven weeks amid the rising political uncertainty. The currency was trading 0.4% weaker against the greenback.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“As with other cases in Thai political history, there will be a good buying opportunity,” said Alan Richardson, a senior portfolio manager at Samsung Asset Management Co. “Eventually a new government will be formed and the market will recover.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759588\" target=\"_blank\">Thai ruling coalition hanging by a thread with PM under mounting pressure</a><br/>\n<a href=\"https://theedgemalaysia.com/node/759530\" target=\"_blank\">Big blow for Thailand's PM as major party exits coalition</a></em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Magessan Varatharaja</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759603",
            "pub_date": "2025-06-19 19:11:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Petron Malaysia sued again by ex-transport provider over alleged misrepresentation",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Petron Malaysia Refining &amp; Marketing Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/3042\" target=\"_blank\">PETRONM</a>) said it has been sued by its former transportation services provider over alleged negligent misrepresentation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The oil and gas company said Konsortium Lord-Saberkat Sdn Bhd (Lord Saberkat) is seeking a court declaration of negligent misrepresentation, along with RM135 million in special damages, RM5 million in aggravated damages and RM34 million in restitution.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The claim relates to services provided under a transportation agreement between the two parties that expired in November 2013, said Petron Malaysia in a filing with Bursa Malaysia on Thursday.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This marks the second time Lord Saberkat has pursued legal action against Petron Malaysia in relation to the same agreement. In 2018, the company filed a suit seeking RM109.18 million in damages, as well as general damages, interest and costs, over an alleged breach of contract.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, that suit was struck out by the Kuala Lumpur High Court, and Lord Saberkat’s subsequent appeal to the Federal Court was also dismissed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Addressing the latest legal challenge, Petron Malaysia said it believes that Lord Saberkat’s claims have no legal basis and denies any allegation of negligent misrepresentation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company said it has appointed external legal counsel and intends to defend its position.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Petron Malaysia does not expect the suit to have any material impact on its financial position or operations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of Petron Malaysia closed one sen or 0.3% lower at RM3.89 on Thursday, valuing the company at RM1.05 billion.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/article/petron-gets-court-strike-out-rm109-mil-suit-konsortium-lordsaberkat\" target=\"_blank\">Petron gets court to strike out RM109 mil suit by Konsortium Lord-Saberkat</a></i></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759671",
            "pub_date": "2025-06-19 19:01:44",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Luxury firms tackle slowdown with cheaper accessories, Bain says",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 19): Luxury brands are putting out more affordable and smaller accessories as they seek to generate store traffic to counter slowing demand, a new report shows. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The trend comes after companies faced a consumer backlash over steep price hikes in recent years. Up to a quarter of luxury brands are embracing this strategy to keep shoppers visiting their stores, according to Claudia D’Arpizio, a partner at Bain &amp; Co, which issued the report Thursday. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“They understood that they needed to recalibrate,” she said in an interview. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While it’s harder to introduce more affordable products in categories such as leather goods, shoes and ready-to-wear, some labels are finding ways around it, notably by using textiles.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>LVMH’s Loewe, known for leather bags that can cost €5,200 (US$5,980 or RM25,399), is currently offering a drawstring pouch bag in a sponge-like cloth for €280, for instance.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Brands are also introducing new products in cheaper categories such as costume jewellery, eyewear and beauty in a bid to attract younger customers especially, according to D’Arpizio.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The shift comes after luxury product prices grew as much as 12% on average annually between 2022 and the first half of last year, which turned away many shoppers. The personal luxury-goods industry, worth €364 billion, lost 50 million customers in 2023 and 2024, Bain estimated last year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The sector will shrink between 2% and 5% this year after showing no change last year, according to the most likely scenario highlighted in Bain’s latest report. That’s set to be the worst performance since the 2009 global financial crisis if the pandemic is excluded. What’s more, China was growing then and it no longer is, D’Arpizio added. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Separately, she described the surprise appointment of carmaker Renault SA’s Luca de Meo as chief executive of Gucci owner Kering SA as a “good move” in an industry that tends to operate in a closed circuit. Auto and luxury face similar challenges, with slowing growth and pressure on margins, she added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759667",
            "pub_date": "2025-06-19 18:51:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thailand central bank approves country's first virtual banks",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BANGKOK (June 19): Thailand has approved virtual banking licences to three groups led by SCB X, Krung Thai Bank and ACM Holding, the central bank said on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The virtual banks shall start business operations within one year from the date of approval, the central bank said in a statement. Virtual banks are banks that operate only online, with no physical branches.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759669",
            "pub_date": "2025-06-19 18:51:23",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CTOS partners Infomina to gain real-time access to SSM corporate data",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Credit information provider CTOS Digital Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5301\" target=\"_blank\">CTOS</a>) has entered into a strategic partnership with Infomina Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0265\" target=\"_blank\">INFOM</a>), one of only four authorised service providers for Suruhanjaya Syarikat Malaysia (SSM) data, to gain access to real-time corporate data.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The collaboration will enable CTOS to get direct Application Programming Interface (API) access to SSM data via Infomina’s advanced search platform, allowing real-time integration of company information into CTOS’ credit reporting ecosystem, according to a joint statement from both companies.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the agreement, Infomina will provide seamless access to corporate and business information, supporting not only credit assessments but also broader data-driven applications. The partnership is also expected to pave the way for product enhancements powered by analytics and AI from both companies.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“By offering direct API integration, we are enabling more businesses to access real-time SSM data efficiently and affordably,” said Infomina Bhd chief executive officer (CEO) and managing director Yee Chee Meng.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company added that it aims to foster similar collaborations in the fintech and corporate services sectors to further expand use and accessibility of SSM data.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>CTOS interim group CEO Kevin Loh reaffirmed the company’s commitment to empowering businesses with the insights needed to make informed decisions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“By working closely with partners like Infomina Berhad, we enhance our clients’ ability to access data, assess creditworthiness and reduce risk — ultimately helping them grow amidst a dynamic business landscape,” Loh said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At the time of writing, shares in Infomina were down half a sen at 72 sen, valuing the company at RM426.95 million. CTOS’ shares were down one sen or 1.06% at 93 sen, giving it a market capitalisation of RM2.14 billion.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Tan Choe Choe</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759661",
            "pub_date": "2025-06-19 18:41:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FBM KLCI down 0.7% to 1,501.44 on June 19, 2025",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): Below is a summary of how key Bursa Malaysia indices and the ringgit performed on Thursday:</p></div>\n<div class=\"pb-5 imgw-800 mx-auto d-block\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/full-market-closing-web-june19-2025_20250619175850.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/full-market-closing-web-june19-2025_20250619175850.jpg\"/></a></div>\n<div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div></div></div>",
            "link": "https://theedgemalaysia.com/node/759662",
            "pub_date": "2025-06-19 18:41:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}