{
    "data": [
        {
            "title": "Tesla set to open India showrooms in July with made-in-China EVs — Bloomberg",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Tesla Inc is set to open its first showrooms in India in July, people familiar with the discussions said, kicking off formal operations in the world’s third-biggest automobile market as the Elon Musk-led firm hunts for growth amid falling sales in Europe and China.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The electric vehicle giant’s first set of cars have arrived in the country — Model Y rear-wheel drive SUVs shipped from Tesla’s China factory, according to the people, who asked not to be identified as the information is private, as well as documents seen by <i>Bloomberg New</i>s. The Model Y is the world’s largest selling electric car.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla is set to open its first showroom in Mumbai as early as mid-July, which will be followed by one in New Delhi, according to the people. It has also imported Supercharger components, car accessories, merchandise and spares from the US, China and the Netherlands, the documents show.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The debut will end a years-long on-again, off-again saga over Tesla’s entry into India — a market Musk has long eyed but held back from entering due to disagreements over tariffs and local manufacturing. The breakthrough in bringing Tesla to India comes after Musk met Indian Prime Minister Narendra Modi in the US in February. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Bloomberg News</i> reported in February that Tesla was set to ship a few thousand cars to a port near Mumbai.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla spokespersons did not immediately respond to an email seeking comment on opening of the India showrooms and the preparations underway. </p></div>\n<h3>Premium price</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Five Model Y vehicles have already arrived in Mumbai from Tesla’s Shanghai factory, according to documents reviewed by <i>Bloomberg News</i>. The cars were declared at 2.77 million rupees (US$31,988 or RM136,205) and attracted more than 2.1 million rupees in import duties — a levy that’s consistent with India’s 70% tariff on fully-built imported cars under US$40,000 plus surcharges, the documents show.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The model is expected to go on sale for more than US$56,000 before taxes and insurance, though Tesla will determine the final sticker price based on its margin and positioning strategy, according to people familiar with the plans.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That compares with an ex-showroom price of US$44,990 for the same model in the US, which sells for US$37,490 once tax credits are applied.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The premium price tag will likely be a major hurdle to Tesla’s plans as the automaker will need to convince value-driven consumers to open their wallets. EVs account for just over 5% of new passenger vehicle sales in India, but premium cars still represent less than 2% of the market, data with Indian government’s vehicle registration portal show.</p></div>\n<h3>Beefing up</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company hasn’t appointed a new country head following the departure of Prashanth Menon, but is beefing up hiring across charging, retail and policy teams, according to people familiar with the matter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Model Y imports represent an initial foray into the market and Tesla plans to expand its presence, including offering more models.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It’s leasing warehouse space in Karnataka, in India’s south, and is adding more in Gurugram, outside New Delhi, the people said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla executives from other countries are making weekly visits, the people said, to the Mumbai and New Delhi showrooms, which are in high-profile, luxury business precincts in an effort to attract affluent shoppers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759855",
            "pub_date": "2025-06-20 23:01:33",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ecobuilt CEO Lim Chin Yen resigns after four months",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Ecobuilt Holdings Bhd's (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0059\" target=\"_blank\">ECOHLDS</a>) chief executive officer Lim Chin Yen has resigned after just four and a half months at the helm of the construction company.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a bourse filing on Friday (June 20), the company said Lim, 48, resigned “to dedicate more time to family and pursue personal interest”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Lim is succeeded by Fong Tuck Yong, 52, effective June 20. The company said Fong has more than 30 years of experience in leading and overseeing construction projects.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ecobuilt has been in the red for the past three years. It posted a loss after tax of RM44.5 million in FY2024, RM31.1 million in FY2023 and RM13.6 million in FY2022, according to its annual report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The FY2024 result reflects a 15-month financial period — from June 1, 2023, to Aug 31, 2024 — following a change in the company's financial year-end from May 31 to August 31.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company remained in the red for its latest quarter. It posted a net loss of RM584,000 for the second quarter ended Feb 28, 2025 (2QFY2025) on the back of revenue of RM15.48 million. There is no comparative year-on-year figure due to the change in the company's financial year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company noted that the gross profit generated from ongoing projects during the quarter was insufficient to offset operating expenses, which mainly consisted of depreciation and staff costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ecobuilt’s shares closed up half a sen or 20% to three sen on Friday, bringing the group a market capitalisation of RM13 million. The stock has fallen 54% over the past one year.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759854",
            "pub_date": "2025-06-20 22:51:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vanzo taps Taiwanese market via local distributor, Watsons",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Vanzo Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0333\" target=\"_blank\">VANZO</a>) is making its entry into Taiwan’s fast-moving consumer goods (FMCG) market by appointing Taiwan-based Xishangxi International Marketing Co Ltd (XIMCL) as its exclusive distributor.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a bourse filing on Friday, the air fragrance maker said its wholly-owned subsidiary Vanzo Asia Sdn Bhd (VASB) has signed an agreement with XIMCL to distribute VASB products through both online platforms and physical retail stores via health and beauty retailer Watsons Taiwan.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The two-year agreement takes effect from June 20, 2025, and runs through June 19, 2027. Vanzo products are expected to hit the shelves of some 500 Watsons outlets in Taiwan by September this year.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The agreement will be automatically renewed unless either party provides written notice of its intention not to do so at least three months before the expiration date. It will also be automatically terminated if Watsons places no orders for three consecutive months or if the products are delisted by Watsons.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, under the agreement, VASB reserves the right to authorise XIMCL to expand distribution to additional key retail channels.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"This initiative shall enable VASB to further expand its market presence in Taiwan’s FMCG market through additional key retail channels, including pharmacies, supermarkets, minimarkets and convenience stores,\" the company said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The agreement is expected to contribute positively to the group’s revenue and earnings beginning from the financial year ending Sept 30, 2026 (FY2026). The working capital required under the agreement will be funded through Vanzo’s internally generated funds and resources.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company is principally involved in the design, marketing, and sale of air fragrances and fragrance-related products. Its product range primarily includes car fragrances, indoor fragrances, as well as personal and household care products. To complement these offerings, the company also markets and sells related accessories such as candle tool sets, rechargeable electric lighters and anti-slip car mats.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Since 2022, Vanzo has established several retail kiosks in shopping malls across Kuala Lumpur, Putrajaya, Selangor, Sarawak and Johor. Beyond Malaysia, it has also expanded its geographical footprint to Singapore, Brunei and Australia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At Friday’s close, Vanzo — which was listed on December 17 last year — saw its shares unchanged at 15.5 sen, hovering near its initial public offering (IPO) price of 15 sen, with a market capitalisation of RM72.3 million. The counter has declined 26.19% year to date.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759853",
            "pub_date": "2025-06-20 22:41:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Baltic Exchange shipping updates: June 20, 2025",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><strong>A weekly round-up of tanker and dry bulk market (June 20, 2025)</strong></p></div>\n<div class=\"pb-5 imgw-800 mx-auto d-block\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/BDI-BDI210624190625-20062025_20250620205607.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/BDI-BDI210624190625-20062025_20250620205607.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><strong>This report is produced by the Baltic Exchange.</strong></p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>The Baltic Exchange, a wholly-owned subsidiary of Singapore Exchange, is the world's only independent source of maritime market information for the trading and settlement of physical and derivative contracts.</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Its international community of over 650 members encompasses the majority of world shipping interests and commits to a code of business conduct overseen by the Baltic.</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>For daily freight market reports and assessments, please visit <a href=\"http://www.balticexchange.com/\" target=\"_blank\">www.balticexchange.com</a>.</em></p></div>\n<h3>Capesize</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Capesize market trended downwards this week, with sentiment consistently softening, particularly in the Pacific. C5 rates came under pressure as iron ore volumes from West Australia declined. While coal cargoes from East Australia offered some support, they weren’t enough to offset the broader weakening. C5 rates steadily fell from US$11.00 early in the week to the low-mid US$9.00s by week's end. In the Atlantic, the week began on firmer footing, with limited tonnage and a steady cargo flow sustaining rates. However, as the week progressed, both trans Atlantic and fronthaul routes saw offers ease. On the South Brazil to China (C3) route, a clear pattern of backwardation emerged, with rates slipping from the high US$26.00s to the low US$20.00s. Overall, the week marked a reversal of recent gains, with the BCI 5TC shedding over US$7,000 to settle at US$23,879 by Friday.</p></div>\n<h3>Panamax</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A subdued week for the Panamax sector. Trans-Atlantic trades were few and far between, and a general decline became evident in both grain and mineral demand in the basin. EC South America returned a contrasting week with some mixed rates reported, limited activity overall but P6 index dates appeared well balanced while first-half July arrival dates began the week on a firm footing only to weaken as limited demand pitted against an increased tonnage count undermined any potential upside in rates. Typically, midweek fixtures for index arrival dates hovered between US$11,500 and US$13,000 basis 82,000-dwt types delivery India-SE Asia range. The Asian market continued to ease throughout the week, with support hard to come by as the tonnage count continued to grow, and with limited enquiry ex NoPac mineral demand ex Australia and Indonesia returned insufficient to prevent the slow erosion of rates in the arena. On the period front, there were reports of an 82,000-dwt delivery Taiwan agreeing US$11,000 basis 6/8 months trading.</p></div>\n<h3>Ultramax/Supramax</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A rather positional week overall for the sector. The Atlantic saw better demand, a 58,000-dwt fixed delivery SW Pass for trip to EC Mexico at US$21,000. However, as the week closed this upward pressure seemed to be easing slightly. The South Atlantic remained active, a 63,000-dwt fixing delivery Recalada for a trip China at US$14,000 plus US$400,000 ballast bonus. By contrast the Continent-Mediterranean lacked much impetus and rates remained rather subdued. A rather slow start from the Asian arena although as the week progressed better levels of inquiry were seen from the NoPac and Indonesia. However, with aa good amount of prompt tonnage in the Indian Ocean rates remained in check. From the north, NoPac rounds from China for the 63,000-dwt were around the mid US$12,000s while from the south, a 56,000-dwt fixed a trip from SE Asia to China in the low US$10,000s. The Indian Ocean lacked impetus, a 61,000-dwt fixed a trip from the Arabian Gulf to Australia with steels billets at US$9,500.  </p></div>\n<h3>Handysize</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This week, the market showed varied trends across the regions. In the Continent and Mediterranean, conditions remained soft with limited fresh inquiries. A 32,000-dwt open Tema 20/24 June fixed for a West Africa coastal trip in the mid/high teens. In contrast, the South Atlantic and US Gulf regions maintained robust activity, supported by consistent fresh demand. A 33,000-dwt ballasting from West Africa was fixed delivery Recalada for a trip to the Continent at US$17,500. Meanwhile, a 37,000-dwt was fixed delivery Palm Beach end June via US Gulf redelivery UK-Continent with wood pellets at US$18,000. The Asian markets remained quiet, with reports of longer tonnage list in Southeast Asia and the North Pacific. Despite this, rates stayed largely steady. A 34,000-dwt vessel was fixed on delivery Hong Kong for a Far East redelivery at US$9,000. On the period front, interest remained limited. A 28,000-dwt vessel was reported fixed from delivery Southeast Asia for 4-6 months period at US$9,650.</p></div>\n<h3>Clean</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>LR2</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>LR2’s in the MEG saw the inevitable spike this week. The TC1 75kt MEG/Japan index sailed up 91.95 points to WS211.39. A TC20 90kt MEG/UK-Continent trip also went from US$3.56 million to $5.17 million. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>West of Suez, Mediterranean/East LR2’s also ticked up US$251,000 over the US$3 million mark to US$3.12 million for a TC15 index run.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>LR1</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MEG LR1’s also shot upwards this week. The TC5 55kt MEG/Japan index went from WS142.19 to WS218.13. A voyage west on TC8 65kt MEG/UK-Continent also gained US$1,125,020 to US$3.91 million. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the UK- Continent LR1 freight levels held static for the fifth week in a row. The TC16 60kt ARA/West Africa index crept up 1.81 points to WS115.56.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>MR</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MRs in the MEG also saw their freight spike dramatically this week. The TC17 35kt MEG/East Africa index as a result soared upward by 127.14 points to WS362.14.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>UK-Continent MRs were sedate this week. The TC2 37kt ARA/US-Atlantic coast leaked a few points of value across the week, going from WS132.19 to WS120 where it has settled for the last two days at time of writing. The Baltic Time Charter equivalent round trip, as a result dipped below US$10,000 and currently sits at US$9,134.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>USG MRs had an appreciation of their own this week. The TC14 38kt US-Gulf/UK-Continent trip went from WS112.86 to WS164.29 by Wednesday only to drop back to WS145.71 the following day. A Caribbean run on TC21, 38kt US-Gulf/Caribbean also ultimately was assessed US$100,000 better than the beginning of the week at US$717,857.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The MR Atlantic Triangulation Basket TCE went from US$20,716 to US$24,307 with a stop at US$27,409 mid-week.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Handymax</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Mediterranean Handymax of TC6, 30kt Cross Mediterranean, continued along their current path of WS130 for the second week on week. Up on the UK-Continent the TC23 30kt Cross UK-Continent dipped 16.11 points to WS143.89.    </p></div>\n<h3>VLCC</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Continued tensions and escalation of attacks between Israel and Iran have had a major impact on the VLCC market predominantly in the Middle East due to the increased risk and on the back of this markets elsewhere have been boosted. The rate for the 270,000 mt Middle East Gulf to China trip (TD3C) has shot up at least 22 points, with further gains likely, to WS75.8 corresponding to a round-trip TCE of US$57,758.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the Atlantic market, the rate for 260,000 mt West Africa/China (TD15) has risen 16 points to WS68.81 giving a round voyage TCE of just shy of US$50,000 per day. In the US Gulf region, the rate for the TD22 route of 270,000 mt US Gulf to China climbed US$1,352,500 to US$7,462,500 which shows a daily round trip TCE of US$35,656.</p></div>\n<h3>Suezmax</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Suezmax owners have managed to turn things around and see firmer rates on all the Baltic Exchange routes. The rate for the 130,000 mt Nigeria/UK Continent voyage (TD20) regained 12.5 points to WS89.72 meaning a daily round-trip TCE of US$35,251. The TD27 route (Guyana to UK Continent basis 130,000 mt) has improved a little over 12.5 points to WS86.94 translating to a daily round trip TCE of about US$33,100 basis discharge in Rotterdam. The TD6 route of 135,000 mt CPC/Augusta gained nine points to WS104.1 giving a daily TCE of around US$37,800. In the Middle East, due to the increased tensions and escalation of attacks, the rate for the TD23 route of 140,000 mt Middle East Gulf to the Mediterranean (via the Suez Canal) has increased by 16 points to WS102.5.</p></div>\n<h3>Aframax</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the North Sea market for the 80,000 mt Cross-UK Continent route (TD7) the rate eased two points to the WS120 level giving a daily round-trip TCE of about US$31,700 basis Hound Point to Wilhelmshaven.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the Mediterranean, the rate for 80,000mt Cross-Mediterranean (TD19) is firmer by just over eight points at WS139.44 (basis Ceyhan to Lavera, that shows a daily round trip TCE of a little over US$32,200).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Across the Atlantic, the shorter routes the Baltic Exchange produces has had a yo-yo week with rates climbing on Monday, falling Tuesday, and rising again on Wednesday. Overall, the 70,000 mt East Coast Mexico/US Gulf route (TD26) and the 70,000 mt Covenas/US Gulf route (TD9) has risen about 14-15 points week-on-week to the WS154 level and WS150, respectively. This translates into a daily round-trip TCE of about US$32,500 and US$30,500.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The rate for the trans-Atlantic route of 70,000 mt US Gulf/UK Continent (TD25) similarly ballooned nearly 20 points on Monday and has now steadily shrunk back to WS143.06, an increase of five points overall week-on-week, giving a round trip TCE basis Houston/Rotterdam of a little over US$32,100 per day.</p></div>\n<h3>LNG</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The LNG market surged this week across all major routes, as prompt vessel availability tightened significantly ahead of early July loadings. Gains were led by a spike in Atlantic activity, while the Pacific also posted strong advances amid a limited tonnage list.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the BLNG1 Australia–Japan route, rates jumped US$10,400 for 174k cbm vessels to US$33,000 per day, while 160k cbm ships rose US$8,200 to US$21,000 per day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Atlantic basin routes posted the strongest gains. BLNG2 US Gulf–Continent climbed US$11,500 for 174k cbm units to US$49,300 per day, and US$10,000 for 160k cbm ships, settling at US$26,900 per day. The sharp rise reflects a tightening list and heightened interest in mid-summer coverage.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BLNG3 US Gulf–Japan posted the largest increases of the week, surging US$18,900 to US$60,500 per day for 174k cbm vessels. Smaller 160k cbm units rose US$17,000 to US$36,400 per day, as long-haul demand accelerated.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Time charter markets also firmed. Six-month TC rates added US$300 to reach US$38,750 per day, and one-year rates gained US$500 to US$40,500. Three-year charters held flat at US$56,000 per day.</p></div>\n<h3>LPG</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The LPG market surged across all major routes this week, driven by heightened geopolitical tensions in the Middle East, which sparked a significant jump in freight levels and sharply tightened sentiment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the BLPG1 Ras Tanura–Chiba route, rates jumped by US$8.42 to US$85.83 per tonne, with TCE earnings gaining US$8,356 to US$71,244 per day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The BLPG2 Houston–Flushing route also rallied, with rates climbing US$4.50 to US$70.25 and TCE returns rising US$5,098 to US$74,232 per day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The BLPG3 Houston–Chiba route followed suit, gaining US$4.33 to US$125.67 per tonne. TCE earnings increased US$2,265 to US$53,756 per day, underpinned by healthy trans Pacific demand and tightening positions heading into July.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Overall, the market firmed significantly, with sentiment shifting higher on the back of mounting uncertainty and limited prompt availability.</p></div>\n<h3>Container</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The liner market looks to have peaked for now, there has been a reduction in rates on the trans Pacific trade and Far East to Mediterranean trade, over capacity may have played a part here with GRI’s hard to sustain by liner companies, however rates from the East to the Atlantic have remained steady over the week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the rising tensions in the Middle East and threats by Iran to close the Strait of Hormuz, there may not be too much change in the liner market as most large container vessels have been for some time been routing via the Cape of Good Hope, with only some smaller container vessels using the Suez Canal.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>FBX01 (China/East Asia – USA West Coast) ended the week at US$4,516/FEU, down US$1,415/FEU from the same time last week. FBX03 (China/East Asia – USA East Coast) closed the week at US$7,177/FEU marginally up from US$7,124/FEU the week before. FBX11 (China/East Asia – North Europe), finished the week at US$2,966/FEU, up US$26 on last week. FBX13 (China/East Asia to Mediterranean) rates dipped to US$4,360/FEU before finishing the week US$211 less than end of the previous week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Disclaimer:</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>While reasonable care has been taken by the Baltic Exchange Information Services Limited (BEISL) and The Baltic Exchange (Asia) Pte. Ltd. (BEA, and together with BEISL being Baltic) in providing this information, all such information is for general use, provided without warranty or representation, is not designed to be used for or relied upon for any specific purpose, and does not infringe upon the legitimate rights and interests of any third party including intellectual property. The Baltic will not accept any liability for any loss incurred in any way whatsoever by any person who seeks to rely on the information contained herein.</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>All intellectual property and related rights in this information are owned by the Baltic. Any form of copying, distribution, extraction or re-utilisation of this information by any means, whether electronic or otherwise, is expressly prohibited. Persons wishing to do so must first obtain a licence to do so from the Baltic.</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759851",
            "pub_date": "2025-06-20 21:51:24",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fomca backs new RP4 electricity tariff, calls it fair and timely",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Federation of Malaysian Consumers Associations (Fomca) has expressed full support for the implementation of the new electricity tariff structure under Regulatory Period 4 (RP4), describing it as timely, progressive and beneficial for Malaysian households.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Fomca chief executive officer Dr T Saravanan said the new tariff, which will take effect from July 1, 2025, to Dec 31, 2027, under the Incentive-Based Regulation (IBR) framework, reflects a fairer and more transparent energy pricing system.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This initiative comes at a crucial time when many households are facing financial pressures due to inflation and the rising cost of living,” he told Bernama.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said the revised tariff structure reduces the average base tariff from 45.62 sen/kWh to 45.40 sen/kWh, contributing to an estimated 19% reduction in total average electricity costs compared to the previous regulatory period.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Although the rate cut may appear marginal, Saravanan said it is supported by structural reforms that provide greater protection to domestic consumers, particularly those in the B40 and M40 income groups.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Saravanan said the introduction of the “Energy Efficiency Incentive” allows households that consume 1,000 kWh or less per month to avoid any tariff increase, thereby rewarding energy-efficient users and encouraging responsible consumption.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The updated structure also includes a more detailed billing system, with breakdowns of energy generation, network usage, capacity charges, and retail costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This level of transparency empowers consumers to understand their bills better and provides clarity on how costs are derived, thereby enhancing trust and enabling more responsible consumption decisions,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The expanded “Time of Use” (TOU) scheme now includes weekends and off-peak weekday hours from 10pm to 2pm the next day, enabling consumers to enjoy further savings by shifting high-usage activities to these periods.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Fomca also welcomed continued protection for vulnerable groups, including a RM40 monthly rebate for hardcore poor households under the e-Kasih programme, and dedicated tariffs for the agriculture, water, sanitation, and rail sectors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A 10% rebate for educational institutions, places of worship, and registered welfare homes will also remain in place.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Saravanan said the replacement of the Imbalance Cost Pass-Through (ICPT) mechanism with the new Automatic Fuel Adjustment (AFA) system would enhance price responsiveness to global fuel and currency movements, but stressed the need for clear communication on any resulting price changes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He also urged the Domestic Trade and Cost of Living Ministry to step up enforcement against unjustified price hikes in essential goods that may be triggered by the tariff adjustment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Fomca will continue to monitor the implementation closely and advocate for ongoing consumer engagement, education and regulatory enforcement to maximise the impact of this policy reform,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Energy Commission today announced that starting July 1, 2025, over 23.6 million domestic users in Peninsular Malaysia will benefit from fairer and more progressive electricity rates under the newly approved tariff schedule for Regulatory Period 4 (2025–2027).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This includes changes to the average base tariff rate, the tariff structure and the fuel cost adjustment mechanism, implemented under the Incentive-Based Regulation framework.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759847",
            "pub_date": "2025-06-20 21:21:42",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maxim Global files appeal to overturn court order halting high-rise project",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Maxim Global Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/4022\" target=\"_blank\">MAXIM</a>) has filed an appeal to overturn a stay order granted by the High Court this week that temporarily halts its high-rise residential project here.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a filing on Friday, Maxim said the stay applied to the development order issued by the Kuala Lumpur City Hall (DBKL) back in October 2017 for the development of five blocks of 30-storey apartments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to Maxim, the stay was granted pending the outcome of a judicial review initiated by a petitioner against DBKL.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The petitioner is challenging the development order on the grounds that it allegedly conflicts with the Kuala Lumpur Structure Plan 2020 and the Kuala Lumpur City Plan 2020.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Maxim said that it only became aware of the legal action in August 2024, and applied to be included as a respondent to safeguard its interests in the development.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The developer added that it has now filed an appeal to the Court of Appeal seeking to vacate the stay order.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Citing its solicitors, Maxim said it has a high chance of success in the appeal.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, the financial and operational impact remains uncertain until the matter is resolved. “Until the status of the matter is clearer, the board is not in a position to determine the financial impact on the group,” the company said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares in Maxim settled down half a sen or 1.32% at 37.5 sen on Friday, giving the group a market capitalisation of RM275.73 million.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759848",
            "pub_date": "2025-06-20 21:21:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Audi could build plant in US to placate Trump, Spiegel reports",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BERLIN (June 20): Volkswagen's premium brand Audi could build a plant at a new location in the United States under scenarios being considered to placate President Donald Trump in the tariff conflict, the <em>Spiegel </em>news magazine reported on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Audi is considering building a plant in the southern US, which would be the more expensive option out of a number of scenarios being considered, with company sources estimating costs of up to 4 billion euros (US$4.6 billion), the report said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>An Audi spokesperson said that the company aims to build up more of a presence in the United States.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We are currently examining various scenarios for this. We are confident that we will make a decision this year in consultation with the (Volkswagen) group on how this will look in concrete terms,\" she said in an emailed statement, reaffirming earlier comments made by the company.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Audi has no production of its own in the US, but Volkswagen has a plant in Chattanooga, Tennessee and one under construction near Columbia, South Carolina.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump's announcement of sweeping tariffs has already racked up hundreds of millions of euros in costs for German carmakers heavily reliant on their export business, according to an industry representative.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BMW, Mercedes-Benz and Volkswagen are in talks with Washington over a possible import tariff deal, seeking to use their US investments and exports as leverage to soften any blow, sources have told Reuters.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759844",
            "pub_date": "2025-06-20 21:11:33",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SD Guthrie, Sime Darby Property to co-develop 2,000 acres on Carey Island into industrial, logistics hub",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Palm oil producer SD Guthrie Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5285\" target=\"_blank\">SDG</a>), formerly known as Sime Darby Plantation Bhd, and its sister company Sime Darby Property Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5288\" target=\"_blank\">SIMEPROP</a>) have entered into an agreement to jointly develop up to 2,000 acres of land on Carey Island, Selangor.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The two parties said the agreement, following discussions that began in 2023, will be formalised through the establishment of a special purpose vehicle (SPV), which aims to support the Selangor state government’s aspiration to transform Carey Island into an industrial and logistics hub.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The development will co-exist with the integrated palm oil operations on the island and complement the activities at Westport and Northport in Port Klang.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We laud and greatly support this joint venture (JV) between SD Guthrie and Sime Darby Property, which aligns with national aspirations and GEAR-uP (Government-linked Enterprise Activation and Reform Programme) initiatives by the government in catalysing domestic investments,\" said Permodalan Nasional Bhd (PNB) president and group chief executive Datuk Abdul Rahman Ahmad in the joint statement by the two companies.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the shareholding structure of the JV was not disclosed, the companies noted that PNB will nominate the chairman of the newly formed SPV.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SD Guthrie currently owns 79% of Carey Island, or approximately 28,646 acres, which include two palm oil estates, palm oil mills, a kernel crushing plant, a biodiesel plant, research and development facilities, a robotics and innovation centre, and a nursery.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Palm oil produced on Carey Island is processed in two major refineries located in Langat and Port Klang, serving customers worldwide. The island is also home to 14 historical buildings listed as heritage sites by Jabatan Warisan Negara, in addition to a large biodiversity park and sensitive mangrove ecosystems managed by SD Guthrie.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Complementing the existing plantation business, the new development on Carey Island is expected to drive economic growth, create job opportunities, and uplift the local economy, while preserving the site's valuable heritage elements.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Abdul Rahman added that the collaboration between PNB's two strategic companies \"will provide a boost towards the sustainable development\" of this high potential area as well as \"help bolster further Malaysia's economic and industrialisation growth”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to the statement, Carey Island provides the scalability required for world-class logistics facilities, integrated supply chains and high-value industrial developments to attract global players and investments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It added that the port will thus be well-positioned to compete with regional ports in Singapore, Thailand, and Vietnam, giving a boost to Malaysia’s aspirations to become a logistics powerhouse in the region.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Carey Island has been identified by the government as the new site for a world-class port due to its suitable and strategic location near Port Klang, and proximity to Pulau Indah,\" said SD Guthrie group managing director Datuk Mohamad Helmy Othman Basha.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Additionally, the island is conveniently connected to the city via the South Klang Valley Expressway (SKVE) which integrates with the North-South Expressway, ensuring accessibility. The highways and connectivity offer tremendous potential for the area to grow into an industrial and logistics hub, while enabling the thriving plantation business in the area to continue,” he added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Sime Darby Property group managing director and chief executive officer Datuk Seri Azmir Merican said the partnership with SD Guthrie is a \"timely opportunity to unlock value in Carey Island\" as a dynamic port and advance the nation’s aspirations of becoming a regional logistics and economic hub.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The collaboration allows us to begin master planning and designing a future-ready industrial ecosystem that will serve the needs of businesses and communities for years to come, in line with 'our Purpose to be a Value Multiplier' for people, businesses, economies and the planet,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At market close, shares of SD Guthrie fell six sen or 1.3% to RM4.49, giving the plantation giant a market capitalisation of RM31.1 billion, while Sime Darby Property slipped four sen or 2.8% to RM1.39, valuing the property firm at RM9.45 billion.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759846",
            "pub_date": "2025-06-20 21:11:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK regulator to probe Amazon over delayed supplier payments",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The UK’s supermarket regulator is investigating Amazon.com Inc over delayed payments to the online retailer’s suppliers. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Groceries Code Adjudicator (GCA) said Friday it has reasonable grounds to suspect Amazon has breached rules relating to payments, based on evidence from a range of sources. The company could face a fine of as much as 1% of its annual revenue in the UK if a breach is confirmed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“While we are disappointed with this decision, we welcome the opportunity to further demonstrate our ongoing compliance with this particular section of the Code,” Amazon said in a statement. The company has already made improvements for grocery suppliers including payment practices, resulting in fewer complaints, it said. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The GCA told Amazon last year it must take “swift and comprehensive” action to comply with the code after suppliers’ complaints. The body said it has heard of other issues at Amazon and that a further investigation may be needed, without giving details.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It’s the first time the regulator is investigating Amazon since it was designated as a grocery retailer in 2022, bringing the company under the GCA’s watch and subject to the same rules as supermarket chains such as Tesco plc.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The GCA previously investigated Tesco over delayed payments to suppliers and the supermarket’s demand for payments in exchange for preferential product placement in stores. The retailer made an apology in 2016 and said it would work to rebuild trust with manufacturers. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759843",
            "pub_date": "2025-06-20 20:31:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Poh Huat's quarterly profit slumps on weaker US demand, higher costs",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Poh Huat Resources Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/7088\" target=\"_blank\">POHUAT</a>) on Friday reported a 92.05% year-on-year drop in quarterly net profit, as demand from the US softened amid tariffs and higher operating costs dented earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Net profit for the second quarter ended April 30, 2025 (2QFY2025) came in at just RM575,000, compared with RM7.23 million previously, the furniture maker's filing with Bursa Malaysia showed. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This is the company's worst earnings performance since 4QFY2024, when it reported a net loss of RM3.54 million.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Quarterly revenue fell 9.24% to RM98.33 million from RM108.35 million in 2QFY2024. The company attributed this to lower orders of office furniture from its Malaysian operations, as some customers had front-loaded their orders in the preceding financial period following the election of Donald Trump as US president.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shipment from its Vietnam factories for home factories remained low, with some US customers holding back orders in April following the imposition of US import tariff, the company added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat declared a second interim dividend of two sen per share, payable on July 24. This brings its year-to-date dividends to four sen per share.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat said higher material and labour costs, coupled with fixed factory overheads amid lower capacity utilisation in both its Malaysian and Vietnamese factories, contributed to the lower gross profit.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company booked a foreign exchange loss of RM1.8 million in the quarter, resulting in a lower net other income of RM700,000. It posted a forex gain of RM2.28 million and net other income of RM5.78 million in 2QFY2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the first six months of FY2025, Poh Huat's net profit declined 42.65% to RM10.06 million, from RM17.53 million in the previous corresponding period, as revenue decreased 2.05% to RM234.59 million from RM239.49 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On its prospects, Poh Huat said it will continue to stay informed about US trade policies as the industry remains in a “state of flux” under Trump’s administration.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat’s shares closed one sen or 0.93% lower at RM1.06 on Friday, giving the company a market capitalisation of RM295 million. The counter has dropped 27% over the past one year.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759841",
            "pub_date": "2025-06-20 20:11:46",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wasco plans spin-off listing of biomass energy unit on Bursa",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Wasco Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5142\" target=\"_blank\">WASCO</a>) is planning to list its wholly owned unit, Wasco Greenergy Bhd, which operates biomass and steam energy businesses, on the Main Market of Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The initial public offering (IPO) will involve up to 150 million shares, comprising an offer for sale of up to 75 million shares by selling shareholders Wasco and Tema Energy Ventures Sdn Bhd, and a public issue of 75 million new shares. The offering represents 30% of Greenergy’s enlarged issued share capital of 500 million shares.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The institutional offering will consist of up to 119.5 million shares, made up of 75 million offer shares and 44.5 million new shares, with the final price to be determined via bookbuilding.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The retail offering will involve 30.5 million shares, of which five million shares will be allocated to eligible employees and directors of Greenergy and Wasco, 15.5 million shares to entitled Wasco shareholders, and 10 million shares to the Malaysian public via balloting.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The initial retail price will be set prior to the launch of the prospectus, according to its filing with Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Proceeds from the public issue, which will accrue entirely to Greenergy, will be used to fund business expansion — particularly in biomass steam power plants — as well as its operations in Indonesia, capital expenditure, digitalisation initiatives, and research and development.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, proceeds from the offer for sale, which will go to Wasco, are earmarked for working capital and general corporate purposes. The final quantum will depend on the IPO pricing, which has yet to be finalised.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Greenergy currently owns a 100% stake in Wasco AgroTech Sdn Bhd and a 60% stake in Wasco Thermal Sdn Bhd (WTSB).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As part of a pre-IPO restructuring, Greenergy will acquire the remaining 40% stake in WTSB from Tema Energy for RM19.3 million, to be satisfied through the issuance of 14.4 million new shares at RM1.34 each. Following the acquisition, Greenergy will undertake a bonus issue of 295.6 million shares on a pro-rata basis to Wasco and Tema Energy. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tema Energy’s shareholders include Tee Kian Lim (26.35%), Teh Khim Choon (25.18%) and Soo Hock Tiong (22.26%).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The proposed acquisition is conditional upon, among others, approval from the Securities Commission Malaysia (SC) and is expected to be completed prior to the registration of Greenergy’s prospectus with the SC.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The proposals are expected to be completed by the fourth quarter of 2025. CIMB Investment Bank Bhd has been appointed as the principal adviser for the exercise.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of Wasco closed down 2.5 sen or 2.56% at 95 sen on Friday, giving it a market capitalisation of RM751.2 million. </p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759842",
            "pub_date": "2025-06-20 20:11:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SC adds 59 entities to Investor Alert List in 1Q",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Securities Commission Malaysia (SC) added 59 names to its Investor Alert List in the first quarter (1Q) of this year, said chairman Datuk Mohammad Faiz Azmi.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said this move is part of ongoing efforts to combat the increasingly rampant scams, alongside blocking fraudulent websites and social media pages.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“In 2024, we added 273 names to the Alert List, and in the 1Q this year, we added another 59,” he said during his opening remarks at the launch of the Bersama InvestSmart @ Pahang 2025 programme.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The event was officiated by Pahang Investment, Industrial Development, Science, Technology and Innovation Committee chairman Datuk Mohamad Nizar Mohamad Najib.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohammad Faiz added that the SC also collaborates closely with the Malaysian Communications and Multimedia Commission (MCMC) to block these deceptive sites.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Last year, we blocked 153 websites and 261 social media pages. In the 1Q, we blocked 29 websites and 91 social media pages. These numbers show how much illicit activity we are fighting daily,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As of May 2025, he said, the SC had received 1,218 complaints and enquiries about scams.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohammad Faiz also reminded the public to be cautious of scams that claim to be shariah<span style='font-family:\"Cambria Math\",serif'>‑</span>compliant, using religious sentiment to gain trust.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bersama InvestSmart @ Pahang 2025 is a three<span style='font-family:\"Cambria Math\",serif'>‑</span>day programme starting Friday, bringing together government officials, capital market industry players, and regulators under one roof as part of the SC’s investor outreach initiative.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>More than 40 exhibitors are participating in the event, themed <i>Bijak Labur, Hidup Makmur</i>.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759840",
            "pub_date": "2025-06-20 20:01:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Masayoshi Son pitches US$1 tril US AI hub to TSMC, Trump team, Bloomberg reports",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): SoftBank Group Corp founder Masayoshi Son is seeking to team up with Taiwan Semiconductor Manufacturing Co to realise what could be his biggest bet yet — a trillion-dollar industrial complex in Arizona to build robots and artificial intelligence (AI).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son envisions a version of the vast manufacturing hub of China’s Shenzhen that would bring back high-tech manufacturing to the US, according to people familiar with the billionaire’s thinking. The park may comprise production lines for AI-powered industrial robots, they said, asking not to be named as the plan remains private.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank officials are keen to have the Taiwanese maker of Nvidia Corp’s advanced AI chips play a prominent role in the project, although it’s not clear what part Son sees for TSMC, which already plans to invest US$165 billion (RM702.16 billion) in the US and has started mass production at its first Arizona factory. Nor is it clear that TSMC would be interested. A person familiar with the chipmaker’s thinking said that SoftBank’s project has no bearing on TSMC’s plans in Phoenix.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Codenamed “Project Crystal Land”, the Arizona complex represents the 67-year-old SoftBank chief’s most ambitious attempt in a career that’s spanned numerous bet-the-house bids, thousands-fold returns and billions of dollars in losses. Son, who’s often expressed disappointment in his own legacy, has repeatedly said he means to do everything he can to hurry AI development. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank officials have spoken with federal and state government officials to discuss possible tax breaks for companies building factories or otherwise investing in the industrial park, including talks with US Secretary of Commerce Howard Lutnick, the people said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Japanese billionaire is also personally sounding out interest among an array of tech companies, they said. The project has been floated to executives at South Korea’s Samsung Electronics Co, they said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of SoftBank rose 2.7% Friday. TSMC’s stock price rose 1.9%, while Samsung’s gained 0.5%. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Representatives of SoftBank, TSMC and Samsung declined to comment. A Commerce Department spokesperson did not immediately respond to a request for comment. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank’s attempts to get businesses investing in a US industrial park follow signs that its campaign alongside ChatGPT maker OpenAI to raise hundreds of billions of dollars for US data centres is moving slower than initially expected. Crystal Land would need to address crucial details, such as whether there’s demand and funding on par with its grandiose scale, to become reality.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son has pulled together a list of SoftBank Vision Fund portfolio companies that might take part in the Arizona manufacturing hub, the people said. SoftBank-backed startups working on robotics and automation technologies — such as Agile Robots SE — may set up production facilities at the industrial complex, they said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The plans are preliminary and feasibility hinges on support from the Trump administration and state officials. While the cost of the project as envisioned by Son may require as much as US$1 trillion to execute — a sum previously reported by the Nikkei — the actual scale depends on interest from big technology companies. If successful, Son has floated building multiple cutting-edge industrial parks across the US.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank is exploring the Arizona project as it also moves forward on plans to invest as much as US$30 billion into OpenAI and plans a US$6.5 billion acquisition of Ampere Computing LLC. It’s also seeding money into the Stargate venture with OpenAI, Oracle Corp and Abu Dhabi’s MGX, although it aims to get the bulk of the money for building data centres around the world from outside investors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Those outlays come as SoftBank’s cash stood at ¥3.4 trillion (US$23 billion or RM100 billion) at the end of March. The Tokyo-based company has since tapped its T-Mobile US Inc stake, selling roughly a quarter of what it held in March to raise US$4.8 billion this month. SoftBank also has net assets valued at ¥25.7 trillion, of which chip designer Arm Holdings plc makes the single largest portion, allowing it to borrow billions more as needed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank’s exploring project financing for Stargate data centres, a model that could be adapted to a big endeavour like Crystal Land. Common for large-scale infrastructure like oil or gas pipelines, the project finance template would allow the tech investor to raise funding on a project-by-project basis and require less money upfront.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son’s restless search for growth has resulted in projects that proceed in fits and starts, making it difficult to gauge how committed he is to any one venture. The billionaire is often goaded by the desire to boost SoftBank’s stock price and repay retail investors who’ve held onto the company’s shares from before the dot-com boom and bust, people close to the SoftBank chief have said. Many investors have waited for decades for the stock to regain dot-com bubble levels — something it’s flirted with only a few times since 2020. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>If Son’s primary motivation is to clear the way for AI, it may be more cost-efficient to encourage partnerships that link manufacturing expertise with that of AI engineers and specialists in fields from medicine to robotics, and incubating smaller companies, according to Melissa Otto, head of research at Visible Alpha. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But pouring cash into data centres may help lower the cost of developing AI applications and spur broader adoption, she said. “He’s a long-term thinker, and he takes risks,” Otto said. “It’s just too early to tell.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759781",
            "pub_date": "2025-06-20 19:51:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Insolvencies jump to 11-month high as UK’s tax hikes take toll",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The number of companies going bust in England and Wales rose to the highest in 11 months as firms struggled with the Labour government’s tax hikes and a broader slowdown in the economy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Insolvencies rose to 2,238 in May, a 15% jump from a year earlier, the government’s Insolvency Service said on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The spike came after Chancellor of the Exchequer Rachel Reeves put the squeeze on firms by increasing payroll taxes and the minimum wage, a twin blow that is hitting many labor-intensive sectors.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>After low levels during the pandemic, the number of insolvencies has risen in recent years as firms contend with higher interest rates, a weak economy and policy changes. The outlook has also been darkened by global trade tensions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Industry-level data covering April showed that retail, hospitality, construction and manufacturing are among those that have been hardest hit.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The data reflects the persistent challenges, particularly in the construction and manufacturing sectors, and highlights that the financing position of many businesses remains fragile,” said David Kelly, head of insolvency at PwC. “This vulnerability can also be seen in some of the business and consumer sentiment surveys which are painting a very cautious picture.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759837",
            "pub_date": "2025-06-20 19:41:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stocks take a breather as investors assess geopolitics, economic data",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>NEW YORK (June 20): Investors will focus on the Israel-Iran conflict and US economic data releases next week to assess the near-term outlook for stocks, as the S&amp;P 500 hovers just below its February highs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The S&amp;P 500 has rebounded sharply from its early-April selloff, as tariff-related tensions have eased. However, the US benchmark index appears to be taking a breather at some 2.7% below its February closing high. The index has gone 27 trading sessions since coming within 5% of its February high but has not yet set a new record.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>With Israel and Iran trading missiles, escalating threats of a sweeping conflict in the Middle East sent oil prices sharply higher and led to caution in markets.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We’re all waiting on pins and needles to see what happens with the Israel-Iran situation,\" said Brian Jacobsen, chief economist at Annex Wealth Management.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>So far, the oil market has absorbed most of the impact from geopolitical turmoil, with equities relatively stable. Yet stock investors remain concerned that higher oil prices could stoke inflation and upset plans for interest rate cuts from the Federal Reserve (Fed).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On Wednesday, the Fed held rates steady, and policymakers signalled borrowing costs are still likely to fall this year. But they estimated the overall pace of expected future rate cuts would be slower than they saw at their March meeting. They cited expectations that higher inflation would flow from President Donald Trump's tariff plans.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The question is oil prices and what that does to inflation — which has implications for monetary policy and how long the Fed keeps rates 'meaningfully restrictive',\" said Sonu Varghese, global macro strategist at Carson Group.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The big near-term risk for equities, investors said, was if the US were to join Israel's bombing campaign against arch-enemy Iran. Trump is keeping the world guessing whether the US would join Israel's bombardment of Iranian nuclear and missile sites, as residents of Iran's capital Tehran streamed out of the city on the sixth day of the air assault.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The White House said on Thursday that Trump would decide on US action in the next two weeks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"If we were to see the US enter the war or further escalation in the attacks between the two countries, that would give the S&amp;P 500 and equity markets more reasons to react negatively,\" said Damian McIntyre, head of multi-asset solutions at Federated Hermes in Pittsburgh.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the other hand, a de-escalation in Middle East tensions could prompt a relief rally for stocks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"If both sides can kind of just slowly de-escalate, that would be positive for equity markets, positive for risk markets,\" McIntyre said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Markets are taking a bit of a wait-and-see approach here,\" he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, any stock market pullbacks due to rising geopolitical tensions are likely to be fleeting, investors said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"History says that usually military shocks are shallow and short-lived, and so until further notice, I think that's how Wall Street will react to this one,\" Sam Stovall, chief investment strategist at CFRA Research, said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Investors will also parse a slew of incoming data releases, including US business activity and housing sales on Monday, consumer confidence numbers on Tuesday and the PCE Price Index on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US consumer confidence plunged in the past few months, with households fearing tariffs could prompt a recession and higher inflation. However, with inflation in check and the US reaching a truce in its trade fight with China, investors expect to see a pickup in sentiment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Remember, the survey-based data all got crushed in the March, April, May time frame ... my expectation is we're still going to see an improvement,\" Mark Hackett, chief market strategist at Nationwide said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759835",
            "pub_date": "2025-06-20 19:31:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jeep maker Stellantis weighs sale among options for Maserati, sources say",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MILAN (June 20): Stellantis is considering a possible sale of its struggling luxury Maserati unit, among other options, two sources with knowledge of the matter said, as the automaker seeks to overhaul its sprawling portfolio of 14 brands.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Discussions over Maserati's future started before new CEO Antonio Filosa, who starts on Monday, was appointed last month, while Stellantis was steered by Chair John Elkann.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The viability of the French-Italian company's 14 brands — which include Chrysler, Peugeot, Jeep and Alfa Romeo — was a priority for Elkann as he interviewed candidates to fill the CEO job.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Like other European carmakers, the world's fourth biggest automaker is facing hefty US import tariffs imposed by US President Donald Trump and struggling with stiff competition from Chinese rivals.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Stellantis hired consultant McKinsey early in April to advise it on the effects of the US tariffs on Maserati and Alfa Romeo as the two brands prepare future plans. Stellantis affirmed then that it was fully committed to both brands.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, a possible divestment of Maserati, its only luxury brand, is among the options McKinsey is exploring for Stellantis, the two sources told Reuters, adding the adviser's assessment was still in the early stages. They spoke on condition of anonymity because they were not authorised to discuss the matter publicly.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Asked for comment, a Stellantis spokesperson said: \"Respectfully, Maserati is not for sale\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>McKinsey declined to comment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Filosa's predecessor Carlos Tavares, who resigned in December after a poor performance in the US market, had refused to consider getting rid of any of the carmaker's brands.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But some investors and analysts say a streamlined portfolio would boost Stellantis' profit margins. Stellantis shares have lost two-thirds of their value since March last year.</p></div>\n<h3>Falling sales</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Maserati's sales fell by more than half in 2024 to just 11,300 units and the unit posted an adjusted operating loss of 260 million euros (US$298 million) last year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The brand currently has no new model launches scheduled as it waits for a new business plan, after its previous one was put on hold by Stellantis last year. Brand head Santo Ficili said earlier this month the plan would be presented soon after Filosa starts the job.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One of the sources said Stellantis has been coming to terms with the fact that it has too many brands, making it difficult for it to properly invest in all of them.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The carmaker needs to \"set priorities\", the source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Stellantis has not specifically mandated McKinsey to find a buyer for Maserati, but the mandate is to consider all options, including a potential sale, the second source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>All options are on the table, the source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Stellantis' board has been divided over plans for Maserati, one source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Some board members think Stellantis is not in a position to sustainably re-launch Maserati and suggest selling it is the best option. Others think Maserati still has value and that selling its only luxury brand would be a huge reputational setback for Stellantis.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Chinese automakers, such as Chery, might be among those interested in buying European auto brands, to support their expansion in the region, where they still lack brand recognition among consumers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This would be a similar move to SAIC's 2007 purchase of Britain's MG Motor or Geely's acquisition of Sweden's Volvo Cars in 2010.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759836",
            "pub_date": "2025-06-20 19:31:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gadang bags RM92 mil contract for KL–Karak Highway widening project",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Gadang Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/9261\" target=\"_blank\">GADANG</a>) has secured a RM92.5 million contract to undertake earthworks for the proposed widening of the Kuala Lumpur–Karak Highway.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The contract was awarded to Gadang’s wholly-owned unit, Gadang Engineering (M) Sdn Bhd, from AFA Construction and Engineering Sdn Bhd on Friday, the engineering and construction outfit said in a bourse filing.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The scope of work covers Package 2A under the broader highway widening project spanning from KM19.2 to KM61.5.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The contract is scheduled to run for 18 months with targeted completion by the last quarter of 2026.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The contract is expected to contribute positively to the earnings of the group during the contract period,” Gadang said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares in Gadang finished unchanged at 23.5 sen on Friday, valuing the Main Market-listed firm at RM188.2 million. The counter has dropped by over 34% since the beginning of the year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p> </p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759834",
            "pub_date": "2025-06-20 19:21:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia's electricity tariffs to be adjusted monthly, instead of twice a year",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PUTRAJAYA (June 20): Peninsular Malaysia’s electricity tariffs will be adjusted on a monthly basis from July onwards, instead of twice a year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tariff revisions due to swings in fuel and generation costs will be done through automatic fuel adjustment system, the Energy Commission (EC) said. The agency also confirmed the base tariff per kilowatt-hour (kWh) will be raised to 45.4 sen under the fourth regulatory period (RP4) from 39.95 sen under RP3.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The new system will take effect from July this year until December 2027.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the new system, the tariff will be adjusted up or down, depending on the difference between actual fuel prices and benchmarked fuel prices. However, the automatic increase is capped at three sen per kWh — and anything exceeding this threshold will require Cabinet approval.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This mechanism allows generation cost adjustment to be implemented automatically based on current market fuel prices and foreign exchange rate,” the EC said. The information will be reported on the commission’s website each month.</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/electricity-tariff_20250620190838.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/electricity-tariff_20250620190838.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The base tariff, an average across all users, is reviewed every regulatory period lasting three years which takes into account potential spending required to expand or maintain the grid.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the current imbalance cost pass-through (ICPT) mechanism, the final tariff to be paid by consumers is adjusted every six months in the form of rebates or surcharges on top of the base tariff.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>If fuel costs exceed the projection, a surcharge will be levied, resulting in higher tariffs for the consumers, while a rebate will lower the final tariffs if fuel costs drop below forecasts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The new base tariff of 45.4 sen per kWh comprises 12.98 sen for Tenaga Nasional Bhd’s (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5347\" target=\"_blank\">TENAGA</a>) capital expenditure and 32.42 sen for generation costs, before any automatic adjustments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The current base tariff of 39.95 sen per kWh, meanwhile, is based on 13.75 sen for Tenaga’s capital expenditure and 26.20 sen for generation costs. There is a 16 sen ICPT surcharge currently tacked on to the current tariff.</p></div>\n<h3>New ‘tiered’ structure; potential cost savings</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Apart from changes to the tariff’s adjustment mechanism, the commission is also doing away with the tiered tariff system and is now categorising end-users based on consumption. The tariff will also be broken down into charge categories — energy, capacity, network and retail charges.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>User categories will comprise low, medium and high voltage — heavier users will face higher energy, capacity, network, and retail charges. Domestic users fall into the low-voltage category.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Further, electricity tariffs under RP4 will be further adjusted for domestic users if their consumption is at least 1,000 kWh and below, and low-voltage non-domestic users who use 200 kWh and below qualify for the Energy Efficiency Incentive (EEI).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>There would be specific tariffs for agriculture, water services, sewage and rail operators, and a 10% rebate will be given to registered higher education institutions, schools, welfare homes and houses of worship.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The government will also continue the RM40 electricity bill rebate programme, offering monthly assistance of RM40 to households in the hardcore poor category and registered in the eKasih system.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Following the implementation of this new tariff schedule, the majority of users are expected not to be affected,” the EC said. “In fact, users who practise efficient energy usage will enjoy higher savings through the EEI.”</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759811",
            "pub_date": "2025-06-20 19:11:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Misif urges deferment of SST on raw steel materials, flags risk to local industry competitiveness",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Malaysian Iron and Steel Industry Federation (Misif) has warned that the upcoming sales and services tax (SST) expansion and planned carbon tax will hurt the steel industry and weaken its competitiveness, as the sector is already grappling with global overcapacity, cheap imports and rising costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>More than 240 steel-related products — including critical raw materials such as coking coal, coke and steel scrap — will be subject to SST starting July 1 this year, said Misif in a statement.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While raw materials for iron and steel will be taxed, the national industry association pointed out that many semi-finished and finished products remain exempted or duty-free.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“It will weaken the competitiveness of local manufacturers, encourage imports, discourage domestic production and erode Malaysia’s industrial base. Increased costs will also make Malaysian steel exports less competitive, leading to lost export markets and a worsening trade imbalance,” said Misif.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The association, which has over 150 member companies, further said that the SST expansion also covers machinery and equipment used in steel manufacturing, contradicting the goals of the New Industrial Master Plan 2030.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move is expected to deter investment in automation, advanced technologies and green steel production, in turn undermining efforts to improve productivity and sustainability.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Misif also highlighted that a 10% SST on steel mesh — used widely in high-rise and affordable housing projects with industrialised building systems (IBS) — could slow down construction and increase reliance on manual labour and foreign workers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The group urged the government to review the tax policy urgently, warning of long-term risks to Malaysia’s industrial base, domestic supply chains and trade balance.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the carbon tax — expected to be introduced in 2026 — Misif said the steel industry would be among the first targeted alongside the energy sector, despite the sector already facing multiple challenges, especially in this increasingly uncertain global landscape.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While reiterating its support for Malaysia’s net-zero goals, Misif said a carbon tax at this stage would compound pressures on steel makers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As a result, Misif called on the government to act swiftly to preserve its long-term competitiveness, safeguard thousands of jobs, and secure Malaysia’s industrial future.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The expanded SST will impose a 5% to 10% sales tax on selected non-essential goods and broaden the service tax to include services such as rental or leasing, construction, finance, private healthcare, education and beauty.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Earlier this week, Finance Ministry secretary general of Treasury Datuk Johan Mahmood Merican reportedly said the government expects the expanded SST to generate an estimated RM5 billion additional revenue in six months starting July.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/758356\" target=\"_blank\">Expanded SST to kick in on July 1 with 5%-10% sales tax on selected, non-essential goods, says MOF</a></i></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759833",
            "pub_date": "2025-06-20 19:01:43",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chizu Café owner plans Singapore IPO to fuel Southeast Asian expansion",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Daruma Capital Sdn Bhd, which operates the Chizu Café chain, on Friday announced its plan to list on the Singapore Exchange (SGX) to accelerate regional expansion.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move is part of Daruma Capital’s broader strategy to tap into Singapore’s deep capital markets and attract international investors, particularly those eyeing Southeast Asia’s rapidly growing consumer sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite a muted listings environment in Singapore, the SGX provides an ideal platform for accessing regional and global capital, while allowing the company to maintain its focus on operations, said Daruma Capital founder and managing director Ong Leong Fuei.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The timing is particularly favourable,” Ong noted. “Consumer spending across the region remains robust, and international investors are increasingly drawn to high-quality regional F&amp;B brands with proven scalability.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Private equity firm MCI Capital Sdn Bhd has been hired as the financial adviser for the initial public offering (IPO), according to a statement from Daruma Capital. MCI Capital will advise Daruma on overall capital markets strategy, including listing readiness.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Details such as the size of the IPO or timeline were not elaborated on in the statement. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Currently, Daruma Capital has seven outlets in the Klang Valley under the “Meet Me at Chizu” concept and plans to expand across Southeast Asia. The company also operates Yaki Soul and Daruma pastry supply.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Established in Malaysia, the Japanese-inspired café brand is known for its signature blend of milky cheese foam with artisanal beverages and buttery croissants.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Daruma’s vertically integrated business model — with a central kitchen supporting multiple brands — would be a key driver of scalability and a strong draw for institutional investors, said MCI Capital chairman Datuk Cannis Chan noted.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We understand what international investors seek in Southeast Asian F&amp;B companies, and Daruma Capital checks all the boxes — including proven leadership, scalability, solid financials, and a clear growth strategy,” Chan added.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759795",
            "pub_date": "2025-06-20 18:51:46",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}