{
    "data": [
        {
            "title": "Sunway Sanctuary senior living residence 50% taken up",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SUBANG JAYA (June 21): Sunway Healthcare Group announced a 50% take-up rate for the first phase of its senior living residence, Sunway Sanctuary in Sunway City Kuala Lumpur, since its opening last year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As part of the bigger Sunway City Kuala Lumpur in Subang Jaya, Selangor, the development has 473 rooms for lease. The first phase consists of 235 rooms and it is 50% taken up, while the second phase will be launched at a later date.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In its second anniversary celebration on Friday, Sunway Sanctuary also unveiled two new room types, a rehabilitation centre and two new programmes aimed at post-cardiac recovery and advanced assistive care.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There are people who want different levels of comfort. With these options, we are also able to offer somebody a different category of room type that they might feel more comfortable with. So, you have that ability to accommodate a wider audience, based on their level of comfort or luxury that they want,” Sunway Sanctuary general manager Leonard Theng Boon Liang told the press.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He added that the group is also looking to build senior living residences in Ipoh and Johor. However, he declined to share further as it is still at the planning stage.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Sunway Group is looking to launch Sunway Square, a commercial hub that includes components for retail, offices, education and entertainment within Sunway City Kuala Lumpur, in the third quarter. The development will be connected to other components of the master plan through link bridges or walkways, including Sunway Sanctuary.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Sunway Sanctuary is a premier senior living residence established under Sunway Healthcare Group, aiming to transform retirement living through personalised care, community experiences and holistic wellness, setting high standards for eldercare.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Rachel Chew</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759899",
            "pub_date": "2025-06-21 18:41:24",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toyota to raise US auto prices by average US$270 from July",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>TOKYO/BENGALURU (June 21): Japanese carmaker Toyota Motor said on Saturday it will raise prices for some vehicles sold in the US by an average of US$270 (RM1,148) starting in July.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The automaker's decision follows US President Donald Trump's imposition of a 25% tariff on imported vehicles and auto parts. A Toyota spokesperson, however, denied the tariff directly influenced the price increase.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The latest price hike is part of our regular review of the prices,\" Nobu Sunaga, a Toyota spokesperson, said.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Prices for Lexus models, Toyota's luxury brand, would also increase by an average of US$208, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759895",
            "pub_date": "2025-06-21 18:11:41",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MBSB Bank partners with Bayo Pay to digitalise construction sector payroll",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 19): MBSB Bank Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/1171\" target=\"_blank\">MBSB</a>) said it has teamed up with Bayo Pay to digitise payroll disbursement for Malaysia’s construction sector, offering contractors \"a safer and more efficient alternative to cash-based wage payments\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>By offering a digital-first payroll system, MBSB Bank aims to protect contractors and workers alike while aligning with national goals to accelerate cashless adoption, the bank said in a statement on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bayo is a homegrown financial technology company, and it is regulated by Bank Negara Malaysia under the Payment System Act 2003, the company’s website showed.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The solution is built on Bayo's regulated e-money platform, which allows wages to be credited directly into workers’ e-wallets, thus eliminating the operational and security risks of carrying physical cash to worksites.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MBSB Bank said the move addresses a persistent challenge in the construction industry. It noted that in recent years, there has been a rise in robberies targeting contractors transporting large sums of cash, resulting in serious injuries, unpaid workers and stalled projects.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For contractors, it offers traceable wage disbursement, streamlined compliance with labour and audit requirements, and reduced risk of fraud. For workers, particularly those unbanked or underbanked — it enables faster, more secure access to wages via mobile wallets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MBSB Bank said the service is initially targeted at G1 to G7 CIDB-registered contractors. In the future phase, the service is expected to benefit both employers and workers across a wider range of industries.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We’re enabling businesses to move away from high-risk, cash-based practices and giving workers a safer way to get paid,\" said MBSB group chief executive officer Rafe Haneef in a statement. \"It’s a meaningful step forward in how payroll should be done.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MBSB Bank said the solution also opens new avenues for the bank to serve clients through bundled payroll current accounts, cash management tools, and broader financial services over time.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bayo Pay managing director Fardan Abdul Majeed said the group is proud to work with CIDB and MBSB Bank to modernise and digitalise wage payments in the construction industry.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This is about more than removing cash, it is about enabling trust, inclusion, and better outcomes for the entire value chain,” Fardan said.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759704",
            "pub_date": "2025-06-21 18:11:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Middle East tensions put investors on alert, weighing worst-case scenarios",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>NEW YORK (June 21): Investors are mulling a host of different market scenarios should the US deepen its involvement in the Middle East conflict, with the potential for ripple effects if energy prices skyrocket.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>They have honed in on the evolving situation between Israel and Iran, which have exchanged missile strikes, and are closely monitoring whether the US decides to join Israel in its bombing campaign.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Potential scenarios could send inflation higher, dampening consumer confidence and lessening the chance of near-term interest rate cuts. This would likely causean initial selloff in equities and possible safe-haven bid for the dollar.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While US crude prices have climbed some 10% over the past week, the S&amp;P 500 has been little changed as of yet, following an initial drop when Israel launched its attacks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, if attacks were to take out Iranian oil supply, \"that's when the market is going to sit up and take notice\", said Art Hogan, the chief market strategist of B Riley Wealth.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"If you get disruption to supply of oil product on the global marketplace, that is not reflected in today's West Texas Intermediate price and that is where things get negative,\" Hogan said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The White House said on Thursday President Donald Trump would decide on US involvement in the conflict in the next two weeks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Analysts at Oxford Economics modelled three scenarios, ranging from a de-escalation in the conflict, a complete shutdown in Iranian production, and a closure of the Strait of Hormuz, \"each with increasingly large impacts on global oil prices\", the firm said in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the most severe case, global oil prices jump to around US$130 (RM552.82) per barrel, driving US inflation near 6% by the end of this year, Oxford said in the note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Although the price shock inevitably dampens consumer spending because of the hit to real incomes, the scale of the rise in inflation and concerns about the potential for second-round inflation effects likely ruin any chance of rate cuts in the US this year,\" Oxford said in the note.</p></div>\n<h3>Oil impact</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The biggest market impact from the escalating conflict has been restricted to oil, with oil prices soaring on worries that the Iran-Israel conflict could disrupt supplies. Brent crude futures have risen as much as 18% since June 10, hitting a near five-month high of US$79.04 on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The accompanying rise in investors' expectations for further near-term volatility in oil prices has outpaced the rise in volatility expectations for other major asset classes, including stocks and bonds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But other asset classes, including stocks, could still feel the knock-on effects of higher oil prices, especially if there is a larger surge in oil prices if the worst market fears of supply disruptions come true, analysts said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Geopolitical tensions have been mostly ignored by equities, but they are being factored into oil,\" Citigroup analysts wrote in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"To us, the key for equities from here will come from energy commodity pricing,\" they said.</p></div>\n<h3>Stocks unperturbed</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US stocks have so far weathered rising Middle East tensions with little sign of panic. A more direct US involvement in the conflict could, however, spook markets, investors said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Financial markets may be in for an initial sell-off if the US military attacks Iran, with economists warning that a dramatic rise in oil prices could damage a global economy already strained by Trump's tariffs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, any pullback in equities might be fleeting, history suggests. During past prominent instances of Middle East tensions coming to a boil, including the 2003 Iraq invasion and the 2019 attacks on Saudi oil facilities, stocks initially languished but soon recovered to trade higher in the months ahead.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On average, the S&amp;P 500 slipped 0.3% in the three weeks following the start of conflict, but was 2.3% higher on average two months following the conflict, according to data from Wedbush Securities and CapIQ Pro.</p></div>\n<h3>Dollar woes</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>An escalation in the conflict could have mixed implications for the US dollar, which has tumbled this year amid worries over diminished US exceptionalism.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In the event of US direct engagement in the Iran-Israel War, the dollar could initially benefit from a safety bid, analysts said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Traders are likely to worry more about the implicit erosion of the terms of trade for Europe, the UK, and Japan, rather than the economic shock to the US, a major oil producer,\" Thierry Wizman, a global foreign exchange and rates strategist at Macquarie Group, said in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But in the longer term, the prospect of US-directed 'nation-building' would probably weaken the dollar, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We recall that after the attacks of 9/11, and running through the decade-long US presence in Afghanistan and Iraq, the US dollar weakened,\" Wizman said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759894",
            "pub_date": "2025-06-21 17:41:33",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Relaunched KLIA aerotrain to begin operations on July 1, says Loke",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SEPANG (June 21): The aerotrain service at the Kuala Lumpur International Airport (KLIA) will resume operations at 10am on July 1, said Transport Minister Anthony Loke Siew Fook.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said the service is currently in its final testing phase to ensure all safety aspects are at the highest level before it is opened to users.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“I would like to announce that the aerotrain project has been completed, and various trials have been conducted to ensure its safety.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“[At present] the aerotrain is undergoing trials and several final tests in the coming days, including one of the most important — the emergency response test,” Loke said at a press conference after inspecting the service on Saturday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The aerotrain, which has been the backbone of KLIA’s internal transport system since the airport opened in 1998, was suspended in March 2023 following a breakdown.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Loke said the new aerotrain, comprising three carriages, offers high-quality service and can carry up to 270 passengers per trip.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There are three coaches, and each can accommodate 90 passengers, so one trip can carry 270 people.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There are two trains operating alternately, and in total, we have three train sets, with two running at all times and one acting as a backup train,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>To ensure the aerotrain remains in good condition, he said the service will operate on both tracks during peak hours and on a single track during off-peak hours.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We also want to ensure the trains are well maintained in terms of safety, and that is something very important.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“That’s why we have taken time to carry out various tests, including those monitored by the Land Public Transport Agency,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Loke said the resumption of the aerotrain service is crucial in preparation for the Visit Malaysia 2026 and to strengthen operations as Malaysia holds the Asean chairmanship this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There will be more meetings coming up for Asean in the next few months until the end of the year, where another summit will be held in Kuala Lumpur,” he added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Loke said the shuttle bus service will be maintained even after the aerotrain resumes, so both services can be used by KLIA passengers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We want to ensure smooth travel and passenger movement within KLIA,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Also present were Transport Ministry secretary general Datuk Jana Santhiran Muniayan, Malaysia Airports Holdings Bhd (MAHB) managing director Datuk Mohd Izani Ghani and MAHB chief operating officer Gordon Stewart.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/752741\" target=\"_blank\">Aerotrain completion timeline not affected by privatisation — MAHB chairman</a></em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759886",
            "pub_date": "2025-06-21 17:11:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apple executives held internal talks about buying AI start-up Perplexity — Bloomberg",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 21): Apple Inc executives have held internal discussions about potentially bidding for artificial intelligence (AI) start-up Perplexity AI, seeking to address the need for more AI talent and technology.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Adrian Perica, the company’s head of mergers and acquisitions (M&amp;A), has weighed the idea with services chief Eddy Cue and top AI decision-makers, according to people with knowledge of the matter. The discussions are at an early stage and may not lead to an offer, said the people, who asked not to be identified because the matter is private. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Such a deal would help Apple develop an AI-based search engine, part of efforts to cope with the potential loss of a long-standing arrangement with Google. That partnership, which involves making Google the default browser on devices, generates roughly US$20 billion (RM85.05 billion) a year for Apple — and is now under threat from US antitrust enforcers.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>To date, Apple executives haven’t discussed a bid with Perplexity management. <em>Bloomberg News</em> reported earlier on Friday that Meta Platforms Inc tried to buy Perplexity earlier this year. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We have no knowledge of any current or future M&amp;A discussions involving Perplexity,” the AI start-up said in a statement. Apple declined to comment. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Perplexity service provides real-time answers to questions using the latest information from the web. If Apple were to engage in talks to buy the start-up, such a move likely wouldn’t happen until a decision is made in the Google antitrust trial. That’s when Apple would know whether its lucrative Google agreement may have to be unwound.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Google shares reversed gains and fell nearly 1% in late trading after <em>Bloomberg</em> reported on Apple’s Perplexity discussions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Perplexity recently completed an investment round that valued it at US$14 billion. A deal anywhere near that level would be the largest acquisition in Apple’s history. The company’s biggest transaction until now remains the US$3 billion takeover of Beats in 2014 — though Apple made more recent billion-dollar deals for Intel Corp’s modem unit and a stake in Chinese ride-sharing company DiDi.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>After Meta failed to reach an agreement with Perplexity, it bought a 49% slice of Scale AI for US$14.3 billion. That deal is part of Meta’s attempts to create a so-called superintelligence AI team, which will now include Scale co-founder Alexandr Wang.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Apple and Meta have been waging a broader fight for talent. Meta recently engaged in discussions to hire Daniel Gross, the co-founder of AI company Safe Superintelligence Inc. While the discussions between Meta and Gross are advanced, Apple has attempted to persuade him to join it instead.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In 2013, Gross sold a start-up named Cue to Apple. That purchase helped form the basis of some early AI features in iOS, the operating system for the iPhone. And one of Gross’ Cue co-founders, Robby Walker, oversaw the Siri voice assistant until this year. Walker is now leading an Apple project dubbed Knowledge with the goal of creating a rival to OpenAI’s ChatGPT that can use data from the open web.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gross didn’t immediately respond to a request for comment. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Perica and Eddy Cue, who both report to Apple chief executive officer Tim Cook, are leading the AI acquisition and recruiting efforts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The hunt for talent is part of a bid to catch up in generative AI. The company was slow to deliver its Apple Intelligence platform and still lags rivals in key features. A revamped Siri was delayed indefinitely this year, with the company now aiming to have it ready by next spring.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Apple unveiled a relatively meagre slate of new AI enhancements at its Worldwide Developers Conference earlier this month. The latest features include live translation capabilities and a deeper partnership with OpenAI on ChatGPT-based image generation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Buying Perplexity would give Apple an infusion of AI talent, a known brand in the AI space and a consumer product. A deal could also potentially assist with future recruiting efforts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Apple has also discussed an alternative plan: teaming up with Perplexity instead of buying it. A partnership would involve adding Perplexity as an AI search engine option in Apple’s Safari web browser and integrating it into Siri.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Apple has met multiple times in recent months with Perplexity, and its AI team has been actively evaluating the technology — a sign that it’s at least considering a close relationship with the company.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One major snag in the process could be an in-the-works deal between Perplexity and Samsung Electronics Co, which plans to announce a deep partnership with the start-up. Samsung is Apple’s biggest competitor in smartphones, and AI features have become a critical new arena for the two rivals.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In its statement, Perplexity said it shouldn’t be surprising that top manufacturers want to offer the “best search and more accurate AI for their users”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“That’s Perplexity,” the start-up said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Cue, whose department includes Apple’s streaming services and iCloud, previously expressed an interest in Perplexity. While testifying at the Google antitrust trial in May, he told jurors that the industry is shifting away from standard internet searches to AI tools. He outlined a scenario in which AI search engines could quickly supersede Google’s current offering.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We have been pretty impressed with what Perplexity has done, so we have started some discussions with them about what they are doing,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759883",
            "pub_date": "2025-06-21 16:21:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia maintains anti-dumping duties on cold rolled coil imports from China, Japan",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 21): The government has completed the administrative (sunset) review and made an affirmative final determination to continue imposing anti-dumping duties on imports of cold rolled coils (CRC) of iron or non-alloy steel (over 1,300mm wide) from China and Japan, excluding those used for automotive and transformer finwall applications, or tin mill black plate.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">The Ministry of Investment, Trade and Industry (Miti) said the rate of anti-dumping duties for the Chinese companies are: Angang Steel Company Ltd at 4.82%, Maanshan Iron and Steel Co Ltd at 4.76%, Shougang Jingtang United Iron &amp; Steel Co Ltd at 8.74%, and other producers and exporters at 26.38%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"The rate of anti-dumping duties for Japanese producers and exporters will be imposed at 26.39%.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"The Royal Malaysian Customs Department will enforce the collection of the anti-dumping duties on the imports of the subject merchandise for a period of five years, effective from June 23, 2025 to June 22, 2030,\" it said in a statement on Saturday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">Miti also noted that the government had made a negative final determination to terminate the imposition of anti-dumping duties and the investigations on the imports of the subject merchandise originating or exported from South Korea and Vietnam, effective from Monday, June 23, 2025.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"Interested parties such as local producers, importers, foreign producers and exporters and associations related to the administrative [sunset] review can have access to the non-confidential version of the final determination report by submitting a written request to the Miti director of trade practices section,\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759887",
            "pub_date": "2025-06-21 16:21:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Musk’s xAI lures investors to sweetened US$5b debt deal",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 21): Elon Musk’s artificial intelligence (AI) start-up xAI Corp lured enough investors to its US$5 billion (RM21.3 billion) debt deal by offering sweeter pricing on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Morgan Stanley wrapped up commitments for the package, which included a mix of bonds and loans, with higher interest rates and a bigger discount on one component.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The offering presented a rare opportunity for credit investors to gain exposure to AI and Musk’s business empire. However, his feud with US President Donald Trump and concerns about xAI’s financials led investors to demand better terms.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In addition to the pricing changes, the company said it plans to raise another US$4.3 billion in equity as a balance sheet cushion and also altered some terms on debt documents to make them more investor-friendly, <em>Bloomberg </em>previously reported. The company responsible for the AI chatbot Grok needs the new money, in part, because it is burning through cash so quickly to fuel its growth.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US$3 billion of new bonds priced at a 12.5% yield, as did a US$1 billion fixed-rate term loan, according to a person familiar with the matter. A separate US$1 billion loan has a coupon 7.25 percentage points over the benchmark, priced at a discounted 96 cents on the dollar.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A spokesperson for Morgan Stanley declined to comment. An xAI representative did not respond to a request for comment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>When the debt package launched on June 2, it garnered demand in excess of US$3.5 billion by the end of that day, with TPG Angelo Gordon pledging itself as an anchor investor. Interest waned as Musk publicly sparred with Trump and investors reviewed xAI’s financials. Commitments were originally due on Tuesday, but Morgan Stanley extended the time frame.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The more attractive investor terms stand in contrast to many other debt deals this week that tightened pricing and accelerated deadlines due to strong demand.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759881",
            "pub_date": "2025-06-21 11:41:25",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AGC rejects claims of 'flawed prosecution' after Najib’s DNAA in second SRC case",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Attorney General’s Chambers (AGC) has dismissed as baseless allegations that it carried out a ‘flawed prosecution’ in the second SRC International Sdn Bhd case involving former prime minister Datuk Seri Najib Razak.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a statement, the AGC reiterated its firm commitment to upholding the rule of law and stated that it would continue to fulfil its responsibilities under the Federal Constitution with integrity, fairness and respect for the judicial process. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, the AGC acknowledged the decision by High Court judge K Muniandy to grant Najib a discharge not amounting to an acquittal (DNAA) on three charges of money laundering involving RM27 million in funds from the company.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The case was registered in the High Court on Feb 7, 2019, and scheduled for trial on five occasions: June 2020, July to August 2021, March to April 2022, September 2024, and April to May 2025.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“However, all trial dates were postponed due to the movement control order caused by the Covid-19 pandemic, requests by the defence, or applications by the prosecution itself,” the statement read. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"auto\">According to the statement, the prosecution’s requests for postponement were due to the ongoing trial of the first SRC case, which proceeded at the High Court, Court of Appeal and Federal Court until its completion on March 31, 2023.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At the same time, the trial proceedings for the 1Malaysia Development Bhd (1MDB) case had also begun while the first SRC case was still ongoing.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Both cases involved overlapping material documents required for the second SRC trial.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“As these documents were critical to the second SRC case, the prosecution had no choice but to wait until they were available, which was until the 1MDB trial proceedings were completed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"auto\">“It must be emphasised that the material documents are available but are currently being used as evidence in the ongoing 1MDB trial,” the AGC said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The AGC further stated that the prosecution had requested additional time to gather all relevant material documents to be presented as evidence in the second SRC trial.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This delay was not intentional but to ensure the integrity of the documents as evidence in the trial is preserved,” the statement read.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"auto\">Earlier on Friday, Muniandy, in granting Najib a DNAA on the three charges, stated that the case had been pending for six years since 2019, without any witness testimony being presented, having faced multiple postponements, which indicated that the prosecution was not ready to proceed with the trial.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On Feb 3, 2019, Najib claimed trial to three charges of money laundering by accepting illegal proceeds amounting to RM27 million through his three AmPrivate Banking accounts at AmIslamic Bank Bhd, AmBank Group Building, Jalan Raja Chulan on July 8, 2014.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The former Pekan member of Parliament was charged under Section 4 (1) (a) of the Anti-Money Laundering and Anti-Terrorism Financing Act 2001, which is punishable by a maximum fine of RM5 million or imprisonment of up to five years, or both upon conviction.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Najib is currently serving a jail term at Kajang Prison for the misappropriation of RM42 million in the first SRC case.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On Sept 2, 2022, he filed a petition for a royal pardon, which led to the Pardons Board halving his jail term from 12 to six years and reducing the fine from RM210 million to RM50 million on Jan 29, 2024. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759744\" target=\"_blank\">Court grants Najib temporary discharge in second case linked to SRC</a><br/>\n<a href=\"https://theedgemalaysia.com/node/759813\" target=\"_blank\">Anwar: Najib's DNAA in second SRC case a judicial matter</a></i><br/>\n<em><a href=\"https://theedgemalaysia.com/node/759839\" target=\"_blank\">AGC must explain failure to bring Najib to trial in second SRC-linked case, says C4 Center</a></em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759879",
            "pub_date": "2025-06-21 11:21:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street choppy, oil dips as US holds back from Mideast military action",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>NEW YORK (June 21): Major Wall Street indices closed lower on Friday while oil prices fell after US President Donald Trump held back from immediate military action in the Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>All eyes remained trained on the Middle East one week after an initial Israeli assault drew Iranian retaliation. The US imposed Iran-related sanctions a day after Trump said he might take two weeks to decide on further action.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to preliminary data, the S&amp;P 500 lost 0.21%, while the Nasdaq Composite shed 0.49%. The Dow Jones Industrial Average, however, rose 38.47 points, or 0.09%, to 42,210.13.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Stocks had been broadly positive at the open, and dipped in and out of negative territory during the session.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Global benchmark Brent crude futures fell 2.3% to settle at US$77.01 (RM327.48) a barrel, but gained 3.6% in the week. Front-month US crude, which did not settle on Thursday due to a US holiday and expired on Friday, ended down 0.28% at US$74.93, with a weekly gain of 2.7%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Investors are a little bit nervous about buying stocks right in front of this situation and, more specifically, right in front of this weekend,\" said Rick Meckler, a partner of Cherry Lane Investments in New Vernon, New Jersey.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The new sanctions target entities, individuals and vessels providing Iran with defence machinery, and were seen as a sign of a diplomatic approach from the Trump administration.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"However, while Israel and Iran carry on pounding away at each other, there can always be an unintended action that escalates the conflict and touches upon oil infrastructure,\" PVM analyst John Evans said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European foreign ministers urged Iran to engage with the US over its nuclear programme after high-level talks in Geneva about a potential new nuclear deal ended with little sign of progress.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Europe's main bourses had ended their session a touch higher, following similar gains across Asia. MSCI's gauge of stocks across the globe fell 0.01% on the day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gains on Hong Kong's Hang Seng, and South Korea's Kospi linked to newly elected President Lee Jae Myung's stimulus, had boosted Asian shares during that session.</p></div>\n<h3>Fed split</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Federal Reserve (Fed) policymakers made their first public comments since chair Jerome Powell said on Wednesday that borrowing costs were likely to fall this year, but that he expects \"meaningful\" inflation ahead as Trump's tariffs raise prices for consumers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The close split between governors on how to manage the risks was in full view as governor Christopher Waller said the central bank should consider cutting as soon as the next meeting, while the Richmond Fed's Tom Barkin said there was no urgency to cut.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Powell had also cautioned on Wednesday against holding on too strongly to the forecasts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Treasury yields fell after Waller's comments, and as concerns about the Middle East conflict supported demand for safe haven bonds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The yield on benchmark 10-year notes fell two basis points to 4.375%, from 4.395% late on Wednesday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Demand rose for the US dollar, pushing the greenback to a three-week high against the yen.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The dollar rose 0.03% against a basket of currencies including the yen and the euro, with the euro up 0.3% at US$1.1528. The index was poised to rise 0.6% this week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Prices for gold, another traditional refuge, fell 0.13% to US$3,365.91 and were poised for a weekly loss.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759876",
            "pub_date": "2025-06-21 10:31:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US prepares action targeting allies’ chip plants in China, WSJ reports",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): A US official has informed leading global semiconductor companies of plans to cancel waivers allowing them to use American technology in China, the <i>Wall Street Journal</i> reported on Friday, citing people familiar with the matter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Jeffrey Kessler, under secretary of commerce for industry and security at the Commerce Department, told Samsung Electronics, SK Hynix and Taiwan Semiconductor Manufacturing this week that he wanted to cancel those waivers, <i>WSJ</i> reported.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Reuters</i> could not immediately confirm the report.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A Commerce spokesperson said in a statement, “Chipmakers will still be able to operate in China. The new enforcement mechanisms on chips mirror licencing requirements that apply to other semiconductor companies that export to China and ensure the United States has an equal and reciprocal process.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759868",
            "pub_date": "2025-06-21 10:21:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "In the spotlight",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 21): From early April to end-June, Chengco PLT resigned as auditors from as many as 35 public listed companies as a result of it being suspended for a two-year period by the Securities Commission Malaysia’s Audit Oversight Board (AOB).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The AOB among others alleged “serious audit quality issues” with Chengco’s work.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As a result, two of Chengco’s audit partners were suspended for two years, while another three partners were prohibited from accepting as clients and auditing any public interest entities or scheduled funds for a one-year period.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Interestingly, almost all the 35 companies from which Chengco resigned from recently are not doing well financially. They appear to have a penchant for large cash calls, raising funds via private placements and rights issues, and employee share option schemes (ESOS), among others.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Some of these companies seem prone to changing their financial year end, and may do so again now that their auditors have been reprimanded and unable to continue to audit them.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the spotlight is currently on Chengco and the companies it audited, the AOB says in response to questions from <em>The Edge</em> that it is the primarily the responsibility of the board of directors and management of the public interest entities to ensure that their financial statements are accurate, reliable and presented fairly in accordance with applicable accounting standards.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The AOB however adds that when audit deficiencies are found, the audit firm is expected to evaluate the implications of the relevant audits and if needed undertake corrective action.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This week’s cover story takes a closer look at some of the 35 PLCs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Grab a copy of <em>The Edge Malaysia</em> weekly today to read more.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Save by <a href=\"https://subscribe.theedgemalaysia.com/\" target=\"_blank\">subscribing</a> to us for \n      your print and/or \n      digital copy.</p></div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><strong>P/S: The Edge is also available on\n      <a href=\"https://itunes.apple.com/us/app/the-edge-markets/id990567068?ls=1&amp;mt=8\" target=\"_blank\">Apple's App Store</a> and \n      <a href=\"https://play.google.com/store/apps/details?id=com.bizedge.theedgemarkets.malaysia\" target=\"_blank\">Android's Google Play</a>.</strong></p></div></div></div>",
            "link": "https://theedgemalaysia.com/node/759872",
            "pub_date": "2025-06-21 10:21:24",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tg Malim-KL Sentral KTM and ETS train services delayed by an hour due to power supply disruption",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Tanjung Malim-KL Sentral-Tanjung Malim commuter train and electric train (ETS) services route experienced a power supply disruption on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>According to a Facebook post by Keretapi Tanah Melayu Berhad (KTMB), due to the power disruption, both KTM Commuter and ETS services on the route were delayed by more than an hour as trains used only a single track.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“KTMB apologises for all the inconvenience caused. Updates on train services will be given from time to time,” the post said.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759867",
            "pub_date": "2025-06-21 09:11:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cambodia Airways’ inaugural flight to Penang takes off on June 26 — Tiong",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Cambodia Airways is set to launch its inaugural flight from Phnom Penh to Penang on June 26, further enhancing bilateral ties between Malaysia and Cambodia, particularly in the tourism sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tourism, Arts and Culture Minister Datuk Seri Tiong King Sing announced the new route during a dinner with industry players in Cambodia on Thursday, held in conjunction with efforts to promote Visit Malaysia Year 2026 (VM2026).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said Cambodia Airways’ new route would operate twice a week, on Thursdays and Sundays, using an Airbus A319 aircraft with a capacity of 150 seats.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This is a significant achievement in efforts to enhance connectivity between the two countries, create more opportunities for cooperation in tourism, business and cultural exchange, and support the VM2026 campaign.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“At the same time, I’m calling on Cambodia Airways to increase the number of direct flights,” he said in a Facebook post on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tiong said that during the event he also emphasised the importance of strengthening Malaysia-Cambodia ties, particularly in the tourism, arts and culture sectors, as both nations are members of Asean.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Tourism remains a key driver of economic growth, cultural exchange and community empowerment. As the world recovers from the Covid-19 pandemic, a clear and effective strategy is essential to achieve the desired outcomes for the benefit of the people of both countries,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tiong noted that Malaysia’s diversity extends beyond its culture to its landscapes and travel experiences, each offering something unique to every traveller.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He also invited industry players and investors in Cambodia, including policymakers, to forge partnerships, open more air routes, offer attractive travel packages and facilitate easier visa access for travellers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Earlier, Tiong paid a courtesy call on Cambodian Prime Minister Hun Manet, during which they discussed, among other things, opportunities to enhance tourism cooperation between the two countries.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759864",
            "pub_date": "2025-06-21 08:21:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street edges up with Trump's Middle East decision in focus",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Wall Street's main indexes nudged higher on Friday, tracking strength in global stocks after President Donald Trump held off from making an immediate decision on US involvement in the Israel-Iran war.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Trump will take a call in the next two weeks, the White House said on Thursday, as hostilities between the two Middle Eastern countries approached their second week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Markets have been on edge as Trump has kept the world guessing on his plans — veering from proposing a swift diplomatic solution to suggesting the US might join the fight as Israel aims to suppress Tehran's ability to build nuclear weapons.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>A senior Iranian official told <i>Reuters</i> Tehran was ready to discuss limitations on its uranium enrichment, but zero enrichment will be rejected \"especially now under Israel's strikes\". Foreign Minister Abbas Araqchi has arrived in Geneva to meet European counterparts, who are hoping to establish a path back to diplomacy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Any news flow that's going to lean in the direction of de-escalation is going to be a market positive and we're seeing that to a certain extent here,\" said Art Hogan, chief market strategist at B Riley Wealth.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Concerns about price pressures in the US were also in focus after Federal Reserve policymakers on Wednesday warned inflation could pick up pace over the summer as the economic effects of Trump's steep import tariffs kick in. They kept interest rates unchanged.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On Friday, Fed governor Chris Waller said the central bank should consider cutting interest rates at its next meeting given recent tame inflation data and because any price shock from tariffs will be short-lived.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At 10:06am ET, the Dow Jones Industrial Average rose 123.38 points, or 0.29%, to 42,295.04, the S&amp;P 500 gained 13.34 points, or 0.22%, to 5,994.21 and the Nasdaq Composite gained 38.74 points, or 0.20%, to 19,585.01.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Nine of the 11 major S&amp;P 500 sub-sectors rose. Real estate led sector gains with a 0.7% rise. On the flip side, healthcare stocks lost 0.5%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>All three main indexes are set for weekly gains.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Investors are also bracing for any potential spike in volatility from Friday's \"triple witching\" — the simultaneous expiration of single stock options, stock index futures, and stock index options contracts that happens once a quarter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Among megacap stocks, Apple advanced 1.3%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kroger rose 6.4% after the grocery chain increased its annual identical sales forecast.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mondelez International gained 2.4% after brokerage Wells Fargo upgraded the Cadbury parent to \"overweight\" from \"equal-weight\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Accenture fell 7.2% after the IT services provider said new bookings decreased in the third quarter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wall Street's strong gains last month, primarily driven by a softening in Trump's trade stance and strength in corporate earnings, had pushed the benchmark S&amp;P 500 index close to its record peaks before the ongoing conflict in the Middle East made investors risk-averse.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The S&amp;P 500 index now remains 2.4% below its record level, and the tech-heavy Nasdaq is 2.8% lower.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Advancing issues outnumbered decliners by a 2.16-to-1 ratio on the NYSE and by a 1.45-to-1 ratio on the Nasdaq.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The S&amp;P 500 posted 12 new 52-week highs and 2 new lows while the Nasdaq Composite recorded 55 new highs and 31 new lows.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759863",
            "pub_date": "2025-06-21 07:41:25",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Meta partners with sports eyewear brand Oakley to launch AI-powered glasses",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Meta said on Friday it has teamed up with Oakley to release AI-powered smart glasses, expanding its push into wearable tech after the success of Ray-Ban Meta glasses.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The social media company is expanding its partnership with Oakley and Ray-Ban-parent EssilorLuxottica amid growing consumer interest in AI-powered wearable devices.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meta has sold millions of Ray-Ban Meta glasses since their launch and said its \"Oakley Meta HSTN\" will feature a hands-free high-resolution camera, open-ear speakers, water resistance and Meta AI capabilities.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The limited-edition product will be available for preorder starting July 11 at US$499 (RM2,125), with additional products starting at US$399 launching later this summer.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meta said the product line would roll out in North America, Australia and several European countries, with plans to expand to Mexico, India and the United Arab Emirates by the year-end.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Oakley Meta HSTN will debut this month at several major sporting events including Fanatics Fest and UFC International Fight Week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Smaller rival Snap said earlier this month it would launch its smart glasses, called Specs, for consumers next year. Companies such as Google are also exploring similar investments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759861",
            "pub_date": "2025-06-20 23:51:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SD Guthrie, Sime Darby Property, Wasco, Poh Huat, Gadang, Ecobuilt, Maxim, Vanzo",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Here is a brief recap of Friday’s top local business news and corporate announcements:</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Palm oil producer <b>SD Guthrie Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5285\" target=\"_blank\">SDG</a>), formerly known as Sime Darby Plantation Bhd, and its sister company <b>Sime Darby Property Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5288\" target=\"_blank\">SIMEPROP</a>) have entered into an agreement to jointly develop up to 2,000 acres of land on Carey Island, Selangor. The two parties said the agreement, following discussions that began in 2023, will be formalised through the establishment of a special purpose vehicle, which aims to support the Selangor state government’s aspiration to transform Carey Island into an industrial and logistics hub. The development will co-exist with the integrated palm oil operations on the island and complement the activities at Westport and Northport in Port Klang. — <a href=\"https://theedgemalaysia.com/node/759846\" target=\"_blank\"><i>SD Guthrie, Sime Darby Property to co-develop 2,000 acres on Carey Island into industrial, logistics hub</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Wasco Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5142\" target=\"_blank\">WASCO</a>) is planning to list its wholly-owned unit, Wasco Greenergy Bhd, which operates biomass and steam energy businesses, on the Main Market of Bursa Malaysia. The initial public offering will involve up to 150 million shares, comprising an offer for sale of up to 75 million shares by selling shareholders Wasco and Tema Energy Ventures Sdn Bhd, and a public issue of 75 million new shares. The offering represents 30% of Greenergy’s enlarged issued share capital of 500 million shares. — <a href=\"https://theedgemalaysia.com/node/759842\" target=\"_blank\"><i>Wasco plans spin-off listing of biomass energy unit on Bursa</i></a></p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Poh Huat Resources Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/7088\" target=\"_blank\">POHUAT</a>) reported a 92.05% year-on-year drop in quarterly net profit, as demand from the US softened amid tariffs and higher operating costs dented earnings. Net profit for the second quarter ended April 30, 2025 (2QFY2025) came in at just RM575,000, compared with RM7.23 million previously. This is the furniture maker’s worst earnings performance since 4QFY2024, when it reported a net loss of RM3.54 million. Quarterly revenue fell 9.24% to RM98.33 million from RM108.35 million in 2QFY2024 due to lower orders of office furniture from its Malaysian operations, as some customers had front-loaded their orders in the preceding financial period following the election of Donald Trump as US president. — <a href=\"https://theedgemalaysia.com/node/759841\" target=\"_blank\"><i>Poh Huat's quarterly profit slumps on weaker US demand, higher costs</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Gadang Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/9261\" target=\"_blank\">GADANG</a>) has secured a RM92.5 million contract to undertake earthworks for the proposed widening of the Kuala Lumpur-Karak Highway. The contract was awarded to its wholly-owned unit, Gadang Engineering (M) Sdn Bhd, by AFA Construction and Engineering Sdn Bhd on Friday. The scope of work covers Package 2A under the broader highway widening project spanning KM19.2 to KM61.5. — <a href=\"https://theedgemalaysia.com/node/759834\" target=\"_blank\"><i>Gadang bags RM92 mil contract for KL-Karak Highway widening project</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Ecobuilt Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0059\" target=\"_blank\">ECOHLDS</a>) chief executive officer Lim Chin Yen has resigned after just four and a half months at the helm of the construction company. He is succeeded by Fong Tuck Yong, effective June 20. Fong has more than 30 years of experience in leading and overseeing construction projects. — <a href=\"https://theedgemalaysia.com/node/759854\" target=\"_blank\"><i>Ecobuilt CEO Lim Chin Yen resigns after four months</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Maxim Global Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/4022\" target=\"_blank\">MAXIM</a>) has filed an appeal to overturn a stay order granted by the High Court this week that temporarily halts its high-rise residential project here. The stay applies to the development order issued by the Kuala Lumpur City Hall back in October 2017 for the development of five blocks of 30-storey apartments. — <a href=\"https://theedgemalaysia.com/node/759848\" target=\"_blank\"><i>Maxim Global files appeal to overturn court order halting high-rise project</i></a></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><b>Vanzo Holdings Bhd</b> (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0333\" target=\"_blank\">VANZO</a>) is making its entry into Taiwan’s fast-moving consumer goods market by appointing Taiwan-based Xishangxi International Marketing Co Ltd (XIMCL) as its exclusive distributor. The air fragrance maker said its wholly-owned subsidiary Vanzo Asia Sdn Bhd (VASB) has signed an agreement with XIMCL to distribute VASB products through both online platforms and physical retail stores via health and beauty retailer Watsons Taiwan. The two-year agreement takes effect from June 20, 2025, and runs through June 19, 2027. Vanzo products are expected to hit the shelves of some 500 Watsons outlets in Taiwan by September this year. — <a href=\"https://theedgemalaysia.com/node/759853\" target=\"_blank\"><i>Vanzo taps Taiwanese market via local distributor, Watsons</i></a></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759860",
            "pub_date": "2025-06-20 23:31:42",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil dives, stocks rally after Trump Middle East pause",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>LONDON (June 20): Stock markets ticked higher on Friday while oil headed for its biggest daily drop since April after President Donald Trump pushed back a decision on US military involvement in the Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Rising risks from the Middle East have loomed large on the world's top indexes again this week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Europe's main bourses were all between 0.5%-1.4% higher after similar gains across Asia, although it was touch and go whether it would be enough to prevent a second straight weekly loss for MSCI's main world index.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Israel bombed targets in Iran, and Iran fired missiles at Israel overnight as the week-old war continued but Friday's market moves, which also included a modest drop in the dollar, showed an element of relief.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That was largely pinned on Thursday's statement from the White House that Trump will decide in the next two weeks — rather than right away — whether the US will get involved in the war.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European foreign ministers were meeting their Iranian counterpart in Geneva on Friday, seeking a path back to diplomacy over its contested nuclear programme.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The relief the US wasn't charging into the conflict sent oil prices LCOc1 down as low as US$76.10 per barrel, although they are still up 4% for the week and 20% for the month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Brent crude is down 2.5% today in the clearest sign that fears over an imminent escalation in the Israel/Iran conflict have eased,\" MUFG strategist Derek Halpenny said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gold, another traditional safe-haven play for traders, was also lower on the day and Nasdaq, S&amp;P 500, and Dow futures had all moved into the green as Wall Street prepared to get going again having been closed on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Asian shares had gained 0.5% overnight thanks to a 1.2% jump in Hong Kong's Hang Seng and as newly elected President Lee Jae Myung's stimulus plans saw South Korea's Kospi top 3,000 points for the first time since early 2022.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China's central bank held its benchmark lending rates steady as widely expected in Beijing, while data from Japan showed core inflation there hit a two-year high in May, keeping pressure on the Bank of Japan to resume interest rate hikes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That in turn lifted the yen and pushed down the export-heavy Nikkei in Tokyo.</p></div>\n<h3>Oil retreats</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The dollar was ending an otherwise positive week on a modest downer, with the euro EUR=EBS up 0.3% against the US currency at US$1.1527 and the pound 0.2% higher at US$1.3494.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US bond market, which was also closed on Thursday, resumed trading with the key 10-year Treasury bond yield flat at 4.39%, while German 10-year yields, which serve as Europe's borrowing benchmark rate, fell 2.5 basis points to 2.49%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gold prices eased 0.8% to $3,345 an ounce, leaving them set for a weekly loss of 2.5%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But the main commodity market focus remained oil. Brent crude futures LCOc1 were last down US$2.45, or around 3%, at US$76.43 a barrel in London although they were still on track to end the week almost 3% higher.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PVM analyst John Evans said oil producers' \"nightmare scenario\" was that Iran or its proxies could block the Strait of Hormuz, something which has never happened and through which 20 million barrels is shipped each day.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>JPMorgan estimates that amounts to about 20% of all global oil trade and 30% of seaborne oil trade.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The market is currently assigning a probability below 20% to this happening,\" JPMorgan's Francesco Arcangeli wrote in a note, estimating thought that a full closure of the Strait could see oil prices surge to US$120-US$130 a barrel.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759748",
            "pub_date": "2025-06-20 23:21:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla set to open India showrooms in July with made-in-China EVs — Bloomberg",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Tesla Inc is set to open its first showrooms in India in July, people familiar with the discussions said, kicking off formal operations in the world’s third-biggest automobile market as the Elon Musk-led firm hunts for growth amid falling sales in Europe and China.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The electric vehicle giant’s first set of cars have arrived in the country — Model Y rear-wheel drive SUVs shipped from Tesla’s China factory, according to the people, who asked not to be identified as the information is private, as well as documents seen by <i>Bloomberg New</i>s. The Model Y is the world’s largest selling electric car.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla is set to open its first showroom in Mumbai as early as mid-July, which will be followed by one in New Delhi, according to the people. It has also imported Supercharger components, car accessories, merchandise and spares from the US, China and the Netherlands, the documents show.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The debut will end a years-long on-again, off-again saga over Tesla’s entry into India — a market Musk has long eyed but held back from entering due to disagreements over tariffs and local manufacturing. The breakthrough in bringing Tesla to India comes after Musk met Indian Prime Minister Narendra Modi in the US in February. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Bloomberg News</i> reported in February that Tesla was set to ship a few thousand cars to a port near Mumbai.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla spokespersons did not immediately respond to an email seeking comment on opening of the India showrooms and the preparations underway. </p></div>\n<h3>Premium price</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Five Model Y vehicles have already arrived in Mumbai from Tesla’s Shanghai factory, according to documents reviewed by <i>Bloomberg News</i>. The cars were declared at 2.77 million rupees (US$31,988 or RM136,205) and attracted more than 2.1 million rupees in import duties — a levy that’s consistent with India’s 70% tariff on fully-built imported cars under US$40,000 plus surcharges, the documents show.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The model is expected to go on sale for more than US$56,000 before taxes and insurance, though Tesla will determine the final sticker price based on its margin and positioning strategy, according to people familiar with the plans.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That compares with an ex-showroom price of US$44,990 for the same model in the US, which sells for US$37,490 once tax credits are applied.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The premium price tag will likely be a major hurdle to Tesla’s plans as the automaker will need to convince value-driven consumers to open their wallets. EVs account for just over 5% of new passenger vehicle sales in India, but premium cars still represent less than 2% of the market, data with Indian government’s vehicle registration portal show.</p></div>\n<h3>Beefing up</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company hasn’t appointed a new country head following the departure of Prashanth Menon, but is beefing up hiring across charging, retail and policy teams, according to people familiar with the matter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Model Y imports represent an initial foray into the market and Tesla plans to expand its presence, including offering more models.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>It’s leasing warehouse space in Karnataka, in India’s south, and is adding more in Gurugram, outside New Delhi, the people said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla executives from other countries are making weekly visits, the people said, to the Mumbai and New Delhi showrooms, which are in high-profile, luxury business precincts in an effort to attract affluent shoppers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759855",
            "pub_date": "2025-06-20 23:01:33",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ecobuilt CEO Lim Chin Yen resigns after four months",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Ecobuilt Holdings Bhd's (KL:<a class=\"ce-stock\" href=\"/askedge/klse/0059\" target=\"_blank\">ECOHLDS</a>) chief executive officer Lim Chin Yen has resigned after just four and a half months at the helm of the construction company.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a bourse filing on Friday (June 20), the company said Lim, 48, resigned “to dedicate more time to family and pursue personal interest”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Lim is succeeded by Fong Tuck Yong, 52, effective June 20. The company said Fong has more than 30 years of experience in leading and overseeing construction projects.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ecobuilt has been in the red for the past three years. It posted a loss after tax of RM44.5 million in FY2024, RM31.1 million in FY2023 and RM13.6 million in FY2022, according to its annual report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The FY2024 result reflects a 15-month financial period — from June 1, 2023, to Aug 31, 2024 — following a change in the company's financial year-end from May 31 to August 31.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company remained in the red for its latest quarter. It posted a net loss of RM584,000 for the second quarter ended Feb 28, 2025 (2QFY2025) on the back of revenue of RM15.48 million. There is no comparative year-on-year figure due to the change in the company's financial year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company noted that the gross profit generated from ongoing projects during the quarter was insufficient to offset operating expenses, which mainly consisted of depreciation and staff costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Ecobuilt’s shares closed up half a sen or 20% to three sen on Friday, bringing the group a market capitalisation of RM13 million. The stock has fallen 54% over the past one year.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759854",
            "pub_date": "2025-06-20 22:51:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}