{
    "data": [
        {
            "title": "Goldman, Citi see Europe’s economic edge extending stock rally",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The perils of trade and geopolitics will only slow the rally in European stocks rather than derail it, according to Wall Street strategists.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Stoxx Europe 600 Index is expected to end the year around 557 points, according to the average of 19 strategists polled by <i>Bloomberg</i>. That implies a further 3% advance from Wednesday’s close, handing investors annual returns of about 10%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Europe’s loosening monetary policy and increased government spending are forecast to give the region’s stocks the impetus they need to overcome risks from tariffs and rising international tensions. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Equity markets have been remarkably resilient, despite many risks,” said Citigroup Inc strategist Beata Manthey. She noted that global equity market valuations reflected relatively average levels of geo-economic risk in the lead up to the Israel-Iran conflict. “This could be worrisome from a short-term perspective, but over the longer term we see many structural tailwinds to support European equities.”</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/434852310_20250620164850.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/434852310_20250620164850.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European stocks have posted moderate moves since mid-May, following a V-shaped recovery that erased all the losses triggered by the US tariff announcements of early April. Recent weeks have proved more volatile, as Middle East tensions intensified and pushed oil prices higher. The Stoxx Europe 600 is down 1.5% this month, with energy shares and utilities the only sectors in the green.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Many investors we are speaking with are awaiting the end of the truce on US tariffs on July 9 to gain better visibility,” said Societe Generale SA strategist Roland Kaloyan. “Looking ahead, we anticipate that the European equity market will remain within a trading range.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Most strategists have had to chase the rally in Europe as the outlook brightened, updating the cautious price targets they drew up in January. Challenges to so-called US exceptionalism in stocks, Europe’s improving economic prospects, as well as a wide interest-rate differential have fuelled bets on the region.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The positive sentiment is also evident among investors. The Bank of America Corp fund manager survey conducted this month before Middle East tensions escalated showed that a net 34% of European investors expect stocks in the region to rise in the coming months. While that’s broadly unchanged from May, the net proportion expecting gains in the coming 12 months has rebounded to the February high of 75%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On a relative basis, asset allocators are increasingly bullish on Europe. A net 34% of portfolio managers in the BofA survey said they are overweight European equities against their funds’ benchmark levels — close to a four-year high. A net 36% said they are underweight US equities, nearly the most in two years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While investors haven’t lost sight of the risks posed by trade tariffs, they are growing more optimistic about the economy, which will feed into corporate profits, the survey showed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Our view is that the diversification theme has further to go,” said Goldman Sachs Group Inc partner and chief global equity strategist Peter Oppenheimer, adding the weakening dollar favors European assets. “In total returns, European stocks offer quite a compelling story for investors, especially given their starting point of having very concentrated portfolios, particularly in US equities.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European stocks have outperformed US peers this year, but the gap is narrowing. Renewed appetite for American tech megacaps, potential tax cuts and optimism about trade negotiations helped the S&amp;P 500 erase its losses for 2025 last month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, for Deutsche Bank AG strategists led by Maximilian Uleer, who’ve been consistently bullish on the outlook for the Stoxx 600, tariffs will be a bigger burden for US companies than their European peers. Earnings momentum and valuations are more favorable in Europe, while political uncertainty remains more of a problem, they said. The outlook for fiscal policy and interest rates also favours Europe, while a potential ceasefire between Ukraine and Russia would be an additional boost.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Once we have more clarity on US tariffs, the One Big Beautiful Bill, the German budget and fiscal package, as well as Nato spending, markets could start moving higher again in late summer,” the Deutsche Bank team said. “In the medium-term, European equities could start outperforming US equities again.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759805",
            "pub_date": "2025-06-20 17:11:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thai baht hit by political turmoil; Asian currencies set for weekly losses",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The Thai baht weakened on Friday and was set for its biggest weekly drop in four months as political uncertainty weighed on already fragile sentiment, while other regional currencies were also headed for weekly losses on Middle East tensions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The baht fell 0.4% in its fifth session of losses and was on course to log its worst week since late February.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Prime Minister Paetongtarn Shinawatra was facing the prospect of losing her government's majority as the United Thai Nation party, a vital coalition partner, looked set to demand her resignation after just 10 months in power.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This follows the Bhumjaithai Party's withdrawal from the alliance after a leaked phone call with Cambodia's former leader.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The political instability comes against the backdrop of persistent bond outflows driven by low returns and vulnerability to US trade tariffs and the government's call for a weaker baht to support exports and tourism.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"At a time when unprecedented geoeconomic challenges are confronting Thailand, the lack of political leadership/certainty is an unwelcome handicap for trade/diplomacy and wider geopolitical leverage,\" said Vishnu Varathan, head of macro research for Asia excluding Japan at Mizuho Bank, in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The BOT (Bank of Thailand) arguably needs to compensate, hastening another 50-75bp of rate cuts,\" he said, adding that the optimal policy mix for the central bank would be to cut rates while stabilising the baht.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Thai stocks rose 0.3%. Poon Panichpibool, markets strategist at Krung Thai Bank, attributed the rise to a combination of technical rebound and some investors buying stocks on a dip after Thursday's 2.4% fall.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Other regional currencies inched up on the day but were set for weekly losses as investors weighed the possibility of US involvement in the Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Indonesian rupiah was on course for its worst weekly performance since early April, and the Philippine peso was poised for its biggest weekly drop since October.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The South Korean won rose 0.8% on Friday but was set for its second consecutive weekly fall.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, UBS analysts expect continued dollar selling on the back of forex hedging, front-loading of Asian exports before the tariff deadline, and Asia diversification, as evidenced by the won's gains since Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Taiwan's dollar added 0.4%, a day after the country's central bank kept its policy rate unchanged and signalled there was no need for a rate cut this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, the Hong Kong dollar hit the weak end of its trading band for the first time in two years.   </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Regional equities rose on the day, with Seoul shares rising 1.5% to cross the 3,000 mark for the first time since January 2022. Indian equities added 0.9%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759803",
            "pub_date": "2025-06-20 17:01:59",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HK stocks log worst week since April as absence of fresh stimulus weighs",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SHANGHAI (June 20): Hong Kong stocks rebounded on Friday but still logged their steepest weekly decline since April, as the lack of new stimulus measures this week weighed on investor sentiment amid broader global tensions surrounding the Iran-Israel conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Hong Kong stock market had witnessed a steady recovery over recent weeks, rebounding from losses triggered by reciprocal tariffs imposed by US President Donald Trump. The benchmark Hang Seng Index has advanced 17% year-to-date.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The Lujiazui forum this week offered no new measures to boost the capital market, which was a potential letdown for some investors,\" said Jason Chan, senior investment strategist at Bank of East Asia.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The two-day gathering of top financial regulators and market participants at the annual Lujiazui Forum wrapped up on Thursday, delivering few surprises for market participants.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Sentiment is expected to remain weak, with the persistent risk of an escalation in Middle East tensions continuing to cast a shadow over markets, Chan said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The market could stay range-bound in the short term.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China kept its benchmark lending rates unchanged on Friday, as expected, after rolling out sweeping monetary easing measures last month to support the economy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China's blue-chip CSI300 Index closed 0.1% higher, while the Shanghai Composite Index lost 0.1%. Hong Kong benchmark Hang Seng was up 1.3%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the week, the Hang Seng Index was down 1.5%, the biggest drop since the week of April 7, while the CSI300 Index was down 0.5%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hong Kong's pullback was also exacerbated by fading interest from mainland investors. Their purchases via the Stock Connect scheme have slowed sharply in recent weeks, with net buying this week amounting to just 16 billion yuan (US$2.23 billion) — only 20% of the peak recorded in April.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The CSI Liquor Index rose 2.2%, leading gains onshore, after the index lost 12% this year on weak consumer demand and a government ban on civil servants dining out.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Amid uncertainties related to China-US trade friction, onshore share valuations may be range-bound at low levels near term, UBS strategist Lei Meng said in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We expect limited downside, and potential upside catalysts mainly from stronger policy easing, the continual entry of medium or long-term funds and structural reforms,\" Meng said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of \"Blind Box\" toymaker Pop Mart dropped nearly 4% after state media outlet <em>People's Daily</em> called for stricter regulation of the blind box industry, citing expert views. The stock has fallen 13% this week, but soared 165% this year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759804",
            "pub_date": "2025-06-20 17:01:52",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US tariff spike hits China’s small parcels, squeezing exporters",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): US tariff hikes on small packages from China triggered a slump in shipments last month, contributing to a huge drop in bilateral trade and roiling exporters like Shein Group Ltd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The value of small parcels sent from China to the US fell to just over US$1 billion (RM4.26 billion) in May, the least since early 2023, according to customs data released Friday. The 40% plunge from the same month last year marks a sharp reversal for a booming trade route, coming just as the US government eliminated a long-standing tariff loophole.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The policy shift is upending the business models of fast-fashion titan Shein and its rival Temu, which relied on the exemption to send goods directly to US customers free of tariffs. It’s also squeezing thousands of small merchants who relied on the model as a low-cost entry into the world’s largest consumer market.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Without the exemption, it would mean tougher business to us, and much fewer options for consumers, and potentially higher prices,” said Wang Yuhao, whose Kunming-based incense company, Shantivale, recently began selling to the US. “This is a lose-lose situation.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the entrepreneur, the new tariffs and logistical fees of direct shipping now would mean losing US$2 on every parcel. To avoid the additional cost, Wang said he has pivoted to bulk shipments to US warehouses, a move that demanded an upfront investment of more than 100,000 yuan (US$13,800 or RM59,197) for inventory and storage.</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/chinese-package-20062025-bloomberg_20250620145915.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/chinese-package-20062025-bloomberg_20250620145915.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The source of the disruption is the end of the “de minimis” rule exemption for Chinese and Hong Kong shipments. Previously, packages valued under US$800 could enter the US duty-free. Since May 2, those parcels face tariffs as high as 54% after the Trump administration moved to close what it deemed an unfair trade loophole.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The impact on the largest players was swift. Shein raised US prices on items from dresses to kitchenware ahead of the hike to cover the costs of the higher tariffs, according to data compiled by <em>Bloomberg News</em>. In the week after the tariffs took effect, both Shein and Temu saw double-digit sales declines, an early sign the punitive measures are eroding their popularity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Even with the drop, the US remained the largest single destination for China’s small parcels, the data showed. Malaysia followed by taking more than US$700 million worth of such shipments last month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Globally, small parcel shipments rose 40% in May compared to a year ago, with Belgium, South Korea, Hong Kong and Hungary among other large destinations.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759784",
            "pub_date": "2025-06-20 16:41:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s rare earth magnet exports slump in May, especially to US",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Chinese exports of rare earth magnets slumped further in May, with shipments to the US showing an especially steep drop due to the trade war with Washington.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Rare earth minerals, and the products that use the elements, have been at the centre of the dispute since early April, when China imposed export controls in retaliation for punitive tariffs levied on Chinese goods. The two countries have since sought to reset relations, culminating in a meeting in London in early June, which prompted US President Donald Trump to declare that issues around rare earths had been resolved. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China accounts for about 90% of the world’s rare earth products, most of which are magnets, and whether it allows supplies to flow more freely after the agreement reached in London will be a key focus for governments and markets in the weeks and months to come. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"mt-3 imgw-300 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/Chinese-magnet-exports_20250620145615.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/Chinese-magnet-exports_20250620145615.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Chinese customs data on Friday showed the extent of the impact on supplies of rare earth magnets in particular, an item vital for high-tech industries from carmakers to defence contractors. The controls have affected sales to all countries, with China’s total exports roughly halving in April, and then halving again in May, to 1,238 tonnes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That comes to about US$60 million (RM255.41 million), the lowest-value month in data going back to 2015, barring February 2020 and the onset of the pandemic.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US portion by volume in May was just 46 tonnes, less than one-tenth of the magnets it imported in March. Other countries including Vietnam, host to a number of Chinese companies, and Germany saw their supplies hold up much better. Those two countries were the top destinations last month, accounting for 19% and 17% of sales, respectively.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759783",
            "pub_date": "2025-06-20 16:11:55",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stocks with momentum on June 20, 2025: Auro Holdings, TMK Chemical",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): theedgemalaysia.com highlighted two stocks with momentum at Bursa Malaysia’s afternoon close on Friday, one showing positive and the other negative momentum.</p></div>\n<h3>The stock with positive momentum was:</h3>\n<ul>\n<li>Auro Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5025\" target=\"_blank\">AURO</a>) — unchanged at 16.5 sen</li>\n</ul>\n<h3>The stock with negative momentum was:</h3>\n<ul>\n<li>TMK Chemical Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5330\" target=\"_blank\">TMK</a>) — up four sen or 3.3% at RM1.24</li>\n</ul>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The list of stocks with momentum is generated using a proprietary mathematical algorithm highlighting stocks with a build-up in trading volume and price. The algorithm differentiates between stocks that exhibit positive (+ve) momentum and negative (-ve) momentum.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This list is not a buy or sell recommendation. It merely tells you which stocks are seeing higher-than-normal volume and price movements.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The share price may move up or down from this point. But the “+ve” (suggesting a rising price trend on volume) and “-ve” (suggesting a falling price trend on volume) indicators should give readers a better idea of what the market is buying and when to sell. Note also that momentum generally only persists for a short period of time.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, each stock has an accompanying fundamental score and valuation score to help readers evaluate the attractiveness of the stocks if they want to ride the momentum.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For more detailed financial information and reports on the above-mentioned stocks, please subscribe to AbsolutelyStocks at <a href=\"http://bit.ly/AbsolutelyStocks\" target=\"_blank\">www.absolutelystocks.com</a></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759780",
            "pub_date": "2025-06-20 15:11:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SoftBank pitches US$1 tril US AI hub to TSMC, Trump team, Bloomberg reports",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): SoftBank Group Corp founder Masayoshi Son is seeking to team up with Taiwan Semiconductor Manufacturing Co (TSMC) to realise what could be his biggest bet yet — a trillion-dollar industrial complex in Arizona to build robots and artificial intelligence (AI).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son envisions a version of the vast manufacturing hub of China’s Shenzhen that would bring back high-tech manufacturing to the US, according to people familiar with the billionaire’s thinking. The park may comprise production lines for AI-powered industrial robots, they said, asking not to be named as the plan remains private.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank officials are keen to have the Taiwanese maker of Nvidia Corp’s advanced AI chips play a prominent role in the project, although it’s not clear what part Son sees for TSMC, which already plans to invest US$165 billion (RM702.16 billion) in the US and has started mass production at its first Arizona factory. Nor is it clear that TSMC would be interested. A person familiar with the chipmaker’s thinking said that SoftBank’s project has no bearing on TSMC’s plans in Phoenix.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of SoftBank jumped as much as 2.3% in Tokyo Friday. TSMC’s stock price rose 1.9% in Taipei.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Codenamed “Project Crystal Land”, the Arizona complex represents the 67-year-old SoftBank chief’s most ambitious attempt in a career that’s spanned numerous bet-the-house bids, thousands-fold returns and billions of dollars in losses. Son, who’s often expressed disappointment in his own legacy, has repeatedly said he means to do everything he can to hurry AI development. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank officials have spoken with federal and state government officials to discuss possible tax breaks for companies building factories or otherwise investing in the industrial park, including talks with US Secretary of Commerce Howard Lutnick, the people said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Japanese billionaire is also personally sounding out interest among an array of tech companies, they said. The project has been floated to executives at South Korea’s Samsung Electronics Co, they said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Representatives of SoftBank, TSMC and Samsung declined to comment. A Commerce Department spokesperson did not immediately respond to a request for comment. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son has pulled together a list of SoftBank Vision Fund portfolio companies that might take part in the Arizona manufacturing hub, the people said. SoftBank-backed startups working on robotics and automation technologies — such as Agile Robots SE — may set up production facilities at the industrial complex, they said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The plans are preliminary and feasibility hinges on support from the Trump administration and state officials. While the cost of the project as envisioned by Son may require as much as US$1 trillion to execute — a sum previously reported by the Nikkei — the actual scale depends on interest from big technology companies. If successful, Son has floated building multiple cutting-edge industrial parks across the US.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank is exploring the Arizona project as it also moves forward on plans to invest as much as US$30 billion into OpenAI and plans a US$6.5 billion acquisition of Ampere Computing LLC. It’s also seeding money into the Stargate venture with OpenAI, Oracle Corp and Abu Dhabi’s MGX, seeking to ferry hundreds of billions of dollars into data centres and related infrastructure around the world.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Those outlays come as SoftBank’s cash stood at ¥3.4 trillion (US$23 billion or RM100 billion) at the end of March. The Tokyo-based company has since tapped its T-Mobile US Inc stake, selling roughly a quarter of what it held in March to raise US$4.8 billion this month. SoftBank also has net assets valued at ¥25.7 trillion, of which chip designer Arm Holdings plc makes the single largest portion, allowing it to borrow billions more as needed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank’s exploring project financing for Stargate data centres, a model that could be adapted to a big endeavour like Crystal Land. Common for large-scale infrastructure like oil or gas pipelines, the project finance template would allow the tech investor to raise funding on a project-by-project basis and require less money upfront.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son’s restless search for growth has resulted in projects that proceed in fits and starts, making it difficult to gauge how committed he is to any one venture. The billionaire is often goaded by the desire to boost SoftBank’s stock price and repay retail investors who’ve held onto the company’s shares from before the dot-com boom and bust, people close to the SoftBank chief have said. Many investors have waited for decades for the stock to regain dot-com bubble levels — something it’s flirted with only a few times since 2020. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>If Son’s primary motivation is to clear the way for AI, it may be more cost-efficient to encourage partnerships that link manufacturing expertise with that of AI engineers and specialists in fields from medicine to robotics, and incubating smaller companies, according to Melissa Otto, head of research at Visible Alpha. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But pouring cash into data centres may help lower the cost of developing AI applications and spur broader adoption, she said. “He’s a long-term thinker, and he takes risks,” Otto said. “It’s just too early to tell.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759781",
            "pub_date": "2025-06-20 15:11:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rakuten Trade lowers FBM KLCI target to 1,630 on absence of strong catalysts",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Rakuten Trade Sdn Bhd has cut its year-end projection for the benchmark FBM KLCI target to 1,630 from 1,730 previously, citing earnings downgrades across key sectors and a lack of strong domestic catalysts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Its head of research Kenny Yee Shen Pin said that Malaysian equities remain fundamentally sound but have suffered from diminishing investor interest, both foreign and retail, due to the uninspiring outlook.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“In terms of fundamentals, there were notable earnings downgrades following the recent results season, most prominently in the banking sector, where projected earnings growth was slashed from 6.6% to 3.3%. Telcos were also hit, particularly Axiata [Axiata Group Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/6888\" target=\"_blank\">AXIATA</a>)], which saw negative earnings growth,” he said during the Rakuten Trade 3Q2025 virtual market outlook media briefing.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Overall, the fund manager has cut its earnings growth forecast across all industries for 2025 to 5.0% from 9.2% previously.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Yee noted that the local bourse is currently trading at 12 to 13 times forward earnings, below the historical average of 16 times. “This suggests Malaysian equities are relatively undervalued. However, in the absence of fresh catalysts, sentiment remains tepid,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The bearish sentiment comes at a time when the market is bracing for a volatile mix of external and domestic headwinds, including the potential direct US involvement in the Israel–Iran conflict. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The heightened geopolitical risks in the Middle East have raised worries of US stagflation risks to the impending rollout of Trump’s reciprocal tariffs, alongside the looming maturity of over US$1 trillion in US Treasury bills by month-end. Domestically, sentiment is expected to remain cautious, weighed down by uncertainty over a pending US–Malaysia tariff agreement. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Yee also expressed concern over sustained net foreign outflows from Malaysian equities, amounting to RM11.2 billion so far this year, on top of the RM4 billion in 2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, he highlighted that foreign shareholding has held steady at around 19%, indicating that “longer-term investors are still in the market while short-term funds continue to exit”.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Retail participation has also dwindled, with average trading volumes remaining low and initial public offering interest waning. Yee said the daily trading volume on Bursa Malaysia is struggling to exceed six billion shares, adding that retail investors appear to be waiting for a clear market catalyst before re-entering.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Despite Malaysia being relatively stable both economically and politically, the lack of excitement in the market is evident. Investors are staying on the sidelines,” he added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On strategy, the fund manager maintains an \"overweight\" call on sectors such as construction, banking, oil and gas, and healthcare — supported by robust infrastructure spending, resilient earnings, and strong demand drivers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the other hand, it remains neutral on the consumer, property, and plantation sectors due to headwinds such as sales and service tax expansion, crude palm oil (CPO) price volatility, and subsidy rationalisation.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“If tensions in the region were to escalate further, we may see commodity prices, including CPO, spike as part of a broader flight to food and resource security,” Rakuten Trade vice president of research Thong Pak Leng added. “If CPO prices breach the RM4,500 threshold sustainably, we may revisit our sector call and upgrade to overweight.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Its top choices include RHB Bank Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/1066\" target=\"_blank\">RHBBANK</a>) because, despite a shortfall in net interest margin, it believes it could improve towards its target of 1.86% for the year; CelcomDigi Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/6947\" target=\"_blank\">CDB</a>) due to upcoming annual cost savings and ongoing integration efforts; and Gamuda Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5398\" target=\"_blank\">GAMUDA</a>) because of a strong order book that provides long-term earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759773\" target=\"_blank\">Ringgit seen strengthening amid global de-dollarisation, US policy headwinds, says Rakuten Trade</a></em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Isabelle Francis</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759775",
            "pub_date": "2025-06-20 15:01:41",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NTT secures backing for US$16.3b deal to take over AI arm",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Nippon Telegraph and Telephone Corp said it has secured enough bids to buy NTT Data Group Corp, with the deal worth ¥2.37 trillion (US$16.3 billion or RM69 billion) expected to boost its AI ambitions and simplify the corporate structure.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Japanese company will start the settlement on June 26, it said in a statement Friday. NTT, which owns about 58% of NTT Data, had last month offered ¥4,000 for every share it doesn’t already own in the company with plans to take it private.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The takeover of NTT Data, one of the world’s largest data centre operators, would put artificial intelligence at the heart of NTT group, expanding the global reach of its various units.  About one-third owned by the government, NTT competes with KDDI Corp and SoftBank Corp in the growing AI race, at a time Tokyo is pushing companies to develop a homegrown AI platform to vie with the likes of OpenAI and China’s DeepSeek.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move also comes as Japanese conglomerates are under pressure from regulators to streamline their corporate structures. In February, the Tokyo Stock Exchange cautioned companies with parent-affiliate listings to better protect minority shareholders’ interests, stepping up its long-burning campaign to reduce such arrangements. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Since then, NEC Corp has acquired unit NEC Networks &amp; System Integration Corp, while <em>Bloomberg News</em> reported Toyota Motor Corp chairman Akio Toyoda’s plan to buy Toyota Industries Corp. The moves have fuelled speculation that more firms may follow suit. NTT previously acquired its cash-generating wireless carrier NTT Docomo Inc in 2020.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759771",
            "pub_date": "2025-06-20 14:51:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tencent Music shares double on break from China price cut script",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): China tech investors weary of the nation’s relentless price competition can look to one pocket that’s thriving by moving in the opposite direction: online music.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hong Kong-listed shares of Tencent Music Entertainment Group and smaller rival NetEase Cloud Music Inc have more than doubled since the end of 2023, outperforming most Chinese internet peers. That’s come as they shift to focus on monetisation of their loyal user bases while beefing up their podcast and live event offerings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tencent Music has notched four-straight quarters of growth in revenue per paying user by successfully driving subscribers to more expensive plans. That’s a refreshing break from the frequent headlines on deep price cuts for EVs and e-commerce that has sparked volatility in China tech stocks in recent years.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Music is becoming more important to the lives of young people in China, and you’re not going to just save one or two yuan to abandon all your playlists and jump to another platform,” said Ivan Su, an analyst at Morningstar Inc. “The monthly subscription price — which costs about the same as a cup of coffee — is very low.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Chinese online music industry has consolidated over the past few years, leaving the units of Tencent Holdings Ltd and NetEase Inc in a virtual duopoly. Spotify is blocked by a firewall in China.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tencent Music is the leader with about 555 million monthly active users as of the end of March, some 22% of which were paid subscribers. That compares with a paid penetration rate of around 40% for Spotify.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One of the key planks of Tencent Music’s monetisation strategy is its Super Premium VIP tier, where users pay roughly US$4 per month for exclusive content plus early access to special artist merchandise and live events. Subscribers pay about US$2 for a basic monthly subscription.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The percentage of premium members relative to all paying users could rise to 19% in 2027 from 12% this year, Goldman Sachs Group Inc analysts including Lincoln Kong wrote in a note this week. The bank added they expect 10% growth in average revenue per paid user this year and high-single digits for 2026 onward.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Like Spotify, Tencent Music is also making moves into other services. This month it announced a plan to buy Chinese podcasting start-up Ximalaya, and in May it disclosed its purchase of a stake in South Korean K-pop agency SM Entertainment Co.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There are a lot of innovative ways for the leading players to monetise their users, and all of these are very affordable items in this environment,” said Agnes Ng, a portfolio specialist at T Rowe Price Group Inc. “With only two major players left in the market, competition is very benign and market share is stable.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Morningstar’s Su said that NetEase Cloud’s stock has outperformed as it “turned profitable a lot quicker than people expected”. On the other hand, Tencent Music has a “much more robust content library”, with a broader user base.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The subsector’s big gains have made the stocks somewhat pricier. Tencent Music shares are trading at 21 times forward earnings estimates, above their three-year average but well below Spotify’s nearly 60 times. NetEase Cloud Music is at 24 times.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tencent Music’s valuations “still look attractive, particularly when compared to Spotify”, while content-related stocks overall have been enjoying a premium due to lower exposure to tariffs, said Kevin Net, the head of Asian equities at Financiere de L Echiquier. “I think investors like its 70%+ market share in an underpenetrated market, with potential for price increases.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Siow Chen Ming</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759774",
            "pub_date": "2025-06-20 14:51:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SST expansion: CIMB Securities sees limited direct impact on auto sector",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): CIMB Securities has projected the upcoming sales and service tax (SST) expansion in July to have limited direct impact on the automotive sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">In a research note, it said vehicle sales are already subject to a 10% sales tax, while maintenance and repair services incur an 8% service tax. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"That said, there may be a slight increase in dealership and showroom rental costs due to the measure, although we believe the impact will be minimal. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"Indirectly, however, weaker consumer sentiment could weigh on new vehicle sales in the second half of 2025 (2H2025),\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">The Malaysian Automotive Association has reportedly projected a 4.5% year-on-year (y-o-y) decline in total industry volume (TIV) to 780,000 units in 2025, attributing this to demand normalisation and a reduced industry order backlog. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">CIMB Securities has, however, forecasted a sharper 7.0% y-o-y decline in TIV to 760,000 units, due to potential headwinds from the planned removal of the RON95 petrol subsidy in 2H2025, which Prime Minister Datuk Seri Anwar Ibrahim has affirmed will proceed as part of the government’s subsidy rationalisation. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"Despite this, we expect demand in the sub-RM100,000 segment to remain resilient, supported by national brands and selective entry-level Japanese models. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"We project national brands to retain a dominant 64.5% market share in 2025, with non-national marques accounting for the remaining 35.5%,\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">CIMB Securities also believes the removal of fuel subsidies could accelerate battery electric vehicle (BEV) adoption. BEV sales nearly doubled y-o-y in the first quarter (1Q2025) to 5,394 units from 2,703 units a year ago, with combined BEV and hybrid penetration rising 1.9 percentage points y-o-y to 7.3%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">\"With full duty exemption for imported EVs set to expire by end-2025, and the government unlikely to extend it beyond the deadline, we expect a potential spike in EV demand in 4Q2025 as buyers rush to benefit from tax savings,\" it said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\">CIMB Securities maintained its 'neutral' call on the sector due to a subdued growth outlook amid intensifying market competition. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p dir=\"ltr\"><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/759433\" target=\"_blank\">MAA sees vehicle sales remaining soft in June after 3% y-o-y dip in May</a></em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759769",
            "pub_date": "2025-06-20 14:41:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia’s exports dip for first time in 2025, sharply shrinking trade surplus, official data show",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Malaysia’s exports fell in May for the first time this year amid sharp decline in shipments of petroleum products and lower deliveries to China and Japan, official data on Friday showed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The decline overshadowed continued surge of exports to the US amid a 90-day pause on a sweeping set of steep tariffs. All in all, exports slipped 1.1% year-on-year and 5.2% month-on-month to RM126.62 billion, the Ministry of Investment, Trade and Industry (Miti) said in a statement.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Malaysia stands to benefit “significantly” from expansion in global semiconductor sales despite uncertainties in global economic conditions, Miti said. “While the sector’s outlook remains positive, proactive policy responses will be crucial to sustain this growth momentum,” the ministry added.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shipments of electrical and electronics (E&amp;E) products — which made up over 42.4% of total exports — rose 7% year-on-year in May followed by a 16.4% increase in exports of machinery, equipment, and parts. However, exports of petroleum products fell nearly 30%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In terms of markets, deliveries to Malaysia’s largest trading partner China fell 4.3% in May when compared with the same month last year, due to lower exports of liquefied natural gas, metal and paper products.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Exports to the US were up 16%, the eighth consecutive month of double-digit growth, driven by electronics and processed food as well as machinery, equipment and parts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, gross imports climbed 6.6% year-on-year to RM125.86 billion, lifted by higher inbound shipments of E&amp;E products and machinery-related goods.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Capital goods imports surged 63.7%, mainly due to increased purchases of non-transport capital goods. Imports of intermediate goods — components and materials used in the final assembly of products such as cars and computers — fell 4.4% due to primary fuels and lubricants.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Imports of consumption goods dipped 1.1% from softer demand for primary food and beverages for household consumption.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On a month-on-month basis, total imports were down 2%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The decline in exports, coupled with the rise in imports, sharply narrowed the trade surplus in May to RM766.3 million in May. Trade surplus was down 92.3% on a year-on-year basis and shrank 85.2% month-on-month. </p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759764",
            "pub_date": "2025-06-20 14:21:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Proposed EPF health insurance scheme will be voluntary, says minister",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The government’s proposed health insurance scheme, to be funded through Account 2 of the Employees Provident Fund (EPF), will be voluntary and not mandatory, said Health Minister Datuk Seri Dr Dzulkefly Ahmad.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said the initiative aims to offer EPF contributors the option of broader insurance coverage, as currently, 32% of healthcare costs are paid out-of-pocket by patients without insurance protection.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Through this approach, the government hopes to expand access to faster, higher-quality private healthcare without increasing the financial burden on the people,\" he said in a Facebook post on Friday.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Dzulkefly added that the proposal draws inspiration from countries like Singapore, which prioritise insurance access for the majority of citizens.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“It doesn’t come out of their pockets. Only about 1% of Account 2 would be used to pay for insurance. This is the best way,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On Thursday, Dzulkefly was reported as saying that the government is considering allowing Malaysians to use their EPF Account 2 to pay monthly health insurance premiums.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>If implemented, it would enable 16 million EPF members to utilise their contributions to access private hospital care. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:</em><br/>\n<em><a href=\"https://theedgemalaysia.com/node/759525\" target=\"_blank\">Private hospitals subjected to DRG system, says health minister</a><br/>\n<a href=\"https://theedgemalaysia.com/node/759513\" target=\"_blank\">Govt looks to Reset strategy to tame rising healthcare costs, overhaul financing model</a></em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759763",
            "pub_date": "2025-06-20 14:11:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Temu's sales in US plunge 25% following cuts in advertising spending",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Temu’s sales decline in the US is deepening as the online marketplace drastically cuts spending on advertising targeting American consumers, signalling a shift in focus after President Donald Trump’s tariff barrage.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Compared to a year ago, Temu’s weekly sales dropped more than 25% in the period from May 11 through June 8, according to Bloomberg Second Measure, which analyses credit and debit card data. That’s in contrast to other e-commerce platforms run by Shein, Walmart Inc and Amazon.com Inc, where weekly sales have all returned to year-on-year growth since Trump’s trade truce with China in mid-May. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The deepening sales decline comes alongside Temu’s cut in advertising spending, an abrupt turnaround in strategy after it spent big last year to attract the attention of US shoppers, including running commercials on Super Bowl night. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"mt-3 imgw-300 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/Temu-US-sales_20250620123617.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/Temu-US-sales_20250620123617.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>From creating thousands to tens of thousands of new advertisements daily before April 10, the numbers are now down to dozens or even single digits, with some days in June seeing no new commercials, according to analytics company AppGrowing Global.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Temu’s sales growth has always been glued to their aggressive advertisements,” said Wu Yanwei, chief content director of AppGrowing’s parent YouCloud. “The abrupt slowdown in advertisement spending is likely turning its growth engines off” in the US, Wu said, noting that Temu was channelling ad spending towards other markets including Europe.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While declining to specifically comment on sales and ad numbers, a spokesperson for Temu said the company has been working with local merchants across regions to deliver stable pricing to consumers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Temu and Chinese e—commerce shopping platforms such as Shein had for years relied on a tariff exemption on small parcels to ship cheap clothing and household goods to American consumers duty-free. After President Donald Trump plugged that loophole this year, they largely lost the discount-appeal that drew US shoppers in droves.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, Shein’s US sales have fared relatively better in recent months. It has managed to reverse a drop in sales to return to growth from June 1, Bloomberg Second Measure data showed. Shein’s single-digit growth since then is similar to levels posted by Walmart’s e-commerce platform. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shein’s advertising in the US has remained more stable than Temu, with the number of new commercials most days this year being anywhere between dozens to a few hundreds, according to AppGrowing Global.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em><br/>\n </p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759762",
            "pub_date": "2025-06-20 13:31:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil could spike to US$90 if Strait of Hormuz shut, says Citigroup",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Brent crude could jump to around US$90 (RM383.12) a barrel if the Strait of Hormuz is closed, according to Citigroup Inc, which added that a prolonged halt to shipping through the crucial waterway would be unlikely.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Any closure of the Strait could lead to a sharp price spike,” analysts including Anthony Yuen and Eric Lee wrote in a note, citing the bank’s current bullish case scenario. “But we think the duration should be short, as all efforts would focus on a reopening, so that it should not be a multi-month closure.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Strait of Hormuz is a narrow waterway at the entrance to the Persian Gulf, through which about a fifth of the world’s daily output passes, including from major Opec producers Saudi Arabia and Iraq. Citigroup’s prediction implies around three million barrels a day being disrupted over several months.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Any disruption to Iranian crude exports could have a smaller price impact than expected, according to Citigroup. The country’s shipments have been falling and Chinese refineries are buying less, the bank said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Brent futures are currently trading around US$77 a barrel.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759761",
            "pub_date": "2025-06-20 13:21:29",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s warning on blind-box toys sends Pop Mart shares sliding",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Pop Mart International Group Ltd shares dropped in Hong Kong after a Chinese state media commentary called for stricter regulation of blind-box toys and trading cards, stoking concern over the company’s wildly popular Labubu dolls business.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While the commentary didn’t call out Pop Mart by name, it spooked traders who have propelled the company’s stock to a nearly 170% gain this year amid the craze for its toothy monster dolls. Pop Mart often sells its dolls inside a blind box, which means the buyer doesn’t know what specific character is inside until they open it. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of the Beijing-based toymaker, which has a market value of about US$40 billion (RM170.16 billion), dropped as much as 6.2% after tumbling 5.3% on Thursday. Bloks Group Ltd, which sells similar products, fell as much as 7.7%. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China should further refine regulations for “blind cards” and “mystery boxes” as some of the current business models induce minors to become addicted to purchasing these products, according to a feature story carried on the 19th page of the<em> People’s Daily</em>, the flagship newspaper of the Chinese Communist Party, citing legal experts. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The commentary has weighed on investor sentiment, flashing some overheating signs in its business,” said Steven Leung, an executive director at UOB Kay Hian Hong Kong Ltd, referring to Pop Mart. “Still, it’s a mild reminder as it didn’t come directly from a government official.”</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/Labubu_20250620120241.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/Labubu_20250620120241.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In China, the government prohibits sales of blind boxes to children under the age of eight due to concern over potential addiction. Before the authorities imposed such guidelines in 2023, regulatory risk was a key concern among investors. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But even with the slump this week, Pop Mart shares are still the best performers in the MSCI China Index, as consumer fervour for its toys has turned it into one of the hottest Chinese growth companies. Wall Street analysts have been increasing their price targets for the company, citing the growing influence of its intellectual property.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Celebrities including Rihanna and BlackPink’s Lisa have been spotted carrying Pop Mart’s toys, making it one of China’s most notable consumer brands to gain popularity globally. Policymakers in Beijing have sought to encourage such success stories, which may temper expectations for a more disruptive crackdown.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Kayou, a Chinese maker of trading cards, pushed back its plan for an initial public offering in Hong Kong last year after negative publicity surrounding the industry from Chinese state media. It refiled for the listing in April.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759760",
            "pub_date": "2025-06-20 13:01:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Industry working group set up to boost cyber-resilience across Malaysian stockbroking system",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): A dedicated industry working group has been formed to boost cyber resilience across the Malaysian stockbroking ecosystem, the stock exchange operator announced on Friday. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The industry working group, chaired by Bursa Malaysia Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/1818\" target=\"_blank\">BURSA</a>) chief regulatory officer Julian M Hashim, comprises representatives from four bank-backed brokers, two non-bank brokers, and two subject matter experts in the field of cybersecurity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The industry working group targets to finalise its recommendation paper within four months, with the subsequent implementation phase focused on the execution of the recommendations,” the operator of the Malaysian stock exchange said in a statement.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move follows a widely-reported incident of unauthorised trades of a handful of securities on April 24 involving about 80 accounts at several brokers. Since then, stockbrokoing firms have been asking their clients to reset their passwords and take other precautionary measures.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On May 21, Bursa Malaysia sent out a directive to mandate that all stockbroking firms implement multi-factor authentication by the end of 2025.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The industry working group represents a concerted effort to strengthen the cyber resiliency of our trading ecosystem,” Bursa Malaysia chief executive officer Datuk Fad’l Mohamed said. “Cyber resiliency is not just a technology best practice — it is the cornerstone of a trusted and vibrant capital market.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The group held its inaugural meeting on June 17, where it finalised its terms of reference, including assessing current cybersecurity practices and identifying systemic vulnerabilities within the stockbroking ecosystem.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Its mandate also calls for developing industry-wide standards and best practices for information and communication technology risk management and incident response as well as recommending enhancements to regulatory frameworks and operational protocols to improve cyber resilience.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Recognising the diversity in operational complexity across stockbroking firms, consultation with the industry will be carried out to ensure the recommendation paper is practical and fit for purpose,” Bursa Malaysia added.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759756",
            "pub_date": "2025-06-20 12:51:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Morgan Stanley says Hong Kong’s housing sector is bottoming out",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): Hong Kong’s residential property market is poised for a recovery after enduring a seven-year downturn, according to Morgan Stanley.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Home prices in the city are set to bottom out, driven by an influx of mainland Chinese buyers, improved capital markets and a recent plunge in interest rates, analysts led by Praveen Choudhary said in a report dated June 19.  </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“While we may be early, we see several reasons to be optimistic that we could be at the onset of an up cycle, which could last four to five years,” the analysts said. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mainland buyers are bolstering Hong Kong’s residential market, as the city’s rental yields now surpass those in tier-one Chinese cities, fuelling increased investment demand. Additionally, a recovering capital market is generating a wealth effect that further supports housing demand, they added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The lower interest rates will also support the market. The one-month Hong Kong Interbank Offered Rate is hovering at the lowest level in three years after plunging last month. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, challenges remain with a surging number of unsold apartment inventory, rising underwater mortgage cases, and an increasing unemployment rate in the city, according to the report. Some developers will still have a hard time operating despite a recovering market. The bank cautions on New World Development Co because of its liquidity crunch.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Morgan Stanley expects home prices to stop their decline and grow 2% in the second half of the year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759758",
            "pub_date": "2025-06-20 12:51:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KLCI's next pullback could spark opportunities to accumulate blue chips — analysts",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Investors should stand ready to accumulate blue-chip stocks, anticipating that the next pullback in the FBM KLCI, particularly if it dips below the critical 1,500-point psychological level, said analysts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>At the Friday opening bell, the benchmark index slipped as much as 1.4 points to 1,500.04 from the previous day’s close of 1,501.44. It later rebounded slightly to 1,501.77 points.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Broader market sentiment remained negative, with 341 decliners outnumbering 205 gainers, while 383 counters were unchanged.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Financial Services index was the only sector in the green, rising 0.5%. Among the worst performers were real estate investment trusts (REITs), down 0.86%, followed by telecommunications and media (-0.77%) and construction (-0.59%).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The cautious mood in the stock market comes amid heightened geopolitical risks in the Middle East, as US President Donald Trump is reportedly set to decide within two weeks whether to involve the US in the ongoing Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Sentiment was also dampened by the US Federal Reserve’s hawkish surprise, projecting only one rate cut in 2025 and signalling higher long-term interest rates.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Rakuten Trade has advised clients to accumulate blue-chip stocks, expecting continued foreign selling pressure on Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We would advocate our clients to accumulate blue chips if and when the index dips below the 1,500 mark, around the 1,480 level,\" it said in a note.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Separately, Apex Securities said investors are likely to focus on defensive sectors such as REITs, banks, and utilities, as the market is expected to remain range-bound and volatile until clearer catalysts emerge.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The energy sector may also remain in favour due to the ongoing geopolitical tensions, it added, while the consumer and industrial sectors could continue to face pressure from the upcoming expansion of the sales and service tax (SST), which will take effect in less than two weeks.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Isabelle Francis</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759754",
            "pub_date": "2025-06-20 12:11:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Leong Bank upgraded to ‘buy’ as associate Bank of Chengdu's shares rally — CIMB Securities",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): CIMB Securities upgraded Hong Leong Bank Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5819\" target=\"_blank\">HLBANK</a>) to a 'buy' rating, viewing its recent share price weakness as a buying opportunity, especially given the notable gains at its Chinese associate Bank of Chengdu Co Ltd.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bank of Chengdu’s share price rally was boosted as part of the finalisation of the US’ tariffs on China, with its share price hitting a new high of 19.57 yuan (RM11.58), up 21.7% from a recent low of 16.05 yuan in February, according to CIMB Securities in a research note on Friday. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As a result, the value of Hong Leong Bank’s 17.8% stake rose, with its portion of the Chinese associate’s market capitalisation increasing by 11.9% in value, or RM922 million, reaching RM8.7 billion as of June.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Subsequently, the research firm upgraded its target price for Hong Leong Bank to RM21.50 from RM21.40 previously.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We believe the risk-reward trade-off for Hong Leong Bank is now tilted to the upside given the diverging share price performances,” said CIMB Securities.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite a recent 2% dilution in Hong Leong Bank’s stake following the full conversion of Bank of Chengdu’s convertible bonds by other stakeholders, the group has faced further financial impact, added the house.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the third quarter ended March 31, 2025 (3QFY2025), Hong Leong Bank reported a drop in net profit, mainly due to dilution-related losses in its associate. CIMB Securities said Hong Leong Bank’s market cap dropped 9.3% to RM42.1 billion, weighed by a one-off RM408 million dilution loss booked in the quarter.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Analysts noted this non-cash loss — largely related to Bank of Chengdu — is unlikely to recur and does not reflect the bank’s underlying fundamentals.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>In a show of unanimity, all 17 analysts covering Hong Leong Bank’s stock have assigned a 'buy' rating, according to <em>Bloomberg</em>, which underscores analysts’ confidence in the bank’s prospects. The 12-month average target price is RM24.11.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>CIMB Securities also expects Hong Leong Bank’s dividend outlook to improve, projecting yields of 4.5% for FY2026 and 5.1% for FY2027, underpinned by higher payout ratios following the implementation of Basel III reforms in 2026. The reforms are expected to raise the bank’s common equity Tier 1 capital buffer, allowing greater flexibility for capital returns.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The bank’s asset quality continues to outperform industry peers, with a gross impaired loans ratio of 0.57% in 3QFY2025 — well below the sector average of 1.42%, according to the research house. While Hong Leong Bank’s loan loss coverage fell to 95% following the release of pre-emptive provisions, CIMB Securities believes the bulk of impaired loans are backed by strong property collateral and remain well covered.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>CIMB Securities noted that Hong Leong Bank has strong fundamentals, resilient asset quality and improved dividend potential to strengthen its position for a re-rating.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/757015\" target=\"_blank\">Hong Leong Bank’s 3Q profit drops due to dilution losses, lower earnings from associate companies</a></em></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Isabelle Francis</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759752",
            "pub_date": "2025-06-20 12:01:44",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}