{
    "data": [
        {
            "title": "Poh Huat's quarterly profit slumps on weaker US demand, higher costs",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Poh Huat Resources Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/7088\" target=\"_blank\">POHUAT</a>) on Friday reported a 92.05% year-on-year drop in quarterly net profit, as demand from the US softened amid tariffs and higher operating costs dented earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Net profit for the second quarter ended April 30, 2025 (2QFY2025) came in at just RM575,000, compared with RM7.23 million previously, the furniture maker's filing with Bursa Malaysia showed. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This is the company's worst earnings performance since 4QFY2024, when it reported a net loss of RM3.54 million.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Quarterly revenue fell 9.24% to RM98.33 million from RM108.35 million in 2QFY2024. The company attributed this to lower orders of office furniture from its Malaysian operations, as some customers had front-loaded their orders in the preceding financial period following the election of Donald Trump as US president.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shipment from its Vietnam factories for home factories remained low, with some US customers holding back orders in April following the imposition of US import tariff, the company added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat declared a second interim dividend of two sen per share, payable on July 24. This brings its year-to-date dividends to four sen per share.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat said higher material and labour costs, coupled with fixed factory overheads amid lower capacity utilisation in both its Malaysian and Vietnamese factories, contributed to the lower gross profit.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The company booked a foreign exchange loss of RM1.8 million in the quarter, resulting in a lower net other income of RM700,000. It posted a forex gain of RM2.28 million and net other income of RM5.78 million in 2QFY2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For the first six months of FY2025, Poh Huat's net profit declined 42.65% to RM10.06 million, from RM17.53 million in the previous corresponding period, as revenue decreased 2.05% to RM234.59 million from RM239.49 million.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On its prospects, Poh Huat said it will continue to stay informed about US trade policies as the industry remains in a “state of flux” under Trump’s administration.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Poh Huat’s shares closed one sen or 0.93% lower at RM1.06 on Friday, giving the company a market capitalisation of RM295 million. The counter has dropped 27% over the past one year.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>S Kanagaraju</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759841",
            "pub_date": "2025-06-20 20:11:46",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wasco plans spin-off listing of biomass energy unit on Bursa",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Wasco Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5142\" target=\"_blank\">WASCO</a>) is planning to list its wholly owned unit, Wasco Greenergy Bhd, which operates biomass and steam energy businesses, on the Main Market of Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The initial public offering (IPO) will involve up to 150 million shares, comprising an offer for sale of up to 75 million shares by selling shareholders Wasco and Tema Energy Ventures Sdn Bhd, and a public issue of 75 million new shares. The offering represents 30% of Greenergy’s enlarged issued share capital of 500 million shares.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The institutional offering will consist of up to 119.5 million shares, made up of 75 million offer shares and 44.5 million new shares, with the final price to be determined via bookbuilding.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The retail offering will involve 30.5 million shares, of which five million shares will be allocated to eligible employees and directors of Greenergy and Wasco, 15.5 million shares to entitled Wasco shareholders, and 10 million shares to the Malaysian public via balloting.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The initial retail price will be set prior to the launch of the prospectus, according to its filing with Bursa Malaysia.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Proceeds from the public issue, which will accrue entirely to Greenergy, will be used to fund business expansion — particularly in biomass steam power plants — as well as its operations in Indonesia, capital expenditure, digitalisation initiatives, and research and development.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, proceeds from the offer for sale, which will go to Wasco, are earmarked for working capital and general corporate purposes. The final quantum will depend on the IPO pricing, which has yet to be finalised.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Greenergy currently owns a 100% stake in Wasco AgroTech Sdn Bhd and a 60% stake in Wasco Thermal Sdn Bhd (WTSB).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As part of a pre-IPO restructuring, Greenergy will acquire the remaining 40% stake in WTSB from Tema Energy for RM19.3 million, to be satisfied through the issuance of 14.4 million new shares at RM1.34 each. Following the acquisition, Greenergy will undertake a bonus issue of 295.6 million shares on a pro-rata basis to Wasco and Tema Energy. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tema Energy’s shareholders include Tee Kian Lim (26.35%), Teh Khim Choon (25.18%) and Soo Hock Tiong (22.26%).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The proposed acquisition is conditional upon, among others, approval from the Securities Commission Malaysia (SC) and is expected to be completed prior to the registration of Greenergy’s prospectus with the SC.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The proposals are expected to be completed by the fourth quarter of 2025. CIMB Investment Bank Bhd has been appointed as the principal adviser for the exercise.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of Wasco closed down 2.5 sen or 2.56% at 95 sen on Friday, giving it a market capitalisation of RM751.2 million. </p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759842",
            "pub_date": "2025-06-20 20:11:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SC adds 59 entities to Investor Alert List in 1Q",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Securities Commission Malaysia (SC) added 59 names to its Investor Alert List in the first quarter (1Q) of this year, said chairman Datuk Mohammad Faiz Azmi.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said this move is part of ongoing efforts to combat the increasingly rampant scams, alongside blocking fraudulent websites and social media pages.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“In 2024, we added 273 names to the Alert List, and in the 1Q this year, we added another 59,” he said during his opening remarks at the launch of the Bersama InvestSmart @ Pahang 2025 programme.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The event was officiated by Pahang Investment, Industrial Development, Science, Technology and Innovation Committee chairman Datuk Mohamad Nizar Mohamad Najib.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohammad Faiz added that the SC also collaborates closely with the Malaysian Communications and Multimedia Commission (MCMC) to block these deceptive sites.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Last year, we blocked 153 websites and 261 social media pages. In the 1Q, we blocked 29 websites and 91 social media pages. These numbers show how much illicit activity we are fighting daily,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As of May 2025, he said, the SC had received 1,218 complaints and enquiries about scams.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Mohammad Faiz also reminded the public to be cautious of scams that claim to be shariah<span style='font-family:\"Cambria Math\",serif'>‑</span>compliant, using religious sentiment to gain trust.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Bersama InvestSmart @ Pahang 2025 is a three<span style='font-family:\"Cambria Math\",serif'>‑</span>day programme starting Friday, bringing together government officials, capital market industry players, and regulators under one roof as part of the SC’s investor outreach initiative.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>More than 40 exhibitors are participating in the event, themed <i>Bijak Labur, Hidup Makmur</i>.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759840",
            "pub_date": "2025-06-20 20:01:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Masayoshi Son pitches US$1 tril US AI hub to TSMC, Trump team, Bloomberg reports",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): SoftBank Group Corp founder Masayoshi Son is seeking to team up with Taiwan Semiconductor Manufacturing Co to realise what could be his biggest bet yet — a trillion-dollar industrial complex in Arizona to build robots and artificial intelligence (AI).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son envisions a version of the vast manufacturing hub of China’s Shenzhen that would bring back high-tech manufacturing to the US, according to people familiar with the billionaire’s thinking. The park may comprise production lines for AI-powered industrial robots, they said, asking not to be named as the plan remains private.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank officials are keen to have the Taiwanese maker of Nvidia Corp’s advanced AI chips play a prominent role in the project, although it’s not clear what part Son sees for TSMC, which already plans to invest US$165 billion (RM702.16 billion) in the US and has started mass production at its first Arizona factory. Nor is it clear that TSMC would be interested. A person familiar with the chipmaker’s thinking said that SoftBank’s project has no bearing on TSMC’s plans in Phoenix.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Codenamed “Project Crystal Land”, the Arizona complex represents the 67-year-old SoftBank chief’s most ambitious attempt in a career that’s spanned numerous bet-the-house bids, thousands-fold returns and billions of dollars in losses. Son, who’s often expressed disappointment in his own legacy, has repeatedly said he means to do everything he can to hurry AI development. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank officials have spoken with federal and state government officials to discuss possible tax breaks for companies building factories or otherwise investing in the industrial park, including talks with US Secretary of Commerce Howard Lutnick, the people said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Japanese billionaire is also personally sounding out interest among an array of tech companies, they said. The project has been floated to executives at South Korea’s Samsung Electronics Co, they said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares of SoftBank rose 2.7% Friday. TSMC’s stock price rose 1.9%, while Samsung’s gained 0.5%. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Representatives of SoftBank, TSMC and Samsung declined to comment. A Commerce Department spokesperson did not immediately respond to a request for comment. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank’s attempts to get businesses investing in a US industrial park follow signs that its campaign alongside ChatGPT maker OpenAI to raise hundreds of billions of dollars for US data centres is moving slower than initially expected. Crystal Land would need to address crucial details, such as whether there’s demand and funding on par with its grandiose scale, to become reality.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son has pulled together a list of SoftBank Vision Fund portfolio companies that might take part in the Arizona manufacturing hub, the people said. SoftBank-backed startups working on robotics and automation technologies — such as Agile Robots SE — may set up production facilities at the industrial complex, they said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The plans are preliminary and feasibility hinges on support from the Trump administration and state officials. While the cost of the project as envisioned by Son may require as much as US$1 trillion to execute — a sum previously reported by the Nikkei — the actual scale depends on interest from big technology companies. If successful, Son has floated building multiple cutting-edge industrial parks across the US.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank is exploring the Arizona project as it also moves forward on plans to invest as much as US$30 billion into OpenAI and plans a US$6.5 billion acquisition of Ampere Computing LLC. It’s also seeding money into the Stargate venture with OpenAI, Oracle Corp and Abu Dhabi’s MGX, although it aims to get the bulk of the money for building data centres around the world from outside investors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Those outlays come as SoftBank’s cash stood at ¥3.4 trillion (US$23 billion or RM100 billion) at the end of March. The Tokyo-based company has since tapped its T-Mobile US Inc stake, selling roughly a quarter of what it held in March to raise US$4.8 billion this month. SoftBank also has net assets valued at ¥25.7 trillion, of which chip designer Arm Holdings plc makes the single largest portion, allowing it to borrow billions more as needed.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SoftBank’s exploring project financing for Stargate data centres, a model that could be adapted to a big endeavour like Crystal Land. Common for large-scale infrastructure like oil or gas pipelines, the project finance template would allow the tech investor to raise funding on a project-by-project basis and require less money upfront.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Son’s restless search for growth has resulted in projects that proceed in fits and starts, making it difficult to gauge how committed he is to any one venture. The billionaire is often goaded by the desire to boost SoftBank’s stock price and repay retail investors who’ve held onto the company’s shares from before the dot-com boom and bust, people close to the SoftBank chief have said. Many investors have waited for decades for the stock to regain dot-com bubble levels — something it’s flirted with only a few times since 2020. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>If Son’s primary motivation is to clear the way for AI, it may be more cost-efficient to encourage partnerships that link manufacturing expertise with that of AI engineers and specialists in fields from medicine to robotics, and incubating smaller companies, according to Melissa Otto, head of research at Visible Alpha. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But pouring cash into data centres may help lower the cost of developing AI applications and spur broader adoption, she said. “He’s a long-term thinker, and he takes risks,” Otto said. “It’s just too early to tell.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759781",
            "pub_date": "2025-06-20 19:51:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Insolvencies jump to 11-month high as UK’s tax hikes take toll",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The number of companies going bust in England and Wales rose to the highest in 11 months as firms struggled with the Labour government’s tax hikes and a broader slowdown in the economy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Insolvencies rose to 2,238 in May, a 15% jump from a year earlier, the government’s Insolvency Service said on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The spike came after Chancellor of the Exchequer Rachel Reeves put the squeeze on firms by increasing payroll taxes and the minimum wage, a twin blow that is hitting many labor-intensive sectors.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>After low levels during the pandemic, the number of insolvencies has risen in recent years as firms contend with higher interest rates, a weak economy and policy changes. The outlook has also been darkened by global trade tensions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Industry-level data covering April showed that retail, hospitality, construction and manufacturing are among those that have been hardest hit.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The data reflects the persistent challenges, particularly in the construction and manufacturing sectors, and highlights that the financing position of many businesses remains fragile,” said David Kelly, head of insolvency at PwC. “This vulnerability can also be seen in some of the business and consumer sentiment surveys which are painting a very cautious picture.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759837",
            "pub_date": "2025-06-20 19:41:27",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stocks take a breather as investors assess geopolitics, economic data",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>NEW YORK (June 20): Investors will focus on the Israel-Iran conflict and US economic data releases next week to assess the near-term outlook for stocks, as the S&amp;P 500 hovers just below its February highs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The S&amp;P 500 has rebounded sharply from its early-April selloff, as tariff-related tensions have eased. However, the US benchmark index appears to be taking a breather at some 2.7% below its February closing high. The index has gone 27 trading sessions since coming within 5% of its February high but has not yet set a new record.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>With Israel and Iran trading missiles, escalating threats of a sweeping conflict in the Middle East sent oil prices sharply higher and led to caution in markets.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We’re all waiting on pins and needles to see what happens with the Israel-Iran situation,\" said Brian Jacobsen, chief economist at Annex Wealth Management.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>So far, the oil market has absorbed most of the impact from geopolitical turmoil, with equities relatively stable. Yet stock investors remain concerned that higher oil prices could stoke inflation and upset plans for interest rate cuts from the Federal Reserve (Fed).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On Wednesday, the Fed held rates steady, and policymakers signalled borrowing costs are still likely to fall this year. But they estimated the overall pace of expected future rate cuts would be slower than they saw at their March meeting. They cited expectations that higher inflation would flow from President Donald Trump's tariff plans.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The question is oil prices and what that does to inflation — which has implications for monetary policy and how long the Fed keeps rates 'meaningfully restrictive',\" said Sonu Varghese, global macro strategist at Carson Group.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The big near-term risk for equities, investors said, was if the US were to join Israel's bombing campaign against arch-enemy Iran. Trump is keeping the world guessing whether the US would join Israel's bombardment of Iranian nuclear and missile sites, as residents of Iran's capital Tehran streamed out of the city on the sixth day of the air assault.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The White House said on Thursday that Trump would decide on US action in the next two weeks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"If we were to see the US enter the war or further escalation in the attacks between the two countries, that would give the S&amp;P 500 and equity markets more reasons to react negatively,\" said Damian McIntyre, head of multi-asset solutions at Federated Hermes in Pittsburgh.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the other hand, a de-escalation in Middle East tensions could prompt a relief rally for stocks.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"If both sides can kind of just slowly de-escalate, that would be positive for equity markets, positive for risk markets,\" McIntyre said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Markets are taking a bit of a wait-and-see approach here,\" he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Still, any stock market pullbacks due to rising geopolitical tensions are likely to be fleeting, investors said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"History says that usually military shocks are shallow and short-lived, and so until further notice, I think that's how Wall Street will react to this one,\" Sam Stovall, chief investment strategist at CFRA Research, said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Investors will also parse a slew of incoming data releases, including US business activity and housing sales on Monday, consumer confidence numbers on Tuesday and the PCE Price Index on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US consumer confidence plunged in the past few months, with households fearing tariffs could prompt a recession and higher inflation. However, with inflation in check and the US reaching a truce in its trade fight with China, investors expect to see a pickup in sentiment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Remember, the survey-based data all got crushed in the March, April, May time frame ... my expectation is we're still going to see an improvement,\" Mark Hackett, chief market strategist at Nationwide said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Chng Shear Lane</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759835",
            "pub_date": "2025-06-20 19:31:35",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jeep maker Stellantis weighs sale among options for Maserati, sources say",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MILAN (June 20): Stellantis is considering a possible sale of its struggling luxury Maserati unit, among other options, two sources with knowledge of the matter said, as the automaker seeks to overhaul its sprawling portfolio of 14 brands.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Discussions over Maserati's future started before new CEO Antonio Filosa, who starts on Monday, was appointed last month, while Stellantis was steered by Chair John Elkann.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The viability of the French-Italian company's 14 brands — which include Chrysler, Peugeot, Jeep and Alfa Romeo — was a priority for Elkann as he interviewed candidates to fill the CEO job.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Like other European carmakers, the world's fourth biggest automaker is facing hefty US import tariffs imposed by US President Donald Trump and struggling with stiff competition from Chinese rivals.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Stellantis hired consultant McKinsey early in April to advise it on the effects of the US tariffs on Maserati and Alfa Romeo as the two brands prepare future plans. Stellantis affirmed then that it was fully committed to both brands.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>However, a possible divestment of Maserati, its only luxury brand, is among the options McKinsey is exploring for Stellantis, the two sources told Reuters, adding the adviser's assessment was still in the early stages. They spoke on condition of anonymity because they were not authorised to discuss the matter publicly.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Asked for comment, a Stellantis spokesperson said: \"Respectfully, Maserati is not for sale\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>McKinsey declined to comment.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Filosa's predecessor Carlos Tavares, who resigned in December after a poor performance in the US market, had refused to consider getting rid of any of the carmaker's brands.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But some investors and analysts say a streamlined portfolio would boost Stellantis' profit margins. Stellantis shares have lost two-thirds of their value since March last year.</p></div>\n<h3>Falling sales</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Maserati's sales fell by more than half in 2024 to just 11,300 units and the unit posted an adjusted operating loss of 260 million euros (US$298 million) last year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The brand currently has no new model launches scheduled as it waits for a new business plan, after its previous one was put on hold by Stellantis last year. Brand head Santo Ficili said earlier this month the plan would be presented soon after Filosa starts the job.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>One of the sources said Stellantis has been coming to terms with the fact that it has too many brands, making it difficult for it to properly invest in all of them.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The carmaker needs to \"set priorities\", the source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Stellantis has not specifically mandated McKinsey to find a buyer for Maserati, but the mandate is to consider all options, including a potential sale, the second source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>All options are on the table, the source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Stellantis' board has been divided over plans for Maserati, one source said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Some board members think Stellantis is not in a position to sustainably re-launch Maserati and suggest selling it is the best option. Others think Maserati still has value and that selling its only luxury brand would be a huge reputational setback for Stellantis.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Chinese automakers, such as Chery, might be among those interested in buying European auto brands, to support their expansion in the region, where they still lack brand recognition among consumers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>This would be a similar move to SAIC's 2007 purchase of Britain's MG Motor or Geely's acquisition of Sweden's Volvo Cars in 2010.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759836",
            "pub_date": "2025-06-20 19:31:28",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gadang bags RM92 mil contract for KL–Karak Highway widening project",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Gadang Holdings Bhd (KL:<a class=\"ce-stock\" href=\"/askedge/klse/9261\" target=\"_blank\">GADANG</a>) has secured a RM92.5 million contract to undertake earthworks for the proposed widening of the Kuala Lumpur–Karak Highway.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The contract was awarded to Gadang’s wholly-owned unit, Gadang Engineering (M) Sdn Bhd, from AFA Construction and Engineering Sdn Bhd on Friday, the engineering and construction outfit said in a bourse filing.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The scope of work covers Package 2A under the broader highway widening project spanning from KM19.2 to KM61.5.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The contract is scheduled to run for 18 months with targeted completion by the last quarter of 2026.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The contract is expected to contribute positively to the earnings of the group during the contract period,” Gadang said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Shares in Gadang finished unchanged at 23.5 sen on Friday, valuing the Main Market-listed firm at RM188.2 million. The counter has dropped by over 34% since the beginning of the year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p> </p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759834",
            "pub_date": "2025-06-20 19:21:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia's electricity tariffs to be adjusted monthly, instead of twice a year",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PUTRAJAYA (June 20): Peninsular Malaysia’s electricity tariffs will be adjusted on a monthly basis from July onwards, instead of twice a year.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tariff revisions due to swings in fuel and generation costs will be done through automatic fuel adjustment system, the Energy Commission (EC) said. The agency also confirmed the base tariff per kilowatt-hour (kWh) will be raised to 45.4 sen under the fourth regulatory period (RP4) from 39.95 sen under RP3.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The new system will take effect from July this year until December 2027.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the new system, the tariff will be adjusted up or down, depending on the difference between actual fuel prices and benchmarked fuel prices. However, the automatic increase is capped at three sen per kWh — and anything exceeding this threshold will require Cabinet approval.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“This mechanism allows generation cost adjustment to be implemented automatically based on current market fuel prices and foreign exchange rate,” the EC said. The information will be reported on the commission’s website each month.</p></div>\n<div class=\"mt-3 imgw-400 embed-right\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/electricity-tariff_20250620190838.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/electricity-tariff_20250620190838.jpg\"/></a></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The base tariff, an average across all users, is reviewed every regulatory period lasting three years which takes into account potential spending required to expand or maintain the grid.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Under the current imbalance cost pass-through (ICPT) mechanism, the final tariff to be paid by consumers is adjusted every six months in the form of rebates or surcharges on top of the base tariff.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>If fuel costs exceed the projection, a surcharge will be levied, resulting in higher tariffs for the consumers, while a rebate will lower the final tariffs if fuel costs drop below forecasts.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The new base tariff of 45.4 sen per kWh comprises 12.98 sen for Tenaga Nasional Bhd’s (KL:<a class=\"ce-stock\" href=\"/askedge/klse/5347\" target=\"_blank\">TENAGA</a>) capital expenditure and 32.42 sen for generation costs, before any automatic adjustments.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The current base tariff of 39.95 sen per kWh, meanwhile, is based on 13.75 sen for Tenaga’s capital expenditure and 26.20 sen for generation costs. There is a 16 sen ICPT surcharge currently tacked on to the current tariff.</p></div>\n<h3>New ‘tiered’ structure; potential cost savings</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Apart from changes to the tariff’s adjustment mechanism, the commission is also doing away with the tiered tariff system and is now categorising end-users based on consumption. The tariff will also be broken down into charge categories — energy, capacity, network and retail charges.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>User categories will comprise low, medium and high voltage — heavier users will face higher energy, capacity, network, and retail charges. Domestic users fall into the low-voltage category.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Further, electricity tariffs under RP4 will be further adjusted for domestic users if their consumption is at least 1,000 kWh and below, and low-voltage non-domestic users who use 200 kWh and below qualify for the Energy Efficiency Incentive (EEI).</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>There would be specific tariffs for agriculture, water services, sewage and rail operators, and a 10% rebate will be given to registered higher education institutions, schools, welfare homes and houses of worship.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The government will also continue the RM40 electricity bill rebate programme, offering monthly assistance of RM40 to households in the hardcore poor category and registered in the eKasih system.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“Following the implementation of this new tariff schedule, the majority of users are expected not to be affected,” the EC said. “In fact, users who practise efficient energy usage will enjoy higher savings through the EEI.”</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759811",
            "pub_date": "2025-06-20 19:11:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Misif urges deferment of SST on raw steel materials, flags risk to local industry competitiveness",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): The Malaysian Iron and Steel Industry Federation (Misif) has warned that the upcoming sales and services tax (SST) expansion and planned carbon tax will hurt the steel industry and weaken its competitiveness, as the sector is already grappling with global overcapacity, cheap imports and rising costs.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>More than 240 steel-related products — including critical raw materials such as coking coal, coke and steel scrap — will be subject to SST starting July 1 this year, said Misif in a statement.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While raw materials for iron and steel will be taxed, the national industry association pointed out that many semi-finished and finished products remain exempted or duty-free.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“It will weaken the competitiveness of local manufacturers, encourage imports, discourage domestic production and erode Malaysia’s industrial base. Increased costs will also make Malaysian steel exports less competitive, leading to lost export markets and a worsening trade imbalance,” said Misif.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The association, which has over 150 member companies, further said that the SST expansion also covers machinery and equipment used in steel manufacturing, contradicting the goals of the New Industrial Master Plan 2030.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move is expected to deter investment in automation, advanced technologies and green steel production, in turn undermining efforts to improve productivity and sustainability.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Misif also highlighted that a 10% SST on steel mesh — used widely in high-rise and affordable housing projects with industrialised building systems (IBS) — could slow down construction and increase reliance on manual labour and foreign workers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The group urged the government to review the tax policy urgently, warning of long-term risks to Malaysia’s industrial base, domestic supply chains and trade balance.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>On the carbon tax — expected to be introduced in 2026 — Misif said the steel industry would be among the first targeted alongside the energy sector, despite the sector already facing multiple challenges, especially in this increasingly uncertain global landscape.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While reiterating its support for Malaysia’s net-zero goals, Misif said a carbon tax at this stage would compound pressures on steel makers.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As a result, Misif called on the government to act swiftly to preserve its long-term competitiveness, safeguard thousands of jobs, and secure Malaysia’s industrial future.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The expanded SST will impose a 5% to 10% sales tax on selected non-essential goods and broaden the service tax to include services such as rental or leasing, construction, finance, private healthcare, education and beauty.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Earlier this week, Finance Ministry secretary general of Treasury Datuk Johan Mahmood Merican reportedly said the government expects the expanded SST to generate an estimated RM5 billion additional revenue in six months starting July.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Read also:<br/>\n<a href=\"https://theedgemalaysia.com/node/758356\" target=\"_blank\">Expanded SST to kick in on July 1 with 5%-10% sales tax on selected, non-essential goods, says MOF</a></i></p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Liew Jia Teng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759833",
            "pub_date": "2025-06-20 19:01:43",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chizu Café owner plans Singapore IPO to fuel Southeast Asian expansion",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Daruma Capital Sdn Bhd, which operates the Chizu Café chain, on Friday announced its plan to list on the Singapore Exchange (SGX) to accelerate regional expansion.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The move is part of Daruma Capital’s broader strategy to tap into Singapore’s deep capital markets and attract international investors, particularly those eyeing Southeast Asia’s rapidly growing consumer sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Despite a muted listings environment in Singapore, the SGX provides an ideal platform for accessing regional and global capital, while allowing the company to maintain its focus on operations, said Daruma Capital founder and managing director Ong Leong Fuei.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The timing is particularly favourable,” Ong noted. “Consumer spending across the region remains robust, and international investors are increasingly drawn to high-quality regional F&amp;B brands with proven scalability.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Private equity firm MCI Capital Sdn Bhd has been hired as the financial adviser for the initial public offering (IPO), according to a statement from Daruma Capital. MCI Capital will advise Daruma on overall capital markets strategy, including listing readiness.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Details such as the size of the IPO or timeline were not elaborated on in the statement. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Currently, Daruma Capital has seven outlets in the Klang Valley under the “Meet Me at Chizu” concept and plans to expand across Southeast Asia. The company also operates Yaki Soul and Daruma pastry supply.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Established in Malaysia, the Japanese-inspired café brand is known for its signature blend of milky cheese foam with artisanal beverages and buttery croissants.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Daruma’s vertically integrated business model — with a central kitchen supporting multiple brands — would be a key driver of scalability and a strong draw for institutional investors, said MCI Capital chairman Datuk Cannis Chan noted.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We understand what international investors seek in Southeast Asian F&amp;B companies, and Daruma Capital checks all the boxes — including proven leadership, scalability, solid financials, and a clear growth strategy,” Chan added.</p></div>\n</div><div class=\"news-detail_editedByWrapper__jHZRc\"><span>Edited By</span><span>Jason Ng</span></div></div>",
            "link": "https://theedgemalaysia.com/node/759795",
            "pub_date": "2025-06-20 18:51:46",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil tumbles, stocks rebound after Trump Middle East pause",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>LONDON (June 20): Stock markets ticked higher on Friday while oil skirted close to its biggest daily drop since April after President Donald Trump pushed back a decision on US military involvement in the Israel-Iran conflict.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Rising risks from the Middle East have loomed large on the world's top indexes again this week.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Europe's main bourses all rose between 0.5%-1% .EU after similar gains across Asia, although it was touch and go whether it would be enough to prevent a second straight weekly loss for MSCI's main world index.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Israel bombed targets in Iran, and Iran fired missiles at Israel overnight as the week-old war continued although Friday's markets moves, which also included a modest drop in the dollar, showed an element of relief.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That was largely pinned on Thursday's statement from the White House that Trump will decide in the next two weeks — rather than right away — whether the US will get involved in the war.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>European foreign ministers were to meet their Iranian counterpart in Geneva on Friday, seeking a path back to diplomacy over its contested nuclear programme.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The relief the US wasn't charging into the conflict sent oil prices down as low as US$76.10 per barrel, although they were last at just over US$77 and still up 4% for the week and 20% for the month.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Brent crude is down 2.5% today in the clearest sign that fears over an imminent escalation in the Israel/Iran conflict have eased,\" MUFG strategist Derek Halpenny said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gold, another traditional safe-haven play for traders, was also lower on the day although Nasdaq, S&amp;P 500, and Dow futures were all in the red after US markets had been closed on Thursday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Asian shares had gained 0.5% overnight thanks to a 1.2% jump in Hong Kong's Hang Seng and as newly elected President Lee Jae Myung's stimulus plans saw South Korea's Kospi top 3,000 points for the first time since early 2022.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>China's central bank held its benchmark lending rates steady as widely expected in Beijing, while data from Japan showed core inflation there hit a two-year high in May, keeping pressure on the Bank of Japan to resume interest rate hikes.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>That in turn lifted the yen and pushed down the export-heavy Nikkei in Tokyo.</p></div>\n<h3>Oil retreats</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The dollar was ending an otherwise positive week lower on the day, with the euro up 0.3% against the US currency at US$1.1527 and the pound 0.2% higher at US$1.3494.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The US bond market, which was also closed on Thursday, resumed trading with the key 10-year Treasury bond yield flat at 4.39%, while German 10-year yields, which serve as Europe's borrowing benchmark rate, fell 2.5 basis points to 2.49%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Gold prices eased 0.5% to US$3,354 an ounce, but were set for a weekly loss of 2.3%.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But the main commodity market focus remained oil. Brent crude futures were last down US$1.60, or around 2.2%, at US$77.28 a barrel in London although they were still on track to end the week 4% higher.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PVM analyst John Evans said the big market risk of the Middle East troubles was \"unintended action that escalates the conflict and touches upon oil infrastructure\".</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"The world has more than adequate supply for 2025, but not if the nightmare scenario of 20 million (barrels per day) being blocked in the seas of Arabia, however briefly that might be,\" he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759748",
            "pub_date": "2025-06-20 18:51:39",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FBM KLCI up 0.09% to 1,502.74 on June 20, 2025",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>KUALA LUMPUR (June 20): Below is a summary of how key Bursa Malaysia indices and the ringgit performed on Friday:</p></div>\n<div class=\"pb-5 imgw-800 mx-auto d-block\"><a class=\"mobx embedimg-icon\" data-rel=\"ceolightbox\" href=\"https://myassets.theedgemalaysia.com/pics/2025/full-market-closing-web-june20-2025-1_20250620175458.jpg\"><img alt=\"\" src=\"https://myassets.theedgemalaysia.com/pics/2025/full-market-closing-web-june20-2025-1_20250620175458.jpg\"/></a></div>\n<div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div></div></div>",
            "link": "https://theedgemalaysia.com/node/759821",
            "pub_date": "2025-06-20 18:31:34",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla, Shanghai sign US$557m energy storage station deal — report",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>BEIJING (June 20): Tesla's first China grid-scale battery storage station using its megapack batteries will be located in Shanghai, local media <em>Yicai </em>reported on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The deal involving an investment of four billion yuan (US$556.8 million or RM2.3 billion) was signed between the US automaker, China Kangfu International Leasing Co and the Shanghai local government on Friday, according to the report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Tesla's battery megafactory in Shanghai for making its megapack batteries began production in February.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Siow Chen Ming</em></p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p> </p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759825",
            "pub_date": "2025-06-20 18:21:31",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Penang has enough industrial land for next 10 to 15 years, says CM",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>GEORGE TOWN (June 20): Penang still has 809.4 hectares of industrial land available to support the state’s economic development for the next 10 to 15 years, said Chief Minister Chow Kon Yeow.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said in addition to new sites, the available land includes areas undergoing reclamation, sites in the request-for-proposal process, and others at various stages of readiness for long-term use.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Although there is a perception that industrial land is running out, the reality is that Penang still has a sizeable land bank that can be developed. Land is not an issue. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"For example, the Batu Kawan Industrial Park, which spans over 404.7 hectares, has taken more than 15 years to develop since 2008,\" he told reporters after launching the Penang Industrial Master Plan 2030 on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He clarified that the current demand is relatively moderate, averaging around 40.4 hectares annually, and not all new investments require new land, as many investors utilise remaining space within their existing factory sites for expansion.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>When asked about the state’s revenue from industrial land sales, Chow said the returns were minimal and not the main priority.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“What matters more is the investment value generated. For instance, in the first quarter of this year, we recorded RM13 billion in total investments in various forms, including new land acquisitions, existing factories, digital investments and more,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile, Chow said the state government plans to establish centralised labour quarters (CLQs) within industrial areas to accommodate demand for foreign labour, as part of the newly launched Penang Industrial Master Plan 2030.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We are taking a holistic approach because industrial development goes beyond just land. It requires supporting infrastructure such as utilities, talent, ports, airports and also well-planned CLQs or worker dormitories within industrial zones,” he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Chow described the master plan as a timely move to drive the transformation of Penang’s industrial sector and strengthen the state’s position as a preferred investment destination in the region.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said the plan also takes into account key infrastructure projects such as the expansion of the Penang International Airport and the development of green and smart technology hubs to support the electrical and electronics sector.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The Penang Industrial Master Plan 2030 outlines three core pillars, supported by nine high-impact projects, as well as short-term initiatives that include seven quick wins and 28 supporting projects.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759822",
            "pub_date": "2025-06-20 18:01:40",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Defence opportunity could finally make flying taxis a reality",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>PARIS (June 20): Opportunities in defence, emergency healthcare and cargo could help make flying taxis a reality in the next few years after the sector recently received backing from the Trump administration, executives in the industry said at the Paris Airshow.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>President Donald Trump this month told regulators to speed up certification to accelerate the development of electric vertical take-off and landing aircraft (eVTOLs), aiming to secure a U.S. lead over Asia in the technology.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The executive order gave fresh impetus to an industry that has struggled to win over critics and regulators.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We take a lot of spears, people are like 'batteries are too heavy',\" said Kyle Clark, founder and chief executive of Beta Technologies, at the show. \"But the reality is, if you put the airplanes in the right places, the benefits are real.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Flying taxis <span jsslot=\"\"><span>—</span></span> seen in predictions of the future for decades <span jsslot=\"\"><span>—</span></span> need to shake off the idea that they are just for the rich to become viable at scale.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Their manufacturers say emergency medical services, cargo and defence could help, where they offer a cheaper and quieter alternative to helicopters in areas from passenger and goods transport to rescue missions.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Beta, Joby Aviation and Archer Aviation are in the US Air Force Agility Prime Programme, which aims to develop technologies for autonomous cargo and hybrid-electric aircraft.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Joby and Archer have previously signed military contracts worth US$131 million (RM557.8 million) and up to US$142 million, respectively.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We have two aircraft at Edwards Air Force Base, and we are really grateful for all the support and all the learning we've gotten out of that,\" Joby Aviation's founder and chief executive JoeBen Bevirt said. \"We think there's incredible opportunities on the defence side.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Beta's Clark, who flew its conventional takeoff and landing aircraft in Paris, said the company had a clear position in defence: reliable aircraft that showed up to every mission.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We've gone to somewhere near 10 bases,\" he said. \"We've done 1,000s of takeoffs and landings with the military, we've had an exceptional dispatch rate.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We didn't just dabble in there. We've got contracts. I think that, like, we've got hundreds of millions of dollars of actual, tangible dollars flowing into us with defence.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The three companies, along with Wisk Aero, said Trump's order was a big deal in boosting the sector's prospects.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>US Transportation Secretary Sean P. Duffy and acting FAA administrator Chris Rocheleau announced a US-led alliance with Britain, Canada, Australia and New Zealand to streamline the certification of eVTOLs globally at the Paris show on Tuesday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Wisk Aero, owned by Boeing, differs from its rivals in that it is focused on launching fully automated services.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We have the political support, we have the industry support and then we have the money to make it happen,\" CEO Sebastien Vigneron said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Public concern over automated driving systems in cars suggests fully automated flying could have some convincing to do to gain wider acceptance.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Beta's Clark said once the aircraft were in the hands of customers, the business case would be clear.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>He said he had flown passengers from the Hamptons to JFK airport in New York using only US$7 of electricity.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"You basically flip opex and capex on its head for recurring costs, and it just tells you what type of customers and applications you want for these airplanes,\" he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It's not a once-a-week flyer, it's a three, four, 10 times-a-day flyer where you exploit the benefits of electric propulsion.\"</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Siow Chen Ming</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759819",
            "pub_date": "2025-06-20 17:51:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global trading giants step up India presence, fuelling talent rush, exchange upgrades",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>MUMBAI (June 20): Half a dozen global trading giants, from Citadel Securities and IMC Trading to Millennium and Optiver, are ratcheting up their presence in India's booming derivatives markets, fuelling a hiring spree and pushing exchanges to improve technology.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The firms' hiring plans, being reported for the first time, come amid expectations that large domestic consumer and investor bases will help shield India from global turmoil sparked by the trade policies of US President Donald Trump.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The South Asian nation made up nearly 60% of global equity derivative trading volumes of 7.3 billion in April, the Futures Industry Association says, while its regulators say notional turnover of the contracts has grown 48 times since March 2018.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>For Western firms, the gold rush is too big to ignore, particularly after US trading firm Jane Street earned US$2.34 billion from its India trading strategy last year, some of the firms' executives said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We have seen competition increasing both on the trading front, where you see more players going for the same opportunities, and on the job market as well,\" said Jocelyn Dentand of global high-speed trader IMC Trading.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The firm plans to grow its team by more than 50% by the end of 2026 to stand at more than 150, added Dentand, the managing director of its India unit.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Foreign investors turned buyers of Indian stocks in April and May, purchasing a net US$2.8 billion, as they abandoned their previous selling stance from October 2024 to March 2025, prompted by high valuations and slower growth in earnings.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Citadel Securities, a market-making firm founded by well-known investor Kenneth Griffin, runs a leaner team of around 10, including a recently hired chief operating officer for India as well as a country head of trading, said a source familiar with the firm's plans, adding that it continued to seek talent.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Citadel Securities declined to comment for the report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Hedge fund Millennium is expanding its India desk via Dubai and Singapore, said a source with direct knowledge of the matter, who also sought anonymity on the same grounds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Millennium declined to comment for the story.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Netherlands-based Optiver, which launched India operations in 2024, plans to grow its team to 100 by the end of 2025, a spokesperson said, up from 70 now.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"Optiver is investing ambitiously in India, with a view to expanding to 100 FTEs by year-end and scaling further in the years ahead,\" the spokesperson added.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Amsterdam-based trading firm Da Vinci and London-based Qube Research and Technologies are also recruiting for quantitative trading roles in India, public postings for jobs show.</p></div>\n<h3>Rush for tech, talent</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Global trading firms are also looking to expand in India by recruiting aggressively from top domestic universities and poaching from home-grown competitors.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>They have hired about 300 people in India in the last two years across the trading, technology, compliance, risk and legal functions, Hong Kong-based recruiter Aquis Search estimates.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We foresee a good run for the next few years,\" said Annpurna Bist, its head of quant and tech.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Intensifying competition has driven up salaries, with even junior traders paid more than double the figure of three years ago, said Bhautik Ambani, head of AlphaGrep Investment Management, one of India's leading quant trading firms.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>India's top engineering schools have become the favoured hunting grounds for talent.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We almost solely hire our traders and software engineers from Indian Institutes of Technology (IITs),\" said IMC's Dentand, referring to the country's chain of prestigious engineering schools.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>But hiring efforts are now being widened to the universities beyond the IITs, Dentand said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The influx of global trading firms has opened up opportunities for India's two main exchanges, which are both upgrading their tech infrastructure.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The National Stock Exchange of India (NSE) plans to add 2,000 co-location racks over the next two years while older stalwart the Bombay Stock Exchange (BSE) aims to scale up to 500 by the end of fiscal 2026, from none in March 2024.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Such racks are servers at exchanges that cut trade execution times to microseconds.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"We are a late entrant and need to provide additional value for the unfulfilled demand from high-frequency trading firms and quant firms, amongst others, for co-location racks,\" said BSE Chief Executive Sundararaman Ramamurthy.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The exchange has spent between 4.5 billion rupees and 5 billion rupees (US$52 million to US$58 million) on technology in the last two years, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The NSE and regulator the Securities and Exchange Board of India (SEBI) did not respond to queries for the report.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Lam Seng Fatt</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759817",
            "pub_date": "2025-06-20 17:41:32",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea says SK and Amazon to invest US$5b in country's biggest data centre",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SEOUL (June 20): South Korea's SK Group will invest around seven trillion won (US$5.11 billion or RM21.74 billion) including US$4 billion from Amazon Web Services (AWS), Amazon's cloud services provider, to build a data centre in the southern city of Ulsan, the Science Ministry said on Friday.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The artificial intelligence (AI) data centre, which will be the country's largest, will break ground in September and be fully operational with a capacity of 100 megawatts by 2029, the ministry said in a statement.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>SK Group chairman Chey Tae-won said he plans to expand the data centre's capacity to one gigawatt in the future and make it a global hub that handles domestic AI demand during a meeting attended by president Lee Jae Myung and tech CEOs.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>AI is crucial for South Korea's growth, he said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>\"It may set a good example that South Korea's high-tech industry is possible not only in the metropolitan area but also in the provinces,\" Lee said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>South Korea's AI-related stocks on Friday extended a rally on policy optimism, with SK Hynix rising more than 3%, Kakao surging 11%, and LG CNS gaining 9%, leading the benchmark Kospi above a key milestone of 3,000 points for the first time in three and a half years.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The official announcement follows media reports earlier this month that SK Group and AWS are building a data centre in South Korea.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Tham Yek Lee</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759818",
            "pub_date": "2025-06-20 17:41:26",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top India realtor DLF to roll out Mumbai comeback project in July",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): DLF Ltd plans to start bookings in a premium residential project in Mumbai next month, marking the return of India’s top developer to the financial capital after thirteen years as it seeks newer growth markets. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We’ll be launching the Mumbai project in July,” Aakash Ohri, joint managing director at DLF said in an interview, adding that the market held “immense potential”. The developer plans to build eight towers in two phases, with apartments priced upwards of 50 million rupees (RM2.45 million), according to its website.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DLF’s Mumbai push closely follows a record sale of luxury residences worth about US$1.3 billion (RM5.53 billion) near capital New Delhi this week. It also comes amid signs that the galloping home sales in key Indian markets over the last two to three years is slowing because of high base and elevated home prices. </p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DLF’s upcoming West Park project spans over 5.6 acres with three- to four-bedroom flats, duplex and penthouses. The first phase of four towers includes 416 apartments with a carpet area of 1150-1,550 sqe ft. The project is slated to be completed by mid 2032, according to the state level real estate regulator.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The real estate developer, whose shares are up 3% this year compared to a drop in a Nifty gauge of local property developers, will have its task cut out as it looks to enter an oversupplied market.</p></div>\n<h3>Replicating success</h3>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Unsold luxury housing stock in Mumbai rose 36% on year in the March quarter, according to property consultant ANAROCK. Brokerage JM Financial said in a report last week that while the sector’s growth in larger Indian cities would moderate, the demand-supply scenario was comfortable.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DLF, which is a market leader in Delhi and adjoining regions, is keen to replicate the success in Mumbai, undeterred by how a foray in the past had not worked out.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>DLF had acquired around 17 acres of Mumbai mill land in 2005 for around seven billion rupees. But the global financial crisis and its own mounting debt forced the developer to sell the plot in 2012 for 27 billion rupees.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“At that time, attention was to consolidate back home. Commitments here needed more attention,” Ohri said, referring to why DLF had to pull back from Mumbai in 2012.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>None of that is holding the developer back as it looks to make a comeback.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“We have consistently received interest and inquiries about DLF’s entry into the city,” Ohri said. </p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><em>Uploaded by Felyx Teoh</em></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759808",
            "pub_date": "2025-06-20 17:31:36",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Currency traders are ditching dollar for euro on options bets",
            "description": "<div class=\"news-detail_newsTextDataWrap__PkAu5\"><div><div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>(June 20): The euro is taking on a bigger role in the global currency options market as traders skirt around the dollar given the risks from unpredictable US policy and a global trade war.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>There’s been a shift in trading volumes. Around 15% to 30% of contracts tied to the dollar versus major currencies were switched to the euro, looking at data from the Depository Trust &amp; Clearing Corporation for the first five months of this year versus the final five months of 2024. There are also signs the euro is being used as a haven — traditionally the dollar’s role — and for bets on big moves.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>While deals involving the dollar still dominate in the US$7.5 trillion (RM31.9 trillion)-a-day currency market, this could be early evidence that the greenback is facing greater competition as the world’s reserve currency. Traders are sidestepping the dollar after its biggest slump in years, with Europe’s common currency looking like a key beneficiary as the region’s markets benefit from billions in government stimulus spending.</p></div><div class=\"inPageAd\" id=\"div-gpt-ad-inpage\"></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“If we’re moving to an environment in which the European flow story is more important, then we could be moving to an environment in which it’s euro pairs which are driving everything,” said Oliver Brennan, options strategist at BNP Paribas SA.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>So far this year, Europe’s common currency has rallied 11% against the dollar, hitting its highest since 2021 at above US$1.16. Meanwhile the dollar has slid against every major currency, with a gauge down over 7% to its lowest since 2022. That’s undermining trust in US assets.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>And the slump may not be over yet. Hedge fund heavyweight Paul Tudor Jones just predicted another 10% drop for the dollar over the next year. Risk reversals, a gauge of options sentiment, are becoming increasingly negative on the dollar against the yen, whereas they are turning less bearish on euro-yen — a “really important signal” on the euro for Brennan.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>As markets question the dollar’s stability, implied volatility in the euro against the yen is looking the calmest in nearly four years relative to swings between the greenback and Japanese currency.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The market is thinking that dollar-yen will be more volatile than euro-yen in a negative market shock, which is the opposite to how the market has traded these events in the past,” said Brennan. “If that’s the thinking, then it means the market sees the euro as more of a safe haven than the dollar.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>The cost of options is also a driver, said Ben Ford, currency strategist at Macro Hive. While implied volatility generally has eased after spiking in April’s market chaos, it stands at nearly 11% over three months for dollar-yen, compared with under 9% for euro-yen.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“The market is finding cheaper ways to express its view, especially given the view is probably for euro outperformance,” Ford said.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Traders also seem to be favoring the euro over the dollar when it comes to hedging or betting on big directional moves on the yen. That’s evident in so-called 10-delta fly spreads, a gauge of demand for outsized swings, where the gap between euro-yen and dollar-yen has been steadily widening since April.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Of course, the dollar has been written off many times before. Just at the start of this year, the euro was languishing near parity with the greenback, with many investors certain the common currency’s value would fall below its US peer.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Instead Trump’s April’s tariff announcements saw investors dump dollar assets. While US stocks have recovered since then, the dollar risk premium remains elevated, and it may require a return to US exceptionalism to reverse the trend, according to Tanvir Sandhu, chief global derivatives strategist at Bloomberg Intelligence.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>Meanwhile the European Central Bank’s president Christine Lagarde has called on policymakers to seize the moment and increase the euro’s global profile.</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p>“There’s a push and a pull — the pull has been that there’s potentially more safe assets to buy in Europe and more growth expectations in Europe,” said BNP’s Brennan. “And the push has been tariff uncertainty, risks to US exceptionalism, and the macro story.”</p></div>\n<div class=\"newsTextDataWrapInner\" style=\"font-size: 18px;\"><p><i>Uploaded by Magessan Varatharaja</i></p></div>\n</div></div>",
            "link": "https://theedgemalaysia.com/node/759809",
            "pub_date": "2025-06-20 17:31:30",
            "source": "theedgemalaysia",
            "kind": 1,
            "language": "en"
        }
    ]
}