{
    "data": [
        {
            "title": "Top Stock Market Highlights of the Week: Meta Platforms, Singapore’s Growth Forecast and Johor-Singapore Economic Zone",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Welcome to this week’s edition of top stock market highlights.</p><h2 class=\"wp-block-heading\" id=\"h-meta-platforms-nasdaq-meta\"><strong>Meta Platforms (NASDAQ: META)</strong></h2><p>Meta Platforms has concluded an investment in Scale AI, valuing the startup at over US$29 billion.</p><p>According to sources, the technology behemoth’s investment in Scale AI amounted to US$14.3 billion, giving Meta a 49.3% stake in the artificial intelligence (AI) firm.</p><p>Scale AI’s CEO and co-founder, Alexandr Wang, will join a new superintelligence unit within Meta that seeks to achieve artificial general intelligence (AGI).</p><p>AGI is a term used to describe machines that can match or even surpass human capabilities.</p><p>This deal is now Meta’s second-largest ever, just behind its US$19 billion purchase of WhatsApp back in 2014.</p><p>By buying a stake in Scale AI, Meta CEO Mark Zuckerberg could also take a sneak peek into what his competitors have been up to.</p><p>Many of these technology giants contracted Scale AI for data services.</p><p>Scale AI was valued at around US$14 billion just one year ago, with funding coming from <strong>Nvidia</strong> (NASDAQ: NVDA), <strong>Amazon</strong> (NASDAQ: AMZN), and Meta itself.</p><p>The startup was set up in 2016 and is famous for its accurately labelled data sets, which are used for training generative AI models.</p><p>These labels are manually done by gig workers who are recruited and managed by Scale AI.</p><h2 class=\"wp-block-heading\" id=\"h-singapore-s-growth-forecast\"><strong>Singapore’s growth forecast</strong></h2><p>Economists have downgraded Singapore’s full-year GDP growth and <a href=\"https://thesmartinvestor.com.sg/higher-prices-are-coming-heres-what-you-can-do-to-beat-inflation/\">inflation</a> expectations in the latest quarterly survey published by the Monetary Authority of Singapore (MAS).</p><p>This downgrade came on the back of deteriorating US-China relations and <a href=\"https://thesmartinvestor.com.sg/trumps-global-tariff-shock-what-should-singapore-investors-do-now/\">Trump’s raft of reciprocal tariffs</a> announced in early April.</p><p>The median growth forecast is for Singapore’s economy to grow by 1.7% this year, dragged down by an anticipated manufacturing contraction.</p><p>This level is down from the previous projection of 2.6%.</p><p>The good news is that inflation is also expected to plunge, with core inflation expected to come in at just 0.8%, down from 1.5% in the previous survey.</p><p>That said, inflation could rear its ugly head again with Middle East tensions ratcheting up, as <a href=\"https://thesmartinvestor.com.sg/3-singapore-stocks-to-watch-as-oil-prices-climb/\">oil prices have recently surged</a> in response to the unrest.</p><p>MAS is expected to further ease monetary policy at its next meeting in July to counteract this slowdown.</p><p>Despite the lowering of the official growth forecast, expectations are still within the original estimates of between 0% to 2% for growth, and 0.5% and 1.5% for inflation.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>The respondents cited geopolitical tensions along with worsening trade relations as a key factor for the downgrade in the domestic outlook.</p><p>On the flip side, some factors could potentially boost growth.</p><p>These include a construction boom, with the recent announcement of the commencement of the construction for <a href=\"https://thesmartinvestor.com.sg/construction-of-changi-airport-terminal-5-has-commenced-5-singapore-companies-that-stand-to-benefit/\">Changi Airport’s Terminal 5</a>.</p><p><a href=\"https://thesmartinvestor.com.sg/will-rising-interest-rates-affect-the-stock-market/\">Interest rates</a> could also be lowered if US economic growth remained tepid.</p><p>There could also be a potential fiscal support package should the government need to stimulate consumer spending.</p><h2 class=\"wp-block-heading\" id=\"h-johor-singapore-economic-zone\"><strong>Johor-Singapore Economic Zone</strong></h2><p>Malaysia has a goal of attracting hundreds of thousands of Malaysians to power the <a href=\"https://thesmartinvestor.com.sg/5-singapore-stocks-that-will-benefit-from-the-johor-singapore-special-economic-zone/\">Johor-Singapore Special Economic Zone</a> (SEZ).</p><p>The President and CEO of Iskandar Investment (IIB) said that this move does not set Malaysia up to compete with Singapore.</p><p>Instead, it is about creating symbiosis that will benefit both nations.</p><p>The idea of the SEZ is to have both countries work together to attract investment projects from around the world.</p><p>Although the zone’s infrastructure, which includes roads and power supply, has been set up, what’s lacking is the people.</p><p>Some positive factors that could draw Malaysians to work in the SEZ, rather than head over to Singapore, include more industry-relevant training, increased job opportunities, and a lower cost of living.</p><p>Mohd Noorazam Osman, CEO of the Iskandar Regional Development Authority, hinted that plans are underway to offer tax incentives and to establish a minimum starting salary of RM4,000 for graduates in Johor.</p><p>There is also the belief that many Malaysians may be willing to stay if salaries were half of what they could earn in Singapore, to avoid the daily commute between both countries.</p><p>Efforts to retain talent should also focus on what industries need, such as the identification of niche opportunities to supply digital assets to mature gaming and animation markets in Japan and South Korea.</p><p>Generative AI is reshaping the stock market, but not in the way most investors think. It’s not just about <em>which</em> companies are using AI. It’s about <em>how</em> they’re using it to unlock new revenue, dominate their markets, and quietly reshape the business world. Our latest FREE report “How GenAI is Reshaping the Stock Market” breaks the hype down, so you can invest with greater clarity and confidence. <a href=\"https://thesmartinvestor.com.sg/how-genai-is-reshaping-the-stock-market-art/\">Click here</a> to download your copy today.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang owns shares of Meta Platforms.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/06/Top-Stock-Highlights-of-the-Week-2-300x200.png",
            "link": "https://thesmartinvestor.com.sg/top-stock-market-highlights-of-the-week-meta-platforms-singapores-growth-forecast-and-johor-singapore-economic-zone/",
            "pub_date": "2025-06-21 07:31:53",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Invest Smart: Add These 5 Singapore Stocks to Your Watchlist",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Investing consists of a learning journey where we look at how we can improve our results over time.</p><p>One way to invest smarter is to look for businesses that are doing well, rather than trying to wait for a hobbled business to post a turnaround.</p><p>While the latter may deliver a sharp increase in share price, it’s also tougher for companies to post a successful turnaround from losses to profits.</p><p>Instead, you should focus more of your attention on businesses that are doing well and have a track record of generating consistent profitability.</p><p>These stocks should also ideally be paying out <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividends</a>.</p><p>Here are five Singapore stocks you can add to your watchlist which are growing their profits.</p><h2 class=\"wp-block-heading\" id=\"h-valuetronics-holdings-sgx-bn2\"><strong>Valuetronics Holdings (SGX: BN2)</strong></h2><p>Valuetronics is an integrated electronics manufacturing services provider offering a full range of services to customers, ranging from conceptualisation to production and supply chain support.</p><p>The group reported a commendable set of earnings for its fiscal 2025 (FY2025) ending 31 March 2025.</p><p>Total revenue rose 3.5% year on year to HK$1.73 billion, with gross profit increasing by 10.8% year on year to HK$293.7 million.</p><p>Net profit improved by 4.3% year on year to HK$166.5 million.</p><p>A final dividend of HK$0.11 was declared along with a special dividend of HK$0.08.</p><p>Coupled with the total interim dividend of HK$0.08, the FY2025 dividend totalled HK$0.27.</p><p>This was higher than the previous year’s HK$0.25.</p><p>Management expects growth from an entertainment-focused customer in the Consumer Electronics segment.</p><p>The same segment is phasing out projects in traditional consumer lifestyle to focus on higher-margin projects.</p><p>As for its Industrial and Commercial Electronics (ICE) segment, the group expects delays to new product launches because of Trump’s recent <a href=\"https://thesmartinvestor.com.sg/trumps-global-tariff-shock-what-should-singapore-investors-do-now/\">tariff announcement</a>.</p><h2 class=\"wp-block-heading\" id=\"h-cortina-holdings-sgx-c41\"><strong>Cortina Holdings (SGX: C41)</strong></h2><p>Cortina is a luxury watch retailer with boutiques located in Singapore, Malaysia, and Thailand.</p><p>The group sells Swiss watch brands such as Chopard, OMEGA, and Bell &amp; Ross, among others.</p><p>For FY2025, Cortina saw revenue rise 6% year on year to S$862.8 million.</p><p>Net profit increased by 4% year on year to S$63.6 million.</p><p>The luxury retailer also generated a positive free cash flow of S$47.7 million for FY2025, more than triple the S$13.3 million churned out in the prior year.</p><p>A final dividend of S$0.02 and a special dividend of S$0.14 were declared, taking the total dividend for the fiscal year to S$0.16, unchanged from a year ago.</p><p>Management warned that the uncertainties in the global economic outlook will pose challenges to the business, but is confident of remaining profitable for FY2026.</p><h2 class=\"wp-block-heading\" id=\"h-old-chang-kee-sgx-5ml\"><strong>Old Chang Kee (SGX: 5ML)</strong></h2><p>Old Chang Kee, or OCK, is a snack manufacturer and seller and is famous for its signature curry puffs.</p><p>The group also sells other snack items such as spring rolls, chicken wings, and crab nuggets.</p><p>For FY2025, OCK’s revenue inched up 1% year on year to S$101.9 million.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>Gross profit improved by 3.5% year on year to S$70.6 million, and the snack producer’s net profit climbed 17.4% year on year to S$11.3 million.</p><p>The food and beverage operator also generated a positive free cash flow of S$23.2 million for FY2025.</p><p>OCK declared a final dividend of S$0.01, unchanged from a year ago.</p><p>Together with its interim dividend of S$0.01, the total dividend for FY2025 amounted to S$0.02.</p><p>OCK is facing rising raw material and labour costs due to inflation, and is actively seeking to diversify its revenue streams through non-retail channels such as business-to-business sales.</p><p>Meanwhile, the group will remain focused on expanding its presence at high-traffic transport hubs.</p><h2 class=\"wp-block-heading\" id=\"h-frencken-group-sgx-e28\"><strong>Frencken Group (SGX: E28)</strong></h2><p>Frencken is an integrated technology solutions firm serving customers in the aerospace, analytical life sciences, automotive, healthcare, and semiconductor industries.</p><p>The group released an encouraging business update for the first quarter of 2025 (1Q 2025).</p><p>Revenue grew 11.5% year on year to S$215.8 million, largely due to higher contributions from its Mechatronics division.</p><p>Gross profit margin improved slightly from 13.7% to 14.8%, and net profit climbed 12% year on year to S$10 million.</p><p>Frencken guided for stable half-on-half revenue for the first half of 2025 for the life sciences and automotive segments, but expects higher revenue for the medical and semiconductor sectors.</p><p>Earlier this month, the group signed a land lease agreement to develop a new and larger manufacturing facility for the expansion and consolidation of its Mechatronics division.</p><p>The facility will expand Frencken’s capacity and help scale up its business portfolio with wafer fabrication customers.</p><p>The construction is expected to be completed by 1Q 2027.</p><h2 class=\"wp-block-heading\" id=\"h-lhn-limited-sgx-41o\"><strong>LHN Limited (SGX: 41O)</strong></h2><p>LHN is a real estate management services group specialising in space optimisation that generates value for its landlords and tenants.</p><p>The group also has three other business segments – property development, facilities management, and energy.</p><p>For the first half of fiscal 2025 (1H FY2025) ending 31 March 2025, LHN’s revenue surged 29.4% year on year to S$70.6 million.</p><p>Gross profit increased by 23.2% year on year to S$40.6 million.</p><p>The group’s net profit climbed 8.8% year on year to S$14.1 million, and an interim dividend of S$0.01 was declared, similar to a year ago.</p><p>The business also generated a positive free cash flow of S$36.1 million, nearly triple the S$12.6 million churned out a year ago.</p><p>Earlier this month, LHN announced that its co-living subsidiary, Coliwoo Keppel Pte Ltd, has won the tender for 159 Jalan Loyang Besar.</p><p>This property will be converted into Coliwoo’s first resort chalet, and operations should commence in the third quarter of fiscal 2026.</p><p>Explore Singapore’s top “evergreen” stocks with our FREE report. It spotlights 7 Singapore blue-chip stocks with solid dividends and growth potential. <a href=\"https://thesmartinvestor.com.sg/7-singapore-blue-chip-stocks-that-can-pay-you-for-life-art/\">Click here</a> to download it now to create a flow of dividend income, regardless of market conditions.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/06/Cortina-300x200.png",
            "link": "https://thesmartinvestor.com.sg/invest-smart-add-these-5-singapore-stocks-to-your-watchlist/",
            "pub_date": "2025-06-20 17:32:12",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "5 Singapore Stocks Hitting Their 52-Week Highs: Should They Be on Your Watchlist?",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Sentiment has improved considerably after the initial fears over Trump’s raft of tariffs.</p><p>The <strong>Straits Times Index</strong> (SGX: ^STI) has rebounded strongly and is just below the 4,000 level as I write this article.</p><p>As a result, several companies have hit their 52-week highs as investors turn optimistic about their prospects.</p><p>However, should you add the five companies below to your buy watchlist?</p><p>Let’s take a deeper dive to find out.</p><h2 class=\"wp-block-heading\" id=\"h-grand-venture-technology-sgx-jlb\"><strong>Grand Venture Technology (SGX: JLB)</strong></h2><p>Grand Venture Technology, or GVT, is a manufacturing solutions and services provider for the semiconductor, electronics, aerospace, and medical industries.</p><p>GVT’s share price has climbed 12.7% year-to-date (YTD) to S$0.94, just shy of its 52-week high of S$0.96.</p><p>The group announced a solid set of earnings during its first quarter of 2025 (1Q 2025) business update.</p><p>Revenue jumped 44.8% year on year to S$44.6 million while gross profit improved by 40.3% year on year to S$11.1 million.</p><p>GVT saw double-digit year-on-year revenue increases across all three of its divisions.</p><p>Net profit increased by 27.7% year on year to S$2.6 million.</p><p>Management sees artificial intelligence (AI) and high-performance computing (HPC) as long-term structural growth drivers that will benefit its business.</p><p>Beyond semiconductors, GVT also expects resilient demand from life sciences customers and is deepening its value proposition for the aerospace sector in China.</p><p>These trends and initiatives should open up more strategic opportunities for the group to continue growing its top and bottom lines.</p><h2 class=\"wp-block-heading\" id=\"h-sia-engineering-sgx-s59\"><strong>SIA Engineering (SGX: S59)</strong></h2><p>SIA Engineering, or SIAEC, is a maintenance, repair, and overhaul (MRO) specialist for the airline industry.</p><p>The group also provides line and base maintenance services for major airlines.</p><p>SIAEC’s share price has trended higher since hitting a low of S$1.91 in April 2025.</p><p>Shares of the MRO specialist are now up 37% YTD and recently hit a 52-week high of S$3.28.</p><p>The group reported a sparkling set of earnings for its fiscal 2025 (FY2025) ending 31 March 2025.</p><p>Revenue climbed 13.8% year on year to S$1.2 billion while operating profit came in at S$14.6 million.</p><p>SIAEC’s share of profits from associates and joint ventures improved by 17.4% year on year to S$118.6 million.</p><p>As a result, net profit surged 43.8% year on year to S$139.6 million.</p><p>A final <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividend</a> of S$0.07 was proposed, bringing FY2025’s total dividend to S$0.09, one cent higher than FY2024’s S$0.08.</p><p>The MRO industry continues to enjoy sustained demand, and the impact from <a href=\"https://thesmartinvestor.com.sg/trumps-global-tariff-shock-what-should-singapore-investors-do-now/\">Trump’s tariffs</a> is limited for now.</p><p>Late last month, SIAEC signed a S$1.3 billion service agreement with <strong>Singapore Airlines</strong> (SGX: C6L) and Scoot.</p><p>This agreement is effective from 1 April 2025 for a term of two years with an option to extend for a further year.</p><h2 class=\"wp-block-heading\" id=\"h-keppel-ltd-sgx-bn4\"><strong>Keppel Ltd (SGX: BN4)</strong></h2><p>Keppel is a global asset manager and operator with solutions that serve customers in the infrastructure, real estate, and connectivity sectors.</p><p>The <a href=\"https://thesmartinvestor.com.sg/a-guide-on-investing-in-blue-chip-companies/\">blue-chip group</a> saw its share price rise 7.3% YTD, and it recently hit its 52-week high of S$7.50.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>There could be more momentum for the stock as Keppel released an encouraging 1Q 2025 business update.</p><p>1Q 2025’s net profit (excluding legacy offshore and marine assets) increased by more than 25% year on year.</p><p>Of this net profit, 80% was made up of recurring income.</p><p>Asset management fees also rose 9% year on year to S$96 million for the quarter, and Keppel recorded S$347 million of assets monetised to date.</p><p>The group also grew its funds under management (FUM) and targets to hit S$100 billion of FUM by the end of 2026 and S$200 billion by 2030.</p><p>Some of these long-term objectives are encapsulated in Keppel’s <a href=\"https://thesmartinvestor.com.sg/keppels-investor-day-2025-5-things-investors-should-note/\">2025 Investor Day</a> presentation, and the group is working towards its Vision 2030 goals to grow its core earnings and increase its proportion of recurring income.</p><h2 class=\"wp-block-heading\" id=\"h-sembcorp-industries-sgx-u96\"><strong>Sembcorp Industries (SGX: U96)</strong></h2><p>Sembcorp Industries, or SCI, is an energy and urban solutions provider with a balanced energy portfolio of 25.1 GW across 11 countries.</p><p>SCI also has urban development projects that span 14,400 hectares across Asia.</p><p>SCI’s share price has shot up nearly 27% YTD and recently hit its 52-week high of S$7.11.</p><p>The utility group managed to report a resilient core net profit of S$1 billion for 2024, even though revenue dipped by 9% year on year to S$6.4 billion.</p><p>The lower revenue was because of the planned maintenance shutdown of a Singapore cogeneration plant, along with a decline in Singapore wholesale electricity prices.</p><p>Despite the flat profit, SCI more than doubled its final dividend from S$0.08 to S$0.17, taking the total 2024 dividend to S$0.23.</p><p>The group has also announced several promising business developments recently.</p><p>In late May, SCI secured its second solar-energy storage hybrid project in India for a contracted capacity of 150 MW.</p><p>And in mid-June, the group was awarded its first round-the-clock power project, also in India, to integrate approximately 300 MW of installed capacity comprising solar, wind, and battery energy storage solutions.</p><h2 class=\"wp-block-heading\" id=\"h-lum-chang-sgx-l19\"><strong>Lum Chang (SGX: L19)</strong></h2><p>Lum Chang is a construction group with businesses in property development and investment.</p><p>Its construction projects include a wide variety of property types such as commercial, residential, industrial, and infrastructure projects.</p><p>Lum Chang’s share price has risen 19% YTD to hit its 52-week high of S$0.35.</p><p>The construction group reported a mixed set of earnings for the first half of fiscal 2025 (1H FY2025) ending 31 December 2024.</p><p>Revenue inched up 3% year on year to S$239 million, but gross profit slid 12% year on year to S$19.4 million because of higher cost of sales.</p><p>Net profit dipped 4% year on year to S$3.5 million.</p><p>Despite the lower profit, Lum Chang generated a positive free cash flow of S$73 million, reversing the prior year’s negative free cash flow.</p><p>The group quadrupled its interim dividend from S$0.005 to S$0.02 and expects the award of contracts for several large-scale developments, including Changi Airport Terminal 5 and the expansion of the Marina Bay Sands Integrated Resort.</p><p>We’ve found 5 SGX-listed dividend stocks with strong track records in turbulent markets. If you want consistency in an uncertain world, <a href=\"https://thesmartinvestor.com.sg/5-singapore-dividend-paying-blue-chips-that-can-weather-uncertainty-special-free-report-art/\">start here</a>.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2022/04/Grand-Venture-Technology-Limited-300x200.png",
            "link": "https://thesmartinvestor.com.sg/5-singapore-stocks-hitting-their-52-week-highs-should-they-be-on-your-watchlist/",
            "pub_date": "2025-06-20 07:31:56",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SGX Stocks Shine: Fortune Southeast Asia 500’s Top Dogs & Newcomers",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Last year, Fortune magazine compiled its inaugural list of Southeast Asia’s Top 500 companies from Indonesia, Thailand, Malaysia, Singapore, Vietnam, Cambodia, and the Philippines.</p><p>2025 marks the second edition of this most-wanted list.</p><p>Companies are ranked by revenue for their latest available respective fiscal years, and these have all been converted to US dollars at the prevailing exchange rates.</p><p>This year saw several new entrants to this coveted list, while many of the Top 20 positions were occupied by notable Singaporean <a href=\"https://thesmartinvestor.com.sg/a-guide-on-investing-in-blue-chip-companies/\">blue-chip players</a>.</p><p>Here are some of the Singapore companies that made it to Fortune 500’s Southeast Asia Top 500 companies list.</p><h2 class=\"wp-block-heading\" id=\"h-top-20-on-the-list\"><strong>Top 20 on the list</strong></h2><p>#4 – <strong>Wilmar International</strong> (SGX: F34)</p><p>Wilmar International is the highest-ranked Singaporean company on the list and is an integrated agribusiness player.</p><p>For the first quarter of 2025 (1Q 2025), revenue rose 3.3% year on year to US$16.2 billion while core net profit inched up 4.4% year on year to US$343 million.</p><p>#5 – <strong>Olam Group</strong> (SGX: VC2)</p><p>Olam Group is also a leading food and agribusiness group that supplies food, ingredients, feed, and fibre to customers around the globe.</p><p>For 2024, the group reported revenue of S$56.2 billion, up 16.3% year on year.</p><p>However, core net profit, which excludes exceptional items, plunged 52.8% year on year to S$216.3 million.</p><p>A final <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividend</a> of S$0.03 was declared, taking the total dividend for 2024 to S$0.06.</p><p>The three banks also featured prominently on the list, as follows.</p><p>#6 – <strong>DBS Group</strong> (SGX: D05)</p><p>DBS reported a mixed set of results for 1Q 2025, with total income rising 6% year on year to S$5.9 billion.</p><p>Net profit, however, dipped 2% year on year to S$2.9 billion because of the implementation of a 15% global minimum tax rate.</p><p>Singapore’s largest bank paid out a quarterly dividend of S$0.75, a 39% year-on-year increase from the S$0.54 paid out in the previous quarter.</p><p>#12 – <strong>United Overseas Bank</strong> (SGX: U11)</p><p>United Overseas Bank, or UOB, is Singapore’s third-largest bank by market capitalisation.</p><p>Total income increased 6% year on year to S$3.7 billion, but net profit slid 2% year on year to S$1.5 billion.</p><p>#13 – <strong>Oversea-Chinese Banking Corporation</strong> (SGX: O39)</p><p>Oversea-Chinese Banking Corporation, or OCBC, is Singapore’s second-largest bank.</p><p>The lender saw total income creep up 1% year on year to S$3.7 billion for 1Q 2025.</p><p>Net profit, however, fell by 5% year on year to S$1.9 billion.</p><p>#20 – <strong>Singapore Airlines Limited</strong> (SGX: C6L)</p><p>Singapore Airlines Limited, or SIA, is Singapore’s flagship carrier.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>For its fiscal 2025 (FY2025) ending 31 March 2025, the airline saw revenue rise 2.8% year on year to S$19.5 billion.</p><p>Net profit increased by 3.9% year on year to S$2.8 billion but was boosted by a S$1.1 billion one-off non-cash accounting gain from the merger of Air India and Vistara.</p><p>The carrier declared a final dividend of S$0.30, with the total dividend for the fiscal year coming in at S$0.40.</p><h2 class=\"wp-block-heading\" id=\"h-new-entrants\"><strong>New entrants</strong></h2><p>The Top 500 list also saw several new Singaporean entrants.</p><p>#413 – <strong>Boustead Singapore</strong> (SGX: F9D)</p><p>The highest on the list of new entrants is Boustead Singapore, or BSL, a conglomerate with four divisions – energy engineering, real estate, healthcare, and geospatial.</p><p>For FY2025, the group saw revenue tumble 31% year on year to S$527.1 million.</p><p>Core net profit, however, rose 8% year on year to S$68.6 million.</p><p>The conglomerate declared a final dividend of S$0.04 and a special dividend of S$0.02, taking its total FY2025 dividend to S$0.075.</p><p>#464 – <strong>Food Empire</strong> (SGX: F03)</p><p>Food Empire is a food and beverage manufacturing company that sells well-known 3-in-1 instant coffee brands such as MacCoffee and Klassno.</p><p>1Q 2025 saw revenue climb 16.3% year on year to US$136.6 million, led by a 33.8% year-on-year revenue jump in Southeast Asia.</p><p>#455 – <strong>China Sunsine Chemical Holdings</strong> (SGX: QES)</p><p>China Sunsine is a specialty chemicals producer and the largest rubber accelerator producer in the world.</p><p>For 2024, gross revenue inched up 1% year on year to RMB 3.5 billion while net profit improved by 14% year on year to RMB 423.9 million.</p><p>China Sunsine increased its 2024 dividend to S$0.03 versus S$0.025 for the previous year.</p><p>#484 – <strong>Straits Trading Company</strong> (SGX: S20)</p><p>Straits Trading Company, or STC, is also a conglomerate with operations and financial interests in resources, property, and hospitality.</p><p>For 2024, the group reported a net profit of S$11 million, a reversal from the net loss of S$12.1 million in the previous year.</p><p>Directors have proposed an interim dividend of S$0.08 per share, similar to what was paid in the previous year.</p><h2 class=\"wp-block-heading\" id=\"h-get-smart-weighing-the-pros-and-cons\"><strong>Get Smart: Weighing the pros and cons</strong></h2><p>It is no doubt prestigious to be included within Fortune’s list; investors should note that this list is just a simple compilation of companies with the highest revenue.</p><p>The list also tells you each company’s profits, assets, and number of employees.</p><p>However, you will still need to analyse each company for its pros and cons, along with its prospects, before you invest in any of them.</p><p>Explore Singapore’s top “evergreen” stocks with our FREE report. It spotlights 7 Singapore blue-chip stocks with solid dividends and growth potential. <a href=\"https://thesmartinvestor.com.sg/7-singapore-blue-chip-stocks-that-can-pay-you-for-life-art/\">Click here</a> to download it now to create a flow of dividend income, regardless of market conditions.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang owns shares of DBS Group and Boustead Singapore.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2022/06/Office-Building-Blue-Sky-300x200.png",
            "link": "https://thesmartinvestor.com.sg/sgx-stocks-shine-fortune-southeast-asia-500s-top-performers-newcomers/",
            "pub_date": "2025-06-19 17:32:22",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "This Glove Company’s Share Price Plunged 36% from its High: Can it Regain its Mojo?",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>While the <strong>Straits Times Index</strong> (SGX: ^STI) may be one of the better-performing indices this year, some stocks in the Singapore market have suffered steep share price declines.</p><p>One of these is <strong>Riverstone Holdings</strong> (SGX: AP4).</p><p>The glove maker saw its share price tumble by nearly 37% year-to-date (YTD) to its 52-week low of S$0.68.</p><p>This fall came after the group posted a heady performance in 2024 with a share price gain of 52%.</p><p>Can Riverstone revisit its highs, and is the business a good candidate for you to add to your buy watchlist?</p><h2 class=\"wp-block-heading\" id=\"h-a-pandemic-boost\"><strong>A pandemic boost</strong></h2><p>Recall that all glove players enjoyed a substantial boost to their revenue and profitability during the COVID-19 pandemic.</p><p>Back then, demand for healthcare gloves soared, with many of the glove manufacturers reporting record profits amid an industry boom.</p><p>Riverstone also enjoyed a big surge in demand for its healthcare gloves and saw its revenue for 2021 hit RM 3 billion while net profit came in at RM 1.4 billion.</p><p>The group’s share price hit an all-time high of S$2.35 back in August 2020, and was hovering around S$1.50 by January 2021.</p><p>Riverstone has both a clean room glove division and a healthcare division, and both were beneficiaries of the pandemic.</p><p>The clean room division thrived because of strong demand for electronics amid the wave of digitalisation sweeping across the globe.</p><p>Hence, the business was benefitting on both fronts as it rode the wave to prosperity.</p><p>For 2021, Riverstone declared a total <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividend</a> of RM 0.48, comprising a core ordinary dividend of RM 0.38 and a special dividend of RM 0.10.</p><h2 class=\"wp-block-heading\" id=\"h-fall-from-grace\"><strong>Fall from grace</strong></h2><p>Unfortunately, the subsequent plunge in demand for gloves saw Riverstone fall from grace.</p><p>As the world exited the pandemic, demand for gloves also normalised, dealing a significant blow to the glove manufacturing sector.</p><p>In 2022, Riverstone saw its revenue fall 59.1% year on year to RM 1.26 billion while net profit plunged 77.8% year on year to RM 314.4 million.</p><p>A total dividend of RM 0.34 was paid out for 2022.</p><p>2023 saw the continued fall in demand for healthcare gloves, and many players were eliminated from the sector, with demand and supply slowly reaching an equilibrium.</p><p>That year, Riverstone saw its revenue tumble 27.4% year on year to RM 914.8 million while net profit continued to slide, falling by 30% year on year to RM 220.4 million.</p><p>Despite the continued fall in net profit, the group still paid out RM 0.175 in ordinary dividends along with a special dividend of RM 0.05.</p><p>Investors should note that this payout is still significantly higher than its pre-pandemic (2019) dividend payment of RM 0.074.</p><p>2024 saw a rebound in the group’s fortunes.</p><p>Revenue rose 17.3% year on year to RM 1.07 billion, with net profit surging 30.2% year on year to RM 286.9 million.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>For 2024, Riverstone paid an ordinary dividend of RM 0.20 and a special dividend of RM 0.04.</p><h2 class=\"wp-block-heading\" id=\"h-net-margin-compression\"><strong>Net margin compression</strong></h2><p>2024’s performance seemed to indicate that the year might be a turning point for the business.</p><p>However, the first quarter of 2025 (1Q 2025) saw Riverstone report a 21.8% year-on-year fall in net profit despite a tiny 1.1% year-on-year uptick in revenue.</p><p>These financial numbers got investors worried as they fretted over higher costs incurred by the business, which wiped out its revenue gains.</p><p>Riverstone was also demonstrating declining net profit margins since its peak year of 2021.</p><p>Back then, the business saw net margin hit 46% because of economies of scale amid the surge in demand for gloves, helping to strongly boost utilisation rates.</p><p>By 2022, the net margin had fallen sharply to 25%, and then slipped to 24.1% by 2023.</p><p>2024 saw a slight rebound in Riverstone’s net margin to 26.7%, but 1Q 2025 saw net margin fall to 22.4%, the lowest since the pandemic ended.</p><p>Investors, however, should put things in perspective.</p><p>Riverstone’s 1Q 2025 net margin of 22.4% was still significantly higher than its 2019 (pre-pandemic) net margin of 13.2%.</p><p>The group’s net profit of RM 56.4 million already makes up 43% of 2019’s net profit, even though just one quarter has passed.</p><p>The business also declared an interim quarterly dividend of RM 0.03 for 1Q 2025, close to half of the total dividend paid out in 2019.</p><p>Simply said, the business is now on an even stronger footing compared to pre-pandemic days.</p><h2 class=\"wp-block-heading\" id=\"h-pushing-on-with-expansion-plans\"><strong>Pushing on with expansion plans</strong></h2><p>CEO Wong Teek Son is optimistic about the group’s future as he sees growing demand for generic healthcare gloves.</p><p>Riverstone has been adjusting its product mix to cater to this demand since the fourth quarter of 2024, and the group is on track to commission three new healthcare production lines by the second half of this year.</p><p>The CEO attributed the margin compression to the shift in product mix, but reiterated the group’s intention to push out customised products with better profitability.</p><p>Also, Riverstone acquired new clients for its clean room business and expects this to contribute to both revenue and margins.</p><p>If investors stay patient, they should see better financial numbers from Riverstone soon, and its share price could rebound in line with these results.</p><p>How do rich Singaporeans invest when volatility hits?</p><p>They turn to companies with cash, history, and discipline. This free report highlights 5 blue chips that deserve your attention. <a href=\"https://thesmartinvestor.com.sg/5-singapore-dividend-paying-blue-chips-that-can-weather-uncertainty-special-free-report-art/\">Get your copy here</a> and see who made the list.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/06/Riverstone-Holdings-300x200.png",
            "link": "https://thesmartinvestor.com.sg/this-glove-companys-share-price-plunged-36-from-its-high-can-it-regain-its-mojo/",
            "pub_date": "2025-06-19 07:32:02",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Why Choose Singapore REITs? 3 Must-Know Advantages",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p><a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-an-introduction-to-reits-part-1/\">REITs</a> are a well-known asset class favoured by income investors.</p><p>The sector is known for its steady and dependable <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">distributions</a> that are the hallmark of a predictable passive income stream.</p><p>But what makes REITs more attractive than, say, investing in a physical property?</p><p>After all, investment properties are popular in Singapore and are touted by property agents as providing steady capital appreciation and good rental yield.</p><p>So, what makes Singapore REITs more attractive than owning a piece of real estate? Here are three key advantages that you need to know.</p><h2 class=\"wp-block-heading\" id=\"h-tax-exempt-income\"><strong>Tax-exempt income</strong></h2><p>First and most importantly, the distributions that you receive from REITs are tax-exempt in the hands of the unitholder.</p><p>This means that these distributions need not be included in your tax computation, similar to the dividends received from non-REIT companies.</p><p>Contrast this with the rental income that you receive from owning an investment property.</p><p>This rental income needs to be added to your total chargeable income for the year to calculate your tax payable.</p><p>As REIT distributions are not subject to taxation, you can easily build up a growing stream of dividend income for your <a href=\"https://thesmartinvestor.com.sg/smart-retirement-how-much-is-enough-for-retirement/\">retirement</a>.</p><h2 class=\"wp-block-heading\" id=\"h-diversification\"><strong>Diversification</strong></h2><p>Physical properties have hefty price tags, with the average two-bedroom condominium unit costing more than S$1 million.</p><p>Because of these high prices, most investors have to settle for just one investment property as they need to take out a loan to purchase the unit.</p><p>And when it’s time to rent out the property, you are banking on just one location to help you secure a tenant.</p><p>REITs, on the other hand, own a portfolio of properties that can provide you with much-needed diversification.</p><p>REITs also provide you with access to properties that you normally cannot easily buy in the open market, such as industrial properties, hotels, and data centres.</p><p>For instance, <strong>Frasers Centrepoint Trust</strong> (SGX: J69U) owns a portfolio of nine suburban retail malls in Singapore.</p><p>By owning a piece of this retail REIT, you gain exposure to malls that are located all over Singapore.</p><p>There are also diversified REITs that allow you to own more than one property sub-category.</p><p><strong>Lendlease Global Commercial REIT</strong> (SGX: JYEU) owns both retail properties in Singapore and commercial properties in Milan, Italy.</p><p>By purchasing a variety of REITs in different sectors, you can easily diversify your real estate exposure beyond the residential property space.</p><h2 class=\"wp-block-heading\" id=\"h-easy-to-buy-units-and-liquid\"><strong>Easy to buy units and liquid</strong></h2><p>A third key advantage of REITs is that they are securitised and listed on a stock exchange, making them very easy to buy and sell.</p><p>With the REIT being split into units, an investor only needs to fork out a small amount of money to purchase the minimum 100 units of a REIT.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>For investment property, the sums are typically in the hundreds of thousands of dollars that you need to pay for the down payment, not to mention the associated stamp duties, legal fees, and agent fees.</p><p>Take <strong>CapitaLand Integrated Commercial Trust</strong> (SGX: C38U) as an example.</p><p>At S$2.17, you only need to pay S$217 to own 100 units of the retail and commercial REIT.</p><p>For <strong>Parkway Life REIT</strong> (SGX: C2PU), an investor needs around S$400 to buy 100 units of this healthcare REIT.</p><p>This affordability makes REITs an attractive investment choice as you can slowly allocate capital to buying them, and need not commit a huge sum like you would for an investment property purchase.</p><p>Not only are REITs affordable, but they also offer liquidity as their units are easily tradable on the stock market.</p><p>Anyone who has tried to sell an investment property knows how much hassle the process involves.</p><p>You need to advertise your property, appoint an agent, and then allow buyers to view the property before the transaction is agreed upon.</p><p>Even after the sales agreement is signed, time is needed to transfer the title deed and to ensure all documents are in order before the proceeds from the sale flow into your bank account.</p><p>REITs, on the other hand, allow you to easily transact, with the proceeds from the sale arriving in your bank account in just two working days.</p><p>No hassle and no fuss – that’s the advantage of investing in REITs versus physical properties.</p><h2 class=\"wp-block-heading\" id=\"h-compounding-your-distributions\"><strong>Compounding your distributions</strong></h2><p>There is an added bonus to REIT investing, and that is the ability to easily <a href=\"https://thesmartinvestor.com.sg/getting-started-what-is-compounding-and-the-rule-of-72/\">compound</a> your dividends to generate even more cash flow.</p><p>For an investment property, the rental income you receive is just that – you cannot pump it back into the property to generate higher rental income.</p><p>REITs, on the other hand, offer this attractive option.</p><p>Armed with the dividends you receive from your REITs, you can use the money to buy even more REITs.</p><p>By doing so, you will increase the quantum of dividends you receive the next time the REIT declares a distribution, all things being equal.</p><p>This compounding can be a very powerful force in growing your wealth and is yet another advantage of REIT investing.</p><p>First-time investors: We’ve finally released our beginner’s guide to investing. Read it in an afternoon, follow the principles, pick an investing style and buy your first SGX stocks within the next few hours! Click <a href=\"https://thesmartinvestor.com.sg/how-to-invest-in-stocks-a-beginners-guide-articles/\">here</a> to download it for free.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/06/Singapore-REITs-1-300x200.png",
            "link": "https://thesmartinvestor.com.sg/why-choose-singapore-reits-3-must-know-advantages/",
            "pub_date": "2025-06-18 17:32:11",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "5 Singapore Blue-Chip Stocks with Dividend Yields of 5% and Higher",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>In a time of market uncertainty and rising living costs, income-generating investments are more valuable than ever. </p><p>For investors seeking stability and consistent returns, blue-chip stocks with strong <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividend</a> payouts offer a dependable source of passive income.</p><p>Here are five Singapore-listed <a href=\"https://thesmartinvestor.com.sg/a-guide-on-investing-in-blue-chip-companies/\">blue-chip companies</a> that not only boast solid fundamentals but also deliver dividend yields of 5% and higher.</p><h2 class=\"wp-block-heading\" id=\"h-dbs-group-holdings-sgx-d05\"><strong>DBS Group Holdings (SGX: D05)</strong></h2><p>DBS is one of the highest rated banks in Asia with its main operations being in Singapore.</p><p>The bank’s strong and consistent earnings track record can be credited to its ability to leverage on current global trends.</p><p>On 16 September 2024, CEO Piyush Gupta stated that the bank deploys over 800 Artificial Intelligence (AI) models across 350 use cases.</p><p>The use of AI was mainly used for customer engagement through hyper-personalised financial services which improve customer relations.</p><p>The impact of this use of AI in its operations was also said to exceed S$1 billion in 2025.</p><p>For the first quarter of 2025 (1Q 2025), DBS reported strong earnings with a 6% year-on-year increase in total income, reaching a record S$5.91 billion.</p><p>However, DBS saw a decrease of 2% YoY in net profits at S$2.9 billion due to the 15% global minimum tax.</p><p>On top of its operational strength, DBS also shows resilience to liquidity risks.</p><p>This resilience can be seen in its high transitional CET-1 ratio of 17.4% with a conservative value of 15.2%.</p><p>A high CET-1 ratio would mean that DBS has a high amount of buffer capital to weather economic shocks and maintain its dividends.</p><p>At S$44.45, DBS provides a trailing 12-month dividend per share (DPS) of S$2.43 and a trailing dividend yield of 5.5% .</p><h2 class=\"wp-block-heading\" id=\"h-oversea-china-banking-corporation-ltd-sgx-o39\"><strong>Oversea-China Banking Corporation Ltd (SGX: O39)</strong></h2><p>Oversea-China Banking Corporation or OCBC, is another large player in the financial institution sector in Asia, predominantly in Singapore.</p><p>For 1Q 2025, OCBC demonstrated resilient earnings with a 1% YoY growth in total income to S$3.66 billion.</p><p>However, the bank saw a decrease of 5% YoY in group net profit at S$1.88 billion.</p><p>This decrease was caused by a 4% YoY decrease in net interest income as lower net interest margins outweighed gains from asset growth in a falling interest rate environment.</p><p>Nonetheless, the rise in net profits in 2024 translates to a greater increase in long-term dividend growth.</p><p>OCBC also saw an increase in its CET-1 ratio by 1.4% YoY to a robust 17.6% in 1Q 2025.</p><p>This high ratio value indicates a strong capital position to maintain its dividend payments during economic uncertainty. </p><p>The Bank has made numerous strategic developments in recent years to remain a strong foothold in the banking industry. </p><p>In May 2025, OCBC announced that it will integrate its securities businesses in Singapore, Hong Kong and Indonesia into the bank’s Global Markets Division.</p><p>This integration allows for streamlining of operations and a wider range of financial services for its existing clients.</p><p>In September 2024, OCBC also announced that it plans to invest S$500 million into the Punggol Digital District.</p><p>This investment comes with the development of OCBC’s innovation hub and partnership with Singapore Institute of Technology.</p><p>This addition to OCBC’s ecosystem is meant for talent development for fintech and innovation to bolster its digital banking efforts.</p><p>At S$16.06, OCBC pays a trailing 12-month DPS of S$1.01 and a trailing dividend yield of 6.3%.</p><h2 class=\"wp-block-heading\" id=\"h-singapore-airlines-limited-sgx-c6l\"><strong>Singapore Airlines Limited (SGX: C6L)</strong></h2><p>Singapore Airlines Limited or SIA, is Singapore’s premier airline group that is highly respected globally.</p><p>For its fiscal 2025 (FY2025) ending on 31 March 2025, SIA reported a 3.9% YoY increase in net profit.</p><p>This net profit increase was boosted by a S$1 billion gain from the completion of the Air-India Vistara merger.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>Furthermore, cargo revenue showed strong growth of 4.4% YoY driven by strong demand for e-commerce and perishables and disruptions in sea freight.</p><p>SIA is also no stranger to the AI scene.</p><p>It has collaborations with OpenAI and <strong>Salesforce</strong> (NYSE: CRM) to develop and implement AI functions into customer service applications to deliver more consistent and personalised services.</p><p>At S$7.03, SIA provides a trailing 12-month DPS of S$0.40 and a trailing dividend yield of 5.7%.</p><h2 class=\"wp-block-heading\" id=\"h-mapletree-industrial-trust-sgx-me8u\"><strong>Mapletree Industrial Trust (SGX: ME8U)</strong></h2><p>Mapletree Industrial Trust or MIT, is a commercial REIT with 141 properties from industrial real estate assets in Singapore to data centres in the US and Japan.</p><p>For FY2025 ending 31 March 2025, MIT reported high net property income (NPI) of $531.5 million with a 2% YoY growth.</p><p>MIT’s NPI was largely contributed by the Osaka Data Centre acquisition with a 100% occupancy rate.</p><p>The renewals across Singapore properties with a 92.9% occupancy rate were also a key factor in the NPI growth.</p><p>MIT also reported a 2% YoY increase of income distributable to unitholders to S$386 million for FY2025. </p><p>The trust has made strategic divestments such as that of Georgia Data Centre at a 18.6% premium over market valuation.</p><p>Moreover, MIT had a portfolio divestment of Singapore properties such as The Synergy 1 International Business Park at 22.1% over their original investment cost.</p><p>MIT’s portfolio has a healthy portfolio weighted average lease expiry value of 4.4 years which indicates predictable rental income and steady distributions.</p><p>At S$1.96, MIT provides a trailing 12-month DPU of S$0.1357 and a trailing distribution yield of 6.9%.</p><h2 class=\"wp-block-heading\" id=\"h-united-overseas-bank-ltd-sgx-u11\"><strong>United Overseas Bank Ltd (SGX: U11)</strong></h2><p>United Overseas Bank or UOB is another leading bank in Asia with 500 offices and branches across 19 countries.</p><p>For 1Q 2025, UOB maintained a net profit of S$1.5 billion which signals consistent profitability.</p><p>UOB’s net fee income also reached a new high of S$694 million which represents a 20% YoY growth.</p><p>This performance was contributed by the bank’s diversified income streams with strong growth.</p><p>For instance, there was a 25% YoY increase in wealth management revenue and 22% YoY increase in trade loan volume.</p><p>In addition, UOB maintained a high CET-1 ratio of 15.5%, which means it has a healthy capital position to cushion economic downturns.</p><p>The bank also has a low non-performing loan ratio of 1.6% which indicates a low risk of loan defaults and future losses.</p><p>These ratios translate to UOB being able to support reliable dividend payments. </p><p>At S$34.95, UOB provides a trailing 12-month DPS of S$2.30 and a trailing dividend yield of 6.6%.</p><h2 class=\"wp-block-heading\" id=\"h-get-smart-a-dependable-income-stream\"><strong>Get Smart: A dependable income stream</strong></h2><p>Capital preservation and a steady income matter more than ever. </p><p>These five Singapore blue-chip stocks stand out for their strong fundamentals and attractive dividend yields of 5% or more, each offering a compelling case for income-focused investors.</p><p>Consider adding these resilient names to your portfolio to secure consistent passive income.</p><p>This new 10-minute read could change how you invest this year. Inside: </p><p>5 SG dividend-paying blue chips that have quietly powered through past downturns, and could reward you handsomely in the next.</p><p><a href=\"https://thesmartinvestor.com.sg/5-singapore-dividend-paying-blue-chips-that-can-weather-uncertainty-special-free-report-gab/\">Grab the free report now</a>. It might be the most profitable thing you read today.</p><p><em>Disclosure: Gabriel Lim does not own shares in any of the companies mentioned</em>.</p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2024/08/OCBC1-300x200.png",
            "link": "https://thesmartinvestor.com.sg/5-singapore-blue-chip-stocks-with-dividend-yields-of-5-and-higher/",
            "pub_date": "2025-06-18 15:32:14",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "3 Singapore-Based US-Listed Stocks with Explosive Growth Prospects",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Not all local companies choose to list on the <strong>Singapore Exchange</strong> (SGX: S68).</p><p>Some may seek to list on other bourses because of their business models, which could be more appreciated in other countries.</p><p>Other reasons could include valuations and liquidity.</p><p>That said, such companies could also demonstrate solid growth prospects despite being listed on a foreign stock exchange.</p><p>Here are three Singapore-based <a href=\"https://thesmartinvestor.com.sg/heres-why-growth-stocks-deserve-a-place-in-your-investment-portfolio/\">growth stocks</a> that are listed in the US.</p><h2 class=\"wp-block-heading\" id=\"h-sea-limited-nyse-se\"><strong>Sea Limited (NYSE: SE)</strong></h2><p>Sea Limited is a technology and e-commerce company with three main divisions.</p><p>The gaming division is parked under the Garena brand, e-commerce under the Shopee brand, and digital financial services under Monee.</p><p>The company reported strong growth with improving profitability across all three divisions.</p><p>Revenue climbed 29.6% year on year to US$4.8 billion, with operating profit soaring more than sixfold year on year to US$456.4 million.</p><p>Net profit came in at US$403 million, reversing the previous year’s net loss of US$23.7 million.</p><p>The business also generated operating cash flow of US$757 million for 1Q 2025, 61.6% higher than the prior year’s quarter.</p><p>Garena saw its quarterly active users rise 11.3% year on year to 661.8 million for the quarter.</p><p>The more important metric, quarterly paying users, surged 33% year on year to 64.8 million.</p><p>Sea Limited’s <em>Free Fire</em> continues to be the world’s largest mobile game by daily average users and downloads.</p><p>Over at Shopee, gross merchandise value (GMV) climbed 21.2% year on year to US$28.6 billion, led by a 19.2% year-on-year increase in gross orders to 3.1 billion.</p><p>Average monthly buyers on the e-commerce platform grew by 15% year on year during the quarter.</p><p>Monee also reported encouraging statistics with the loan principal growing by 75% year on year in 1Q 2025 to US$5.8 billion.</p><p>More than four million first-time borrowers were added in 1Q 2025, and management is confident of achieving loan book growth faster than Shopee’s GMV growth rate.</p><p>With all three cylinders firing, Sea Limited looks set to continue doing well in the quarters ahead.</p><h2 class=\"wp-block-heading\" id=\"h-flex-ltd-nasdaq-flex\"><strong>Flex Ltd (NASDAQ: FLEX)</strong></h2><p>Flex, previously known as Flextronics, designs, engineers, and delivers logistical and manufacturing solutions for customers at around 100 sites in approximately 30 countries.</p><p>The company hires more than 140,000 employees globally.</p><p>Flex delivered a mixed set of results for its fiscal 2025 (FY2025) ending 31 March 2025.</p><p>Sales dipped by 2.3% year on year to US$25.8 billion, but operating profit surged 37% year on year to US$1.17 billion.</p><p>Net profit, however, dipped by 3.9% year on year to US$838 million, but this was because of a significant tax credit booked in FY2024.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>Profit before tax climbed nearly 54% year on year to US$1 billion.</p><p>The business generated a healthy positive free cash flow of US$1.1 billion for FY2025, up 34% year on year.</p><p>For FY2026, Flex expects revenue to be in the range of US$25 billion to US$26.8 billion.</p><p>Importantly, the business has strong contractual protection to enable tariff pass-throughs.</p><p>Last month, Flex’s critical power business, Anord Mardix, significantly expanded its European operations to enhance its data centre offerings.</p><p>The company acquired a new manufacturing site in Poland and doubled its power product capacity in Europe to 1.2 million square feet.</p><p>Earlier this month, Flex joined forces with the Massachusetts Institute of Technology (MIT) on a new initiative for New Manufacturing, which seeks to drive innovation through advanced technologies and strengthen US manufacturing competitiveness.</p><h2 class=\"wp-block-heading\" id=\"h-grab-holdings-nasdaq-grab\"><strong>Grab Holdings (NASDAQ: GRAB)</strong></h2><p>Grab owns a superapp that provides ride-hailing, food delivery, and financial services, among others.</p><p>Founded in 2012, the company is now Southeast Asia’s largest superapp that helps connect millions of people to millions of drivers, merchants, and businesses.</p><p>Revenue for 1Q 2025 rose 18.4% year on year to US$773 million.</p><p>Gross profit improved by 25.1% year on year to US$324 million, with gross margin rising from 39.7% to 41.9%.</p><p>The business also churned out a positive free cash flow of US$47 million, reversing the negative free cash flow of US$25 million in the previous year.</p><p>Grab saw healthy traction for its annual and monthly transacting users (MTUs) since 1Q 2023.</p><p>Annual transacting users grew from 88 million to 119 million while MTUs increased from 33 million to 45 million over the same period.</p><p>Its Deliveries division saw revenue rise 18% year on year to US$415 million while GMV climbed 16% year on year to US$3.1 billion.</p><p>The mobility division also saw healthy growth with revenue rising 15% year on year to US$282 million.</p><p>GMV for this division climbed 17% year on year to US$1.8 billion.</p><p>Its Financial Services division, while small, also saw encouraging financial and operating statistics.</p><p>Revenue surged 36% year on year to US$75 million, and its loan portfolio soared 56% year on year to US$566 million.</p><p>Grab projects revenue of between US$3.33 billion to US$3.4 billion for 2025, representing year-on-year growth of 19% to 22%.</p><p>Dive into the future of technology with our newest FREE report, “The Rise of Titans.” Discover how the big 7 US tech stocks can be your ticket to huge long-term gains. <a href=\"https://thesmartinvestor.com.sg/the-rise-of-titans-art/\">Download your copy today</a> and see how easy it is to supercharge your portfolio.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang owns shares of the Singapore Exchange.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2024/07/Sea-Limited-300x200.png",
            "link": "https://thesmartinvestor.com.sg/3-singapore-based-us-listed-stocks-with-explosive-growth-prospects/",
            "pub_date": "2025-06-18 11:31:57",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Here’s How to Build Generational Wealth with These 4 Singapore Blue-Chip Stocks",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Many people believe it’s essential to leave a lasting legacy for future generations.</p><p>Apart from cash and property, you can also bequeath shares of high-quality companies to the next generation.</p><p>To ensure that your kids and grandkids need not spend too much time managing these stocks, you should pick quality, <a href=\"https://thesmartinvestor.com.sg/a-guide-on-investing-in-blue-chip-companies/\">blue-chip stocks</a> that can coast along through good times and bad.</p><p>These stocks should ideally have a strong business model, a long track record of paying <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividends</a>, and possess sustainable <a href=\"https://thesmartinvestor.com.sg/investors-should-look-for-these-3-catalyst-signals-to-boost-their-stocks/\">catalysts</a> that can take the business to the next level.</p><p>Here are four solid Singapore blue-chip stocks that you can consider buying to pass down to future generations.</p><h2 class=\"wp-block-heading\" id=\"h-dbs-group-sgx-d05\"><strong>DBS Group (SGX: D05)</strong></h2><p>DBS is no stranger to most Singaporeans, being Singapore’s largest bank by market capitalisation.</p><p>The well-run bank is one of the key pillars of Singapore’s economy.</p><p>The lender reported a strong result for the first quarter of 2025 (1Q 2025).</p><p>Total income rose 6% year on year to S$5.9 billion, led by a 2% year-on-year increase in commercial book net interest income to S$3.7 billion.</p><p>Fee and commission income also racked up a 22% year-on-year increase to S$1.28 billion, buoyed by higher wealth management fees and card spending.</p><p>DBS’s net profit for 1Q 2025, however, dipped slightly by 2% year on year to S$2.9 billion because of the imposition of a 15% global minimum tax rate.</p><p>The bank dished out a total quarterly dividend of S$0.75, comprising a core ordinary dividend of S$0.60 and a capital return dividend of S$0.15.</p><p>This total dividend was almost 39% higher than the previous year’s S$0.54.</p><p>CEO Tan Su Shan provided a sanguine outlook as business momentum stayed strong in April, but highlighted risks stemming from <a href=\"https://thesmartinvestor.com.sg/trumps-global-tariff-shock-what-should-singapore-investors-do-now/\">Trump’s raft of tariffs</a>.</p><p>For 2025, net interest income should still rise slightly from last year’s levels as a larger loan book will help to offset lower net interest margins.</p><p>Non-interest fee income should also climb by mid-to-high single digits for the year.</p><h2 class=\"wp-block-heading\" id=\"h-singapore-exchange-limited-sgx-s68\"><strong>Singapore Exchange Limited (SGX: S68)</strong></h2><p>Singapore Exchange Limited, or SGX, is Singapore’s sole stock exchange operator.</p><p>The group enjoys a natural monopoly as Singapore’s sole bourse operator and has also evolved its business model to become a multi-asset exchange.</p><p>This evolution has made the business more resilient to downturns and sudden market shocks as SGX’s slate of securities can help investors and portfolio managers to buffer their investment portfolios.</p><p>SGX reported a commendable set of earnings for the first half of fiscal 2025 (1H FY2025) ending 31 December 2024.</p><p>Net revenue rose 15.6% year on year to S$646.4 million, led by growth in all business segments.</p><p>Net profit (excluding exceptional items) soared 27.3% year on year to S$320.1 million.</p><p>SGX upped its quarterly dividend to S$0.09 from S$0.085 a year ago.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>Management is optimistic about achieving SGX’s target to grow its net revenue by 6% to 8% every year.</p><p>Dividends should also grow in tandem, with management looking to increase the dividend per share by mid-single digit % over the medium term.</p><h2 class=\"wp-block-heading\" id=\"h-keppel-dc-reit-sgx-ajbu\"><strong>Keppel DC REIT (SGX: AJBU)</strong></h2><p>Keppel DC REIT is a data centre REIT with a portfolio of 24 data centres across 10 countries, with total assets under management of around S$4.9 billion.</p><p>The REIT is seeing healthy momentum in data centre demand, driven by generative artificial intelligence (AI) workloads along with organisations adopting cloud computing.</p><p>These trends should continue to drive strong demand for data centres, thus helping the REIT to achieve high occupancy and record positive rental reversions.</p><p>Keppel DC REIT pulled off an impressive performance for 1Q 2025 and was one of the top business performers in the <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-an-introduction-to-reits-part-1/\">REIT sector</a>.</p><p>Gross revenue leapt 22.6% year on year to S$102.2 million, led by acquisitions of data centres in Tokyo and Singapore, along with contract renewals and rental escalations.</p><p>Net property income jumped 24.1% year on year to S$88.1 million.</p><p>Distribution per unit logged a 14.2% year-on-year increase to S$0.02503, helped by higher finance income from the REIT’s ownership of an Australian data centre note.</p><p>The REIT’s portfolio occupancy remained high at 96.5% as of 31 March 2025, and a positive portfolio rental reversion of 7% was recorded even though there were no major contract renewals for the quarter.</p><h2 class=\"wp-block-heading\" id=\"h-singtel-sgx-z74\"><strong>Singtel (SGX: Z74)</strong></h2><p>Singtel is Singapore’s largest telecommunication company (telco) by market capitalisation and offers a comprehensive range of services, including mobile, pay TV, broadband, and cybersecurity services.</p><p>The telco announced a long-term strategy called ST28 to lift its business performance by scaling up its growth engines.</p><p>Management will also implement active capital management to create value.</p><p>This two-prong approach should result in both growth and higher dividends over time.</p><p>For its fiscal 2025 (FY2025) ending 31 March 2025, Singtel reported a 9% year-on-year increase in underlying net profit to S$2.47 billion.</p><p>The strong performance was contributed to by better results from Optus, NCS, and regional associates AIS and Airtel.</p><p>In line with the good results, the telco declared a final core dividend of S$0.067 and a value realisation dividend of S$0.033.</p><p>Coupled with its total interim dividend of S$0.07, the total dividend for FY2025 stood at S$0.17, two cents above the S$0.15 paid out for FY2024.</p><p>At the same time, management also announced the establishment of a S$2 billion share buyback programme that will be funded by excess capital from the group’s capital recycling proceeds.</p><p>Boost your portfolio’s returns with 5 SGX stocks that promise both stability and steady growth. We bring you the names of these rock-solid stocks, including why they could drive massive dividends over the next few years. If you’re looking to invest for retirement, this guide is a must-read. <a href=\"https://thesmartinvestor.com.sg/unlock-your-retirement-dreams-5-dividend-stocks-that-deliver-art/\">Click HERE</a> to download now.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang owns shares of DBS Group, Singapore Exchange Limited and Keppel DC REIT.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2023/09/DBS-300x200.png",
            "link": "https://thesmartinvestor.com.sg/heres-how-to-build-generational-wealth-with-these-4-singapore-blue-chip-stocks/",
            "pub_date": "2025-06-18 07:32:06",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "14 Years of Sheng Siong: How Much You Gained Investing in 1,000 IPO Shares",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p><strong>Sheng Siong</strong> (SGX: OV8) is one of the outstanding performers in Singapore’s stock market.</p><p>Since its initial public offering (IPO) on 17 August 2011, shares of the supermarket operator have surged significantly from its IPO price of S$0.33.</p><p>Sheng Siong’s last close was S$1.86, registering a gain of more than sixfold for those who held on since the IPO.</p><p>But hold on, that’s not all.</p><p>There are still the steady and increasing <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividends</a> that the supermarket operator has paid out over the years.</p><p>Let’s take a closer look at how much you would have gained over the past 14 years if you had invested in 1,000 shares of Sheng Siong at its IPO.</p><h2 class=\"wp-block-heading\" id=\"h-a-stellar-return\"><strong>A stellar return</strong></h2><p>Assuming you purchased 1,000 shares of the retailer at its IPO, you would have forked out a grand total of S$330 (1,000 x S$0.33).</p><p>Since its IPO almost 14 years ago, Sheng Siong’s shares have gained 464% to close at S$1.86, meaning your investment would have increased from S$330 to S$1,860.</p><p>Sheng Siong has also been paying out consistent, twice-yearly dividends since it went public.</p><p>The supermarket operator paid out a final dividend of S$0.0177 back in 2011, the year that it held its IPO.</p><p>From 2012 to 2024, the total dividend per share distributed by the group amounted to S$0.5742.</p><p>Add this to the 2011 dividend and you get a total of S$0.5919, which is even higher than Sheng Siong’s original S$0.33 IPO price.</p><p>With 1,000 shares, you would have received a total of S$591.90 in dividends over these 14 years.</p><p>If we add this to the value of your shares, it will result in a total of S$2,452.</p><p>Your original S$330 investment in Sheng Siong would have leapt more than sevenfold, and delivered around a 15.4% compound annual growth rate.</p><p>Not bad for a retailer which sells a variety of live and chilled food along with daily necessities.</p><p>You may be asking – what caused this bonanza, and can it continue into the future?</p><p>Let’s find out.</p><h2 class=\"wp-block-heading\" id=\"h-growth-in-store-count-revenue-and-net-profit\"><strong>Growth in store count, revenue, and net profit</strong></h2><p>Since its IPO, Sheng Siong has greatly increased the number of stores it operates in Singapore.</p><p>At the end of 2011, the group only had 25 stores around the island.</p><p>By 2018, this number had more than doubled to 54 stores.</p><p>Even during the COVID-19 pandemic, Sheng Siong managed to open at least one store per year, taking its total store count to 69 by the end of 2023.</p><p>2024 saw a sharp jump in the number of stores to 75, and with two new stores just opened in the first quarter of 2025, Sheng Siong’s store count stood at 77 as of 31 March 2025.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>Sheng Siong’s revenue and net profit also climbed in tandem with the increase in the number of stores.</p><p>The retailer’s revenue was just S$578.4 million back in 2011 but has since more than doubled to S$1.43 billion by 2024.</p><p>Net profit did even better, leaping more than fivefold over the same period from S$27.3 million to S$137.5 million.</p><p>Sheng Siong’s annual dividend per share has also more than doubled from S$0.0275 to S$0.064.</p><h2 class=\"wp-block-heading\" id=\"h-the-future-is-yet-to-be\"><strong>The future is yet to be</strong></h2><p>The group has displayed continued growth for the first quarter of 2025 (1Q 2025).</p><p>Revenue rose 7.1% year on year to S$403 million while net profit increased by 6.1% year on year to S$38.5 million.</p><p>Sheng Siong secured an additional six retail locations which are expected to open by 3Q 2025.</p><p>Of these six locations, two of them (KINEX and Cathay Building) are in private retail locations, a first for the group.</p><p>Another four tender results are also expected to be announced soon, which means the group could potentially add more new stores under its belt.</p><p>Once these six new locations open, Sheng Siong will have a network of 83 stores around Singapore.</p><h2 class=\"wp-block-heading\" id=\"h-get-smart-more-growth-expected\"><strong>Get Smart: More growth expected</strong></h2><p>The growth in Sheng Siong’s stores is in line with the buildup of HDB flats in new and existing estates.</p><p>From 2021 to 2025, HDB exceeded its target of launching 100,000 build-to-order (BTO) flats.</p><p>The government is also slated to deliver the keys to 19,000 households in 2025.</p><p>From 2025 to 2027, more than 50,000 new HDB units will be launched, as part of Singapore’s effort to build more flats for its growing population.</p><p>With these plans afoot, Sheng Siong should have more than ample shop spaces to bid for in new estates.</p><p>Its 2025 slate of new stores looks promising, but it looks like more growth can be expected with these new BTO launches.</p><p>We have seen how the retailer has grown its top and bottom lines in line with the growth in its store count.</p><p>Investors can expect the group to continue doing well as its extends its presence into new areas and also into private retail spaces.</p><p>Some companies cut dividends in a downturn. These 5 didn’t.</p><p>Find out which Singapore blue chips have weathered past chaos…and why they could be your portfolio’s anchors in the next wave of downturn. <a href=\"https://thesmartinvestor.com.sg/5-singapore-dividend-paying-blue-chips-that-can-weather-uncertainty-special-free-report-art/\">Download the report free</a>.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2024/05/Sheng-Siong-Geylang-East-Outlet-300x200.png",
            "link": "https://thesmartinvestor.com.sg/14-years-of-sheng-siong-how-much-you-gained-investing-in-1000-ipo-shares/",
            "pub_date": "2025-06-17 17:32:22",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Can Frasers Centrepoint Trust Continue to Increase its DPU?",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p><strong>Frasers Centrepoint Trust</strong> (SGX: J69), or FCT, is one of the few <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-an-introduction-to-reits-part-1/\">REITs</a> to have done well in the last two years.</p><p>The retail REIT’s performance held up despite the twin challenges of elevated <a href=\"https://thesmartinvestor.com.sg/will-rising-interest-rates-affect-the-stock-market/\">interest rates</a> and soaring <a href=\"https://thesmartinvestor.com.sg/higher-prices-are-coming-heres-what-you-can-do-to-beat-inflation/\">inflation</a>.</p><p>It’s a testament to FCT’s resilience as its portfolio of suburban retail malls serves heartlanders who need to shop there for daily necessities and food.</p><p>However, investors may be wondering if the REIT can continue with this solid track record.</p><p>Can FCT become one of the few REITs that are posting higher <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">distributions</a> even with the persistent headwinds?</p><h2 class=\"wp-block-heading\" id=\"h-a-robust-financial-performance\"><strong>A robust financial performance</strong></h2><p>FCT is a pure-play Singapore suburban retail REIT, and investors who park their money in it can gain exposure to a portfolio of nine malls spread across Singapore, as shown below.</p><figure class=\"wp-block-image\"><img alt=\"\" decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXfksYbMrqKOgxxAL8gjeGRF6APZR3Oe2kkfSeMxAq1Cw1nKtUB_2JnN6reP1pVoFAuul7Oj9KMKzRV7pFSz3ba9MuxYs-VF7hRhJiWsW7Cy6UD4XVWpC_yI155sSgBTL_IOqiciH6s3Ta_vlWCiNA?key=zCw9kknJDfbPWzJ-Fg--_g\"/><figcaption class=\"wp-element-caption\">Source: FCT Investor Presentation</figcaption></figure><p>The REIT is also the largest prime suburban retail space owner with a 10.3% market share as of 31 October 2024.</p><p>This strong market position enables the REIT to attract quality tenants and also creates high tenant demand for its mall spaces.</p><p>The retail REIT announced a robust set of earnings for the first half of fiscal 2025 (1H FY2025) ending 31 March 2025.</p><p>Gross revenue rose 7.1% year on year to S$184.4 million, boosted by the completion of the asset enhancement initiative (AEI) at Tampines 1 along with higher occupancy and rental rates across its portfolio of malls.</p><p>Net property income (NPI) increased by 7.3% year on year to S$133.7 million.</p><p>FCT’s distribution per unit (DPU) inched up 0.5% year on year to S$0.06054.</p><p>This DPU increase was encouraging as FCT previously reported a slight year-on-year dip in its DPU for FY2024 because of the divestment of Changi City Point.</p><h2 class=\"wp-block-heading\" id=\"h-healthy-rental-reversions-with-high-occupancy\"><strong>Healthy rental reversions with high occupancy</strong></h2><p>There are encouraging signs that the DPU momentum can continue.</p><p>The REIT’s retail portfolio occupancy stood high at 99.5% for the second quarter of FY2025 (2Q FY2025), dipping just slightly below the 99.9% recorded for 2Q FY2024.</p><p>FCT also posted a positive rental reversion of 9% for 1H FY2025, higher than the 7.5% reversion logged in 1H FY2024.</p><p>Notably, FCT’s rental reversion has seen an increasing trend.</p><p>FY2024 saw positive rental reversion of 7.7%, higher than the previous year’s 4.7%.</p><p>This increasing trend demonstrates the high demand for FCT’s portfolio of suburban malls and is a testament to the portfolio’s strength.</p><p>Both shopper traffic and tenant sales also recorded increases.</p><p>For 1H FY2025, shopper traffic improved by 1% year on year while tenant sales increased by 3.3% year on year.</p><p>FCT’s aggregate leverage stood at 38.6% as of 31 March 2025, in line with the level a year ago, but its cost of debt has fallen from 4.1% for 2Q FY2024 to 3.8%.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>This fall is positive for the REIT as the manager can tap into more debt for yield-accretive acquisitions that will see a lower hurdle rate.</p><h2 class=\"wp-block-heading\" id=\"h-portfolio-enhancements-and-acquisitions\"><strong>Portfolio enhancements and acquisitions</strong></h2><p>Speaking of acquisitions, FCT has been active in acquiring properties in the last few years.</p><p>Back in 2023, the REIT purchased an additional 10% stake in Waterway Point Mall for around S$132.3 million, raising its stake from 40% to 50%.</p><p>Early last year, FCT scooped up an additional 24.5% interest in NEX Mall for around S$523.1 million, increasing its ownership from 25.5% to 50%.</p><p>And just last month, the retail REIT completed the acquisition of a 100% stake in Northpoint City South Wing.</p><p>These acquisitions are all yield-accretive and show that management has a clear strategy in acquiring quality assets to boost the REIT’s asset base and DPU.</p><p>Then, there are also AEIs.</p><p>FCT completed its Tampines 1 AEI on schedule in August 2024.</p><p>The newly renovated mall achieved a 100% mall committed occupancy with a return on investment that exceeded 8%.</p><p>More than 9,000 square feet of net lettable area (NLA) was created and deployed to prime retail floors.</p><p>At the same time, the manager introduced 46 new-to-FCT concepts such as Hawkers’ Street, Sinpopo Brand, and Sushi Plus.</p><p>The latest AEI, which commenced in April 2025, is for Hougang Mall.</p><p>The manager has already secured several new-to-mall brands such as Lau Wang and Yangguofu to add to the mall’s selection of food and beverage offerings.</p><p>The AEI is projected to be completed by the third quarter of 2026 and should achieve a return on investment of around 7%.</p><h2 class=\"wp-block-heading\" id=\"h-get-smart-a-future-ready-reit\"><strong>Get Smart: A future-ready REIT</strong></h2><p>The evidence is clear.</p><p>FCT’s malls sport strong operating metrics and can continue to attract reputable tenants, as evidenced by the REIT’s consistently positive rental reversion.</p><p>Coupled with yield-accretive acquisitions and AEIs with positive returns, the REIT looks well-positioned to continue to deliver higher DPU in the years ahead.</p><p>Looking to create a lifelong income stream? Check out our report, ‘7 Singapore Blue-Chip Stocks That Can Pay You for Life.’ We uncover a powerful lineup of dividend-paying stocks with the reliability and growth potential you need in today’s market. Don’t miss out on these dependable picks. <a href=\"https://thesmartinvestor.com.sg/7-singapore-blue-chip-stocks-that-can-pay-you-for-life-art/\">Download your copy now</a> and start building a secure financial future!</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/05/Tampines-Mall-FCT-300x200.png",
            "link": "https://thesmartinvestor.com.sg/can-frasers-centrepoint-trust-continue-to-increase-its-dpu/",
            "pub_date": "2025-06-17 11:32:18",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Looking for Red-Hot Growth Stocks? These 4 US Companies Could be Right for Your Portfolio",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>The US market is a fertile hunting ground for solid <a href=\"https://thesmartinvestor.com.sg/heres-why-growth-stocks-deserve-a-place-in-your-investment-portfolio/\">growth stocks</a>.</p><p>When held over the long term, these companies can help to grow the value of your portfolio steadily through capital appreciation.</p><p>To filter these stocks out, it’s essential to look for companies that demonstrate a robust growth track record and possess catalysts that can take their business to the next level.</p><p>We shine the spotlight on four growth stocks that you can consider adding to your growth buy watchlist.</p><h2 class=\"wp-block-heading\" id=\"h-sharkninja-nyse-sn\"><strong>Sharkninja (NYSE: SN)</strong></h2><p>SharkNinja is a global product design and technology company with a diversified portfolio of lifestyle inventions that help to better people’s lives.</p><p>The company has two well-known brands, Shark and Ninja, and has more than 5,200 patents across 36 product sub-categories.</p><p>SharkNinja reported a steady set of results for the first quarter of 2025 (1Q 2025).</p><p>Sales rose 14.7% year on year to US$1.2 billion, but operating profit dipped by 6.5% year on year to US$144.9 million because of higher sales and marketing expenses.</p><p>Net profit, however, climbed 7.5% year on year to US$117.8 million.</p><p>The company believes that it has a deep competitive moat because of its focus on four key areas: disruptive innovation, a global supply chain, 360-degree marketing, and omnichannel distribution.</p><p>Management communicated its three-pillar growth strategy to drive sustainable long-term growth.</p><p>The first is to grow its share in existing categories by leveraging its track record of bringing innovative products to market.</p><p>Sharkninja delivered new products such as Ninja Crispi, a first-of-its-kind portable cooking system, that showcases innovation within its existing categories.</p><p>The second pillar is to enter adjacent and new categories to grow its total addressable market.</p><p>New sub-categories were introduced last year in product areas such as coolers, skincare, and indoor-outdoor fans.</p><p>The last pillar is international expansion beyond the 35 markets that the company is already in.</p><h2 class=\"wp-block-heading\" id=\"h-uipath-nyse-path\"><strong>UiPath (NYSE: PATH)</strong></h2><p>UiPath provides agentic automation by making use of AI agents to execute and optimise complex business processes.</p><p>Its platform allows customers to scale their agentic automation efficiently to allow AI to deliver its full potential.</p><p>UiPath reported steady growth for the first quarter of fiscal 2026 (1Q FY2026) ending 30 April 2025.</p><p>Revenue rose 6.4% year on year to US$356.6 million while gross profit inched up 4.6% year on year to US$292.8 million.</p><p>Gross margin, however, dipped slightly from 83.5% a year ago to 82.1%, but remained high.</p><p>The business churned out a positive free cash flow of US$106.2 million for the quarter, up 7.5% year on year.</p><p>The number of large customers has also risen this quarter.</p><p>Customers with more than US$100,000 in annual recurring revenue (ARR) increased by 13% year on year to 2,365.</p><p>Customers with ARR exceeding US$1 million rose 9.7% year on year to 316.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>UiPath is also collaborating with other companies to improve its capabilities.</p><p>Back in May, the company partnered with <strong>Microsoft’s</strong> (NASDAQ: MSFT) Copilot Studio agents, allowing customers to automate complex end-to-end processes.</p><p>UiPath also partnered with <strong>HCL Technologies</strong> (NSE: HCLTECH) to accelerate agentic automation for UiPath customers globally across industries.</p><h2 class=\"wp-block-heading\" id=\"h-sonic-automotive-nyse-sah\"><strong>Sonic Automotive (NYSE: SAH)</strong></h2><p>Sonic Automotive is one of the US’s largest automotive retailers and has franchised dealerships representing over 25 different vehicle brands.</p><p>For 1Q 2025, Sonic Automotive saw total revenue increase 8% year on year to US$3.65 billion, led by a 14% year-on-year increase in new vehicle sales.</p><p>Operating profit jumped 36% year on year to US$145 million while net profit surged 68% year on year to US$70.6 million.</p><p>A quarterly <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividend</a> of US$0.35 was declared, a 17% year-on-year improvement over the previous year’s US$0.30.</p><p>For the quarter, the company generated a positive free cash flow of US$150.8 million, significantly higher than the US$26.3 million churned out a year ago.</p><p>Back in December 2024, Sonic Automotive acquired Audi New Orleans, adding yet one more brand and region to its burgeoning portfolio of car brands.</p><p>Management is focused on growing its volumes and profitability and gaining market share in franchised dealerships and powersports segments.</p><p>CFO Heath Byrd is optimistic about opportunities to strategically deploy capital to grow the company’s revenue base and enhance shareholder returns.</p><h2 class=\"wp-block-heading\" id=\"h-tapestry-nyse-tpr\"><strong>Tapestry (NYSE: TPR)</strong></h2><p>Tapestry sells a variety of luxury goods under famous brands Coach, Kate Spade New York, and Stuart Weitzman.</p><p>For the first nine months of fiscal 2025 (9M FY2025) ending 29 March 2025, Tapestry reported a solid set of earnings.</p><p>Revenue rose 4.1% year on year to US$5.3 billion while operating profit climbed 10.3% year on year to US$998.5 million.</p><p>Net profit increased by 6.6% year on year to US$700.3 million.</p><p>The business generated positive free cash flow of US$682.4 million for 9M FY2025.</p><p>Tapestry paid out a quarterly dividend of US$0.35 per share.</p><p>The company continued to advance on its strategic priorities by acquiring over 1.2 million new customers in the US, with two-thirds driven by Gen Z and Millennial consumers.</p><p>The business also increased direct-to-consumer revenue by 9% on a constant currency basis as part of its goal of delivering omnichannel experiences.</p><p>Tapestry also introduced a US$2 billion share repurchase programme and, coupled with its previous mandate, has a total mandate to buy back US$2.8 billion worth of shares.</p><p>Generative AI is reshaping the stock market, but not in the way most investors think. It’s not just about <em>which</em> companies are using AI. It’s about <em>how</em> they’re using it to unlock new revenue, dominate their markets, and quietly reshape the business world. Our latest FREE report “How GenAI is Reshaping the Stock Market” breaks the hype down, so you can invest with greater clarity and confidence. <a href=\"https://thesmartinvestor.com.sg/how-genai-is-reshaping-the-stock-market-art/\">Click here</a> to download your copy today.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/06/Tapestry-300x200.png",
            "link": "https://thesmartinvestor.com.sg/looking-for-red-hot-growth-stocks-these-4-us-companies-could-be-right-for-your-portfolio/",
            "pub_date": "2025-06-17 07:31:53",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore REITs: Earn Double Your CPF OA’s 2.5% (or More!)",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Many people rely on their Central Provident Fund (CPF) accounts to grow their savings and build wealth.</p><p>While the CPF scheme is a reliable way to accumulate savings, did you know that the Ordinary Account (OA) only pays an interest rate of 2.5%?</p><p>This interest rate is hardly sufficient to offset the effects of <a href=\"https://thesmartinvestor.com.sg/higher-prices-are-coming-heres-what-you-can-do-to-beat-inflation/\">inflation</a>, which hovers between 2% and 3% over the long term.</p><p>Inflation erodes the value of your money, giving you less spending power over time.</p><p>There is, however, a solution, and it can be found in Singapore’s <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-an-introduction-to-reits-part-1/\">REIT sector</a>.</p><h2 class=\"wp-block-heading\" id=\"h-reits-are-reliable-as-income-instruments\"><strong>REITs are reliable as income instruments</strong></h2><p>First off, you may be wondering what REITs, or real estate investment trusts, are.</p><p>REITs represent bundles of real estate that are packaged together into a security that is traded on a stock exchange.</p><p>These properties provide predictable and steady rental income and are professionally managed by a REIT manager.</p><p>REITs are mandated to pay out at least 90% of their earnings as <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">distributions</a>, making them perfect as income instruments.</p><p>Income-seeking investors can accumulate a portfolio of REITs and enjoy a steady stream of dividends from their shareholdings.</p><p>What’s more, income derived from REITs does not attract tax, giving you yet another benefit of owning shares of REITs.</p><p>This tax exemption is different from owning a physical investment property, where the rental income has to be factored into your total chargeable income when you submit your tax returns.</p><h2 class=\"wp-block-heading\" id=\"h-enjoying-5-yields-or-higher\"><strong>Enjoying 5% yields or higher</strong></h2><p>Yet, the factors above are not what make REITs so attractive.</p><p>REITs not only dish out reliable dividends to investors but also provide yields that are more than double what the CPF OA is paying.</p><p>Take <strong>Mapletree Industrial Trust</strong> (SGX: ME8U), or MIT, for example.</p><p>The industrial REIT announced a distribution per unit (DPU) of S$0.1357 for its latest fiscal 2025 (FY2025) ending 31 March 2025.</p><p>The REIT’s DPU enjoyed a 1% year-on-year increase from S$0.1343 the year before.</p><p>At a unit price of S$1.97, the REIT provides a trailing distribution yield of 6.9%.</p><p>MIT is also backed by a strong sponsor in Mapletree Investments Pte Ltd and boasts a high portfolio occupancy rate of 91.6%.</p><p>There is also <strong>Frasers Centrepoint Trust</strong> (SGX: J69U), or FCT, a retail REIT with a portfolio of nine suburban malls in Singapore.</p><p>FCT reported an annualised DPU of S$0.12108, giving its shares a forward distribution yield of 5.6%.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>The retail REIT boasts a very high retail occupancy of 99.5% and is backed by a reputable sponsor in <strong>Frasers Property Limited</strong> (SGX: TQ5).</p><p>Then there’s <strong>CapitaLand Integrated Commercial Trust</strong> (SGX: C38U), or CICT, a retail and commercial REIT with assets worth S$26 billion.</p><p>CICT’s DPU for 2024 rose 1.2% year on year to S$0.1088, giving its shares a trailing distribution yield of 5.1%.</p><p>The REIT is backed by a strong sponsor in <a href=\"https://thesmartinvestor.com.sg/a-guide-on-investing-in-blue-chip-companies/\">blue-chip</a> property group <strong>CapitaLand Investment Limited</strong> (SGX: 9CI).</p><p>The examples above show that you can enjoy a dividend yield of 5% or more by investing in such REITs.</p><h2 class=\"wp-block-heading\" id=\"h-growing-your-source-of-passive-income\"><strong>Growing your source of passive income</strong></h2><p>But that’s not all.</p><p>As you allocate more money to REITs over time, you can also steadily increase the quantum of dividends you receive.</p><p>Whenever you have spare cash from your savings or bonus, remember to park some in reliable REITs that pay out a good distribution yield.</p><p>When your dividend amount becomes substantial enough, you can also reinvest the dividends you receive into the very same REITs that paid them out.</p><p>This process of reinvesting your dividends to generate more dividends is known as “compounding”.</p><p>Albert Einstein, a famous scientist, once commented that compounding is the eighth wonder of the world.</p><p>By harnessing the magic of compounding, you can grow your flow of passive income to better prepare yourself for <a href=\"https://thesmartinvestor.com.sg/smart-retirement-how-much-is-enough-for-retirement/\">retirement</a>.</p><h2 class=\"wp-block-heading\" id=\"h-get-smart-reits-for-the-long-term\"><strong>Get Smart: REITs for the long term</strong></h2><p>We have demonstrated why REITs are perfect as income instruments for income-seeking investors.</p><p>Not only are their distributions consistent, but they are also tax-free in the hands of the recipient.</p><p>Many REITs also provide a distribution yield exceeding 5%, which is more than double what the CPF OA’s interest rate pays.</p><p>Hence, it’s a good idea for every investor to include some REITs within their investment portfolio to enjoy passive income.</p><p>By holding these REITs and adding to them over time, you can use compounding to build up a larger flow of dividends that you can retire on.</p><p>First-time investors: We’ve finally released our Beginner’s Guide. Read it in an afternoon, follow the principles, pick an investing style and buy your first SGX stocks within the next few hours! Click <a href=\"https://thesmartinvestor.com.sg/how-to-invest-in-stocks-a-beginners-guide-articles/\">here</a> to download it for free.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/06/Singapore-Reits-300x200.png",
            "link": "https://thesmartinvestor.com.sg/singapore-reits-earn-double-your-cpf-oas-2-5-or-more/",
            "pub_date": "2025-06-16 17:32:26",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "3 Singapore Stocks to Watch as Oil Prices Climb",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Oil prices spiked following the air strikes between Israel and Iran.</p><p>Prices surged as high as 13% on Friday over concerns of disruptions in the Middle East oil supply.</p><p>The US stock market reacted negatively to this development.</p><p>On the other hand, if oil prices remain high, three Singapore-listed companies may benefit.</p><h2 class=\"wp-block-heading\" id=\"h-seatrium-limited-sgx-5e2\"><strong>Seatrium Limited (SGX: 5E2)</strong></h2><p>Seatrium is an engineering solutions company specialising in engineering solutions for energy infrastructure.</p><p>This infrastructure includes rigs and floating production storage, offloading (FPSO) units and vessel construction.</p><p>The firm’s Singapore operations also boasts the largest integrated yard globally with a strong delivery track record.</p><p>When oil prices increase, offshore exploration and production spending increase in tandem.</p><p>This increased spending drives demand for infrastructure services offered by Seatrium, bolstering its core revenue streams.</p><p>As the offshore and marine industry improves, Seatrium’s net gearing ratio decreased to 0.11 times at the end of 2024.</p><p>This means that Seatrium will have more bidding power for larger projects to capitalise on the oil price uptick.</p><p>In addition, Seatrium has also secured contracts for FPSO units P-84 and P-85 from <strong>Petrobras</strong> (BVMF: PETR4) to start construction in the first quarter of 2025 (1Q 2025).</p><p>These additional assets place Seatrium in a strategic position to capitalise on this upturn in oil prices.</p><p>According to a Morningstar report on 30 May 2025, analysts forecasted an operating margin expansion to 10.3% by 2028.</p><p>The analysts also estimated a fair value on Seatrium’s stock price at S$2.92.</p><p>This is a 41.7% upside from its current trading price of S$2.06 as of 13 June 2025.</p><h2 class=\"wp-block-heading\" id=\"h-keppel-ltd-sgx-bn4\"><strong>Keppel Ltd (SGX: BN4)</strong></h2><p>Keppel is an alternative asset management firm with S$88 billion of funds under management.</p><p>The company’s key business segments include real estate, infrastructure and connectivity.</p><p>The firm’s best performing division is its infrastructure segment which invests in renewable energy assets and natural gas power plants.</p><p>When oil prices rise, there will be higher demand for other energy substitutes such as natural gas and renewable energy.</p><p>This demand will drive revenue growth for its infrastructure segment.</p><p>Keppel is also poised to capture this trend as it plans to expand Singapore’s power generation from 1.5 GW to 3 GW by 2030.</p><p>Furthermore, Keppel announced its Vision 2030 strategy back in 2020.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>It plans to restructure its portfolio by divesting existing assets to expand its renewable energy segment by 2030.</p><p>Moreover, the company is planning to monetise the remaining of its vendor notes in marine assets like AssetCo.</p><p>AssetCo is an entity set up by Keppel to hold its offshore and marine legacy assets such as oil rigs.</p><p>According to Morningstar’s report, analysts estimated a fair value of S$8.60 for Keppel’s share price.<br/>As of 13 June 2025, this is an upside of 19.1% at the current share price of S$7.22.</p><h2 class=\"wp-block-heading\" id=\"h-sembcorp-industries-ltd-sgx-u96\"><strong>Sembcorp Industries Ltd (SGX: U96)</strong></h2><p>Sembcorp is a Singapore-based energy supplier and urban development company.</p><p>For its financial year ending on 31 December 2024, Sembcorp supplies power to one-third of Singapore’s data centres.</p><p>The increase in oil prices is strongly beneficial for Sembcorp with its strong foothold in alternative energy segments.</p><p>In 2024, Sembcorp acquired 30% of Senko Energy, expanding its capacity to supply power.</p><p>The company also reported a 600MW hydrogen-ready gas fired power plant which will be completed by the end of 2026.</p><p>This power plant consists of a multi-utilities centre to supply energy from numerous sources which are substitutes of oil.</p><p>An increase in oil prices will then lead to a margin expansion for Sembcorp’s gas-powered business segments.</p><p>In 2024, Sembcorp reported a 4.1 GW renewables capacity growth from the end of 2023 to 17 GW, moving towards a target of 25 GW by 2028.</p><p>Additionally, 51% of gas-powered contracts have more than 10 years in their tenure.</p><p>This signals margin security as fixed-long term contracts insulate earnings from short-term volatility while still locking in the oil-linked upswing.</p><h2 class=\"wp-block-heading\" id=\"h-get-smart-sustainable-growth\"><strong>Get Smart: Sustainable growth</strong></h2><p>There is no guarantee that oil prices will remain elevated.</p><p>Obviously, no one should be hoping for more conflicts to drive prices higher.</p><p>Instead, investors should seek sustainable trends that drive energy demand higher.</p><p>For instance, artificial intelligence usage is expected to sustain energy growth over the long term. </p><p>If demand remains high, then energy stocks could benefit in turn.  </p><p>We’ve found 5 SGX-listed dividend stocks with strong track records in turbulent markets. If you want consistency in an uncertain world, <a href=\"https://thesmartinvestor.com.sg/5-singapore-dividend-paying-blue-chips-that-can-weather-uncertainty-special-free-report-gab/\">start here</a>.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Gabriel Lim does not own shares of any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/02/seatrium-2-300x200.png",
            "link": "https://thesmartinvestor.com.sg/3-singapore-stocks-to-watch-as-oil-prices-climb/",
            "pub_date": "2025-06-16 15:02:05",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "4 Investment Truths That Beginner Investors Should Know About",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>As we step into 2025 and embrace the Year of the Snake, many of you may be gearing up to make your first move in the stock market.</p><p>Maybe you’ve received a generous bonus or saved up a nice chunk of money, ready to invest in stocks and start growing your wealth.</p><p>The good news? You’ve already taken the most important step in what could be a rewarding financial journey.</p><p>Investing in shares is one of the most powerful ways to build wealth and create a source of passive income.</p><p>It was nearly 20 years ago when I made my first investment, purchasing shares in the initial public offering of <strong>Suntec REIT</strong> (SGX: T82U).</p><p>Looking back over my two decades of investing, I’ve learned a lot – and I want to share four key lessons that I wish I had known when I first started.</p><p>These insights could have made a big difference when I was just beginning, and I hope they’ll guide you as you work to grow your money for retirement.</p><h2 class=\"wp-block-heading\" id=\"h-volatility-is-part-and-parcel-of-investing\"><strong>Volatility is part and parcel of investing</strong></h2><p>If you think stocks will rise smoothly based on business results, you will be in for a surprise.</p><p>Volatility, defined as sharp, unpredictable swings in stock prices, is a natural part of the market.</p><p>Events such as business news, corporate announcements, and earnings reports can move stock prices, but there’s often no clear reason for a stock to jump or drop on any given day.</p><p>Take <strong>OCBC Ltd</strong> (SGX: O39), Singapore’s second-largest bank, for example.</p><p>Back in January 2019, OCBC shares were priced at S$11.38. By the time the pandemic hit a year later, they had fallen more than 30% to S$7.81. Yet, just five years later, those same shares have more than doubled to S$17.09.</p><p>For new investors, this kind of volatility can be unsettling as they watch their hard-earned money rise and fall from one year to the next.</p><p>But instead of fearing it, try to view volatility as an opportunity.</p><p>Investor sentiment often drives short-term price swings, but when you focus on the company behind the stock, you’ll realise that volatility can be a chance to buy quality businesses at a discount when others are selling in fear.</p><p>Strong companies with solid fundamentals occasionally experience price drops for no real reason, and this creates an opportunity for you to buy in at a lower price.</p><p>Once you accept that volatility is part of the investing landscape, you can use it to your advantage instead of being intimidated by it.</p><h2 class=\"wp-block-heading\" id=\"h-learn-through-theory-but-hone-with-practice\"><strong>Learn through theory but hone with practice</strong></h2><p>When I first started investing, I was a voracious reader. I kicked things off with basic investment books like Peter Lynch’s “One Up on Wall Street”.</p><p>As I progressed, I dove into value investing with books like “The Intelligent Investor” by Benjamin Graham and “The Warren Buffett Way” by Robert Hagstrom.</p><p>Reading is a great way to get familiar with the ins and outs of investing and build your foundation.</p><p>As I devoured book after book, I began to feel pretty confident in my knowledge.</p><p>At least, that was until I branched out and started buying stocks beyond Suntec REIT.</p><p>Looking back, I realise my overconfidence got the better of me. </p><p>All the reading did not fully prepare me for the emotions that come with actual investing.</p><p>Despite having absorbed a lot of knowledge from those books, I still made mistakes buying  the wrong stocks.</p><p>What I quickly learned was that the books hadn’t equipped me with the emotional resilience needed for investing, nor had they taught me how to dive into the kind of detailed research required for making smarter decisions.</p><p>It’s like reading a book about riding a bicycle, but never actually getting on one.</p><p>So, here’s my advice: start by reading to build your investment knowledge, but complement that with hands-on experience by investing real money.</p><p>This approach allows you to sharpen your real-world skills, manage your emotions, and apply what you’ve learned to analyse actual companies.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>It’s a powerful combination that will help you grow and improve as an investor over time.</p><h2 class=\"wp-block-heading\" id=\"h-don-t-beat-yourself-up-over-mistakes\"><strong>Don’t beat yourself up over mistakes</strong></h2><p>I’ve always had a bit of a perfectionist streak, and I really don’t like making mistakes.</p><p>When I first started investing, I quickly realised I was making all sorts of errors.</p><p>These missteps left me feeling defeated and close to giving up on investing altogether.</p><p>Back then, no one told me that mistakes are actually a normal part of the investment process – and that it’s important not to beat yourself up over them.</p><p>In fact, making mistakes early on, when your capital is still small, is a good thing. It means the financial damage is minimal.</p><p>As your portfolio grows, though, mistakes can become more costly.</p><p>That’s why it’s crucial to learn from them.</p><p>One useful tip is to keep a journal of your mistakes. It’ll help you remember those tough lessons and prevent you from making the same errors again.</p><p>Even better, try to learn from others’ mistakes. Talking to more experienced investors can give you valuable insights and help you avoid pitfalls along the way.</p><h2 class=\"wp-block-heading\" id=\"h-give-yourself-time-to-learn-and-grow\"><strong>Give yourself time to learn and grow</strong></h2><p>Patience is one of the most important traits beginner investors should develop.</p><p>When I was just starting out, I was eager to absorb as much as I could in the shortest time possible, hoping that would lead to quick rewards.</p><p>Looking back, I realise I should have taken a more measured approach – focusing on truly learning instead of rushing to gather information.</p><p>It’s important not to rush the process of getting rich. Instead, take your time to understand the stocks you invest in and how they fit into your strategy.</p><p>Investing is a journey of continuous learning, where you gradually build the skills needed to navigate the stock market with confidence.</p><p>These skills are crucial, especially when you face challenging macroeconomic conditions or when unexpected events affect the companies in your portfolio.</p><p>There’s no shame in taking your time to build wealth – just look at Warren Buffett, one of the world’s most successful investors. His slow and steady approach is a big part of his success.</p><p>As you gain experience, you’ll develop a “circle of competence” – an area where your knowledge is strongest.</p><p>For example, an engineer might have a better understanding of engineering stocks, while someone in the pharmaceutical field will likely have a deeper insight into the medical industry.</p><p>Over time, you can expand that circle by learning about new companies, sectors, and market trends.</p><p>This will not only make you a more well-rounded investor but also help you diversify your portfolio and spot new opportunities.</p><h2 class=\"wp-block-heading\" id=\"h-get-smart-an-interesting-and-rewarding-journey\"><strong>Get Smart: An interesting and rewarding journey</strong></h2><p>Starting out in investing can feel intimidating, but the great news is that you’ve already taken the most important step by getting started.</p><p>Now, all that’s left is to stay focused, keep learning, and sharpen your skills along the way.</p><p>If you stick with it, I promise you’ll be handsomely rewarded for your efforts.</p><p>When headlines feel chaotic, you need ‘Get Smart’, our weekly newsletter. Each issue helps you focus on what matters, explaining stocks and strategies in plain language, and pointing you toward dividend-payers that can hold steady when the world doesn’t. <a href=\"https://thesmartinvestor.com.sg/get-smart/\">Sign up now for free </a>and get ready for our next issue in your inbox. </p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang owns shares of Suntec REIT.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/02/16-300x200.png",
            "link": "https://thesmartinvestor.com.sg/4-investment-truths-that-beginner-investors-should-know-about-2/",
            "pub_date": "2025-06-16 11:32:13",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top 5 Singapore Blue-Chip Stocks for Steady Dividends in 2025",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>It can be tough to find reliable businesses to invest in when macroeconomic conditions deteriorate.</p><p>The situation is made worse by <a href=\"https://thesmartinvestor.com.sg/trumps-global-tariff-shock-what-should-singapore-investors-do-now/\">Trump’s raft of tariffs,</a> which have wreaked havoc on supply chains and stock markets.</p><p>Through it all, <a href=\"https://thesmartinvestor.com.sg/a-guide-on-investing-in-blue-chip-companies/\">blue-chip stocks</a> provide a safe harbour as they are large businesses that can withstand different economic cycles.</p><p>To top it off, these stocks also dish out a <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividend</a> that provides you with a steady stream of passive income.</p><p>Here are five blue-chip stocks that should give out steady dividends this year.</p><h2 class=\"wp-block-heading\" id=\"h-venture-corporation-sgx-v03\"><strong>Venture Corporation (SGX: V03)</strong></h2><p>Venture Corporation is a provider of technology products, services, and solutions to customers in various technology domains such as healthcare, luxury lifestyle, and measurement instrumentation.</p><p>The group reported a downbeat set of earnings for 2024 as the semiconductor sector remained in the doldrums.</p><p>Revenue fell by nearly 10% year on year to S$2.7 billion while net profit tumbled 9.3% year on year to S$245 million.</p><p>Despite the lower profit, Venture maintained its annual dividend of S$0.75 per share for 2024.</p><p>Venture released a similarly downbeat business update for the first quarter of 2025 (1Q 2025).</p><p>Revenue fell by 7.5% year on year while earnings per share declined by 6.8% year on year.</p><p>However, the group is well-positioned to offer competitive solutions for its customers, which should help to improve its revenue outlook.</p><p>Management also sees opportunities to expand its market share in at least three or four of the group’s technology domains.</p><h2 class=\"wp-block-heading\" id=\"h-mapletree-industrial-trust-sgx-me8u\"><strong>Mapletree Industrial Trust (SGX: ME8U)</strong></h2><p>Mapletree Industrial Trust, or MIT, is an industrial REIT with a portfolio of 141 properties across six property segments.</p><p>As of 31 March 2025, MIT’s total assets under management (AUM) stood at S$9.1 billion.</p><p>The REIT reported a resilient set of earnings for the fourth quarter of fiscal 2025 (4Q FY2025) ending 31 March 2025.</p><p>Although gross revenue and net property income (NPI) fell slightly year on year, the REIT’s distribution per unit (DPU) stayed constant at S$0.0336.</p><p>For fiscal 2025 (FY2025), MIT’s gross revenue and NPI inched up 2.1% and 2%, respectively, to S$711.8 million and S$531.5 million.</p><p>DPU for FY2025 improved by 1% year on year to S$0.1357.</p><p>The REIT saw its average borrowing cost dip from 3.1% to 3% over the past three months, with the gearing ratio coming in at 40.1%.</p><p>The portfolio maintained a high portfolio occupancy rate of 91.6%, and the Singapore properties enjoyed a positive rental reversion of 8.1% for renewal leases.</p><h2 class=\"wp-block-heading\" id=\"h-capitaland-integrated-commercial-trust-sgx-c38u\"><strong>CapitaLand Integrated Commercial Trust (SGX: C38U)</strong></h2><p>CapitaLand Integrated Commercial Trust, or CICT, owns a portfolio of 26 retail and commercial properties located in Singapore (21), Germany (2), and Australia (3).</p><p>The portfolio’s AUM stood at S$26 billion as of 31 December 2024.</p><p>Like MIT, CICT also reported a resilient performance.</p><p>For 2024, gross revenue edged up 1.7% year on year to S$1.59 billion while NPI increased by 3.4% year on year to S$1.15 billion.</p><p>DPU was 1.2% higher at S$0.1088 for 2024.</p><p>For 1Q 2025, revenue and NPI were lower year on year because of the absence of contributions from 21 Collyer Quay, which was divested.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>On a like-for-like basis, revenue and NPI would have increased by 1.1% and 1.4%, respectively.</p><p>Investors can rest assured that CICT also came with a strong set of operational statistics for 1Q 2025.</p><p>Portfolio occupancy was high at 96.4% while its retail and office divisions enjoyed positive rental reversions of 10.4% and 5.4%, respectively.</p><p>Footfall at its retail malls was also healthy.</p><p>1Q 2025 shopper traffic climbed 23% year on year while tenant sales improved by 17.5% year on year.</p><h2 class=\"wp-block-heading\" id=\"h-singapore-exchange-sgx-s68\"><strong>Singapore Exchange (SGX: S68)</strong></h2><p>Singapore Exchange, or SGX, enjoys a natural monopoly as Singapore’s sole stock exchange operator.</p><p>For the first half of fiscal 2025 (1H FY2025) ending 31 December 2024, SGX reported that net revenue jumped 15.6% year on year to S$646.4 million.</p><p>Net profit excluding one-off items shot up 27.3% year on year to S$320.1 million.</p><p>The bourse operator declared and paid a quarterly dividend of S$0.09, up from S$0.085 in the previous year.</p><p>Management intends to widen SGX’s product suite to broaden investors’ options and also expand regional access to Singapore equities by onboarding more overseas brokers.</p><p>SGX is optimistic about achieving its revenue growth target of between 6% to 8% per annum in the medium term.</p><p>Dividend per share is also targeted to grow at mid-single-digit per year in line with the growth in revenue and net profit.</p><h2 class=\"wp-block-heading\" id=\"h-singapore-technologies-engineering-sgx-s63\"><strong>Singapore Technologies Engineering (SGX: S63)</strong></h2><p>Singapore Technologies Engineering, or STE, is a technology and engineering group that serves customers in the aerospace, smart city, and defence sectors.</p><p>Like SGX, STE has also been steadily growing its net profit.</p><p>2024 saw the engineering giant report an 11.6% year-on-year revenue increase to S$11.3 billion.</p><p>Operating profit jumped 17.7% year on year to S$1.1 billion while net profit came in nearly 20% higher at S$702.3 million compared with 2023.</p><p>STE raised its total dividend for 2024 to S$0.17, one cent above the prior year’s S$0.16.</p><p>During this year’s <a href=\"https://thesmartinvestor.com.sg/st-engineerings-investor-day-2025-5-things-investors-need-to-know/\">Investor Day</a>, management committed to increasing the annual dividend to S$0.18 for 2025.</p><p>From 2026, the group will pay around one-third of the year-on-year increase in net profit as incremental dividends.</p><p>For 1Q 2025, STE reported an encouraging business update with total revenue rising 8% year on year to S$2.9 billion.</p><p>All three of the group’s divisions posted year-on-year revenue growth.</p><p>Around S$4.4 billion of contracts were snagged during the quarter, taking STE’s order book to S$29.8 billion as of 31 March 2025.</p><p>This new 10-minute read could change how you invest this year. Inside: </p><p>5 SG dividend-paying blue chips that have quietly powered through past downturns, and could reward you handsomely in the next.</p><p><a href=\"https://thesmartinvestor.com.sg/5-singapore-dividend-paying-blue-chips-that-can-weather-uncertainty-special-free-report-art/\">Grab the free report now</a>. It might be the most profitable thing you read today.</p><p><em>Disclosure: Royston Yang owns shares of Mapletree Industrial Trust and Singapore Exchange.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2024/08/Venture-Corporation-300x200.png",
            "link": "https://thesmartinvestor.com.sg/top-5-singapore-blue-chip-stocks-for-steady-dividends-in-2025/",
            "pub_date": "2025-06-16 07:31:53",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smart Reads of the Week: Singapore Dividend Boosts, Future Blue-Chips, and Tesla Insights",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>This week, we spotlight Singapore’s dividend leaders — from blue-chip stocks raising their payouts to lesser-known names that have outperformed DBS over the past decade. We also look ahead with five “future blue chips” that are already rewarding investors with dividends for 2025.</p><p>Over in the US, Tesla is making waves again. We break down what’s happening with the electric vehicle giant and whether long-term investors should be concerned. Meanwhile, we feature three resilient Singapore REITs for income-focused portfolios and several high-yield stocks reporting profit growth.</p><p>Finally, we round things off with four compelling US growth stocks for long-term appreciation and five Singapore stocks breaking through their 52-week highs — and whether they still offer upside.</p><p>Here are this week’s top articles:</p><p><a href=\"https://thesmartinvestor.com.sg/earnings-season-roundup-5-singapore-blue-chip-stocks-that-raised-their-dividends/\">5 Singapore Blue-Chip Stocks That Raised Their Dividends<br/></a>These dependable blue-chips have increased payouts this earnings season, making them attractive for income investors.</p><p><a href=\"https://thesmartinvestor.com.sg/these-5-singapore-dividend-stocks-beat-dbs-over-the-last-decade-did-you-own-them/\">These 5 Singapore Dividend Stocks Beat DBS Over the Last Decade: Did You Own Them?</a> Discover the dividend stocks that outperformed DBS in total returns over the past 10 years.</p><p><a href=\"https://thesmartinvestor.com.sg/top-5-future-blue-chip-stocks-paying-a-dividend-for-2025/\">Top 5 Future Blue-Chip Stocks Paying a Dividend for 2025<br/></a>Explore promising dividend-paying stocks poised to become tomorrow’s blue-chips.</p><p><a href=\"https://thesmartinvestor.com.sg/tesla-is-blowing-up-should-investors-worry/\">Tesla Is Blowing Up: Should Investors Worry?<br/></a>Tesla is back in the headlines — we break down what the latest news means for investors.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p><a href=\"https://thesmartinvestor.com.sg/looking-for-resilient-singapore-reits-these-3-could-be-perfect-for-your-portfolio/\">Looking for Resilient Singapore REITs? These 3 Could Be Perfect for Your Portfolio<br/></a>These REITs offer stable income and solid fundamentals amid market uncertainty.</p><p><a href=\"https://thesmartinvestor.com.sg/3-singapore-stocks-reporting-higher-profits-and-dividend-yields-exceeding-5-8/\">3 Singapore Stocks Reporting Higher Profits and Dividend Yields Exceeding 5.8%<br/></a>Strong earnings and generous yields make these stocks stand out for income-focused investors.</p><p><a href=\"https://thesmartinvestor.com.sg/4-us-growth-stocks-to-own-for-long-term-capital-appreciation/\">4 US Growth Stocks to Own for Long-Term Capital Appreciation<br/></a>These US companies offer growth potential for patient investors looking beyond the local market.</p><p><a href=\"https://thesmartinvestor.com.sg/5-singapore-stocks-at-52-week-highs-sell-hold-or-buy-more/\">5 Singapore Stocks at 52-Week Highs: Sell, Hold, or Buy More?<br/></a>Stocks hitting new highs — is now the time to add more or take profits?</p><p>How a simple 5-minute newsletter can shield your portfolio: When markets get noisy, Smart Reads helps you stay clear-headed with a calm, curated update like the week’s top investing stories, key market shifts, and practical insights for protecting your portfolio. Sent once a week so you can focus on protecting and growing your investments without stressing over every headline. Click <a href=\"https://thesmartinvestor.com.sg/smart-reads/\">here</a> to sign up for FREE.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/05/Smart-Reads-2-300x200.png",
            "link": "https://thesmartinvestor.com.sg/smart-reads-of-the-week-singapore-dividend-boosts-future-blue-chips-and-tesla-insights/",
            "pub_date": "2025-06-15 07:31:56",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Stock Market Highlights of the Week: Jetstar Asia, Link REIT and Centurion Corporation",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>Welcome to this week’s edition of top stock market highlights.</p><h2 class=\"wp-block-heading\" id=\"h-jetstar-asia\"><strong>Jetstar Asia</strong></h2><p>In a surprise shake-up of the budget airline industry, Singapore-based low-cost airline Jetstar Asia announced that it will cease operations on 31 July.</p><p>This closure is part of a “strategic restructure” by its parent company, <strong>Qantas</strong> (ASX: QAN).</p><p>More than 500 employees will lose their jobs because of this closure, but Jetstar Asia will provide support, which includes retrenchment benefits and employment opportunities either within the Qantas group or elsewhere.</p><p>The low-cost carrier will continue to operate flights in the next seven weeks out of Singapore while slowly scaling down its operations till 31 July.</p><p>The closure was blamed on escalating supplier costs, airport fees, and aviation charges.</p><p>The airline also cited growing capacity and intense competition in the region as factors that influenced its decision.</p><p>Jetstar Asia was expected to post a loss of A$35 million before interest and taxes are factored in for this financial year (ending 30 June 2025).</p><p>Records from the Accounting and Corporate Regulatory Authority (ACRA) show that the airline has been bleeding for several years.</p><p>Of the four fiscal years stretching from 30 June 2021 to 30 June 2024, the airline was profitable for just one fiscal year, turning in a profit of S$12.5 million in 2023.</p><p>With costs expected to continue increasing, the airline said that it would put pressure on its ability to offer low fares, thus forcing it to shut down.</p><p>Retrenched employees will receive a payment of four weeks per year of service, a bonus for this fiscal year, a special “thank you” payment, and other benefits.</p><p><strong>Singapore Airlines</strong> (SGX: C6L) has stepped in to explore potential employment opportunities for affected staff and is working closely with Jetstar Asia.</p><p>16 routes are affected by Jetstar Asia’s closure, but 12 of these are served by other airlines.</p><p>Changi Airport Group (CAG) will work to restore connectivity for the remaining four locations.</p><p>Ground handler <strong>SATS Ltd</strong> (SGX: S58) is also working with Jetstar Asia to ensure a smooth and orderly transition.</p><h2 class=\"wp-block-heading\" id=\"h-link-reit-hkse-0823\"><strong>Link REIT (HKSE: 0823)</strong></h2><p>Link REIT is looking at listing a <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-an-introduction-to-reits-part-1/\">REIT</a> in Singapore that includes properties from outside of China and Hong Kong.</p><p>Early discussions are being held with advisers on the potential initial public offer (IPO), but the company has not decided to proceed.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>This IPO news is coming at a time when Link REIT is looking to diversify its operations away from property management.</p><p>If the IPO goes ahead, it will be good news for the Singapore market as it struggles to reverse a trend of delistings.</p><p>Since the beginning of 2024, just five companies have gone public on the <strong>Singapore Exchange</strong> (SGX: S68), or SGX.</p><h2 class=\"wp-block-heading\" id=\"h-centurion-corporation-sgx-ou8\"><strong>Centurion Corporation (SGX: OU8)</strong></h2><p>Another company is also considering a REIT listing on the Singapore bourse.</p><p>Centurion Corporation has followed up on its January 2025 announcement that it was exploring the establishment of a REIT by submitting a listing application to the SGX and the Monetary Authority of Singapore (MAS).</p><p>The application is currently under review.</p><p>As a recap, Centurion announced in January that it was aiming to list a REIT seeded with its worker and student accommodation assets.</p><p>The REIT will be sponsored by Centurion, and the company will be working with <strong>DBS Group</strong> (SGX: D05) and UBS to explore a proposed listing.</p><p>The listing will be subject to market conditions, commercial negotiations, and approvals being obtained from both SGX and MAS before it can proceed.</p><p>The last time Centurion attempted to list its properties via a REIT was a decade ago in 2015.</p><p>Back then, the listing plan was postponed after consultations with SGX.</p><p>The exchange commented that listing a REIT would constitute a “chain listing” if the assets and operations of the applicant are substantially the same as the parent company.</p><p>As of 31 March 2025, Centurion owns and manages a portfolio of 37 accommodation assets totalling 69,929 beds.</p><p>As of this writing, shares of Centurion are up 59% year-to-date and have touched an all-time high of S$1.56.</p><p>When the market is unpredictable, where can you park your money with confidence? Our latest FREE report reveals 5 Singapore dividend-payers built to withstand global storms. <a href=\"https://thesmartinvestor.com.sg/5-singapore-dividend-paying-blue-chips-that-can-weather-uncertainty-special-free-report-art/\">Get it now</a> and see what’s still worth holding.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang owns shares of DBS Group and Singapore Exchange.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/06/Top-Stock-Highlights-of-the-Week-1-300x200.png",
            "link": "https://thesmartinvestor.com.sg/top-stock-market-highlights-of-the-week-jetstar-asia-link-reit-and-centurion-corporation/",
            "pub_date": "2025-06-14 07:31:53",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Get Smart: This Weekly Exercise Will Unlock Your Portfolio’s Full Potential",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>I enjoy taking a nice, long bicycle ride every now and then.</p><p>If you are like me, you would stick with using the same old tried-and-tested paths along the park connection network (PCN).</p><p>The same goes for investing.</p><p>You may be comfortable investing in the stocks that you are familiar with.</p><p>Yet, there is a downside to this approach. </p><p>In the process, you may suffer from tunnel vision – being overly focused on what’s in front of you without exploring the wider world of stocks.</p><h2 class=\"wp-block-heading\" id=\"h-widening-your-circle-of-competence\"><strong>Widening your circle of competence</strong></h2><p>Don’t get me wrong.</p><p>It’s perfectly normal to feel comfortable investing in what you are good at.</p><p>This knowledge is also known as your “circle of competence”, and even Warren Buffett advises us to stay within this circle and not stray too far from it.</p><p>But here’s the thing.</p><p>If you get too comfortable investing in just a small group of stocks, you may be limiting your choices as an investor.</p><p>There could be better investment choices out there that you can tap into to increase your returns or dividend flow.</p><p>The key is to slowly expand your circle of competence by reading widely and learning about other industries and companies.</p><p>By doing so, you start to gain a better appreciation of the myriad of choices out there.</p><p>With the ease of investing in global stocks, there’s no reason to restrict yourself to a specific stock exchange or country.</p><h2 class=\"wp-block-heading\" id=\"h-setting-up-guardrails\"><strong>Setting up guardrails</strong></h2><p>As a cyclist, I love exploring new areas beyond the familiar.</p><p>But while new places are exciting, it’s important to set up guardrails to prevent yourself from straying off the PCN and onto the busy roads.</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>The heavy traffic in Singapore is dangerous for cyclists, and one wrong move could get me injured or even killed.</p><p>You should do this for investing, too.</p><p>Learn what you can within your capacity for understanding, but stay away from complex investments or risky stocks that could harm your wealth.</p><p>By setting up guardrails on what you should analyse and invest in, you can gain more knowledge while ensuring that you invest safely and according to your goals and objectives.</p><h2 class=\"wp-block-heading\" id=\"h-get-smart-expanding-your-investment-options\"><strong>Get Smart: Expanding your investment options</strong></h2><p>I make it a point to learn more about a new company every week.</p><p>Even if it is just a cursory glance at its earnings and management commentary, it can give me a sense of what the business is like and how it is doing.</p><p>Through this process, I’ve discovered interesting smaller Singapore companies such as <strong>Riverstone Holdings</strong> (SGX: AP4), <strong>Centurion Corporation</strong> (SGX: OU8), and <strong>CSE Global</strong> (SGX: 544).</p><p>Over in the US, I have also looked deeper into companies such as <strong>Airbnb</strong> (NASDAQ: ABNB), <strong>Lyft</strong> (NASDAQ: LYFT), and <strong>Spotify</strong> (NYSE: SPOT).</p><p>Discovering these companies may not always mean that I will add them to my portfolio.</p><p>But doing so provides me with an appreciation of the different types of businesses out there and helps to expand my investment options.</p><p>You can select companies that you are keen to know more about and apply the same process.</p><p>As you learn more about other businesses, you can compile a buy watchlist of stocks that serves as your “reserve list”.</p><p>Over time, by expanding your knowledge and widening your circle of competence, you can achieve better results for your investment portfolio.</p><p>If you’re looking for the best value buys in the stock market, read Get Smart. It will help you spot opportunities most investors overlook. Each issue gives you the context you need to recognise bargains and act confidently. <a href=\"https://thesmartinvestor.com.sg/get-smart/\">Join for free</a> and enjoy the advantage of deep investing insight delivered straight to your inbox every week.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p><em>Disclosure: Royston Yang does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2023/09/Singapore-MBS-Flyer-300x200.png",
            "link": "https://thesmartinvestor.com.sg/get-smart-this-weekly-exercise-will-unlock-your-portfolios-full-potential/",
            "pub_date": "2025-06-13 17:32:09",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Discipline of Investing in Small Caps",
            "description": "<div class=\"mailmunch-forms-before-post\" style=\"display: none !important;\"></div><p>There could come a time in our investment journey when we may think we need something a bit more exciting than just a bunch of <a href=\"https://thesmartinvestor.com.sg/a-guide-on-investing-in-blue-chip-companies/\">blue-chip shares</a>. I am at that stage.</p><p>Don’t get me wrong. There is absolutely nothing wrong with large-cap stocks. They have an important role to play in any portfolio.</p><p>With a judicious selection of large caps, we can even leave them to do what they need to do over the long term. One of the worst things that we can ever do is to tinker with them too much. But continually reinvesting any <a href=\"https://thesmartinvestor.com.sg/a-smart-guide-to-investing-dividend-investing/\">dividends</a> that we receive is a must. It is the cornerstone of compounding.</p><p>The beauty of large-cap stocks is that they should just plod along and grow at a sedate pace. Large companies are generally perceived to be less risky. They don’t normally do anything too outrageous. At least we hope they don’t. Additionally, their sheer size can confer some level of stability to a portfolio.</p><h2 class=\"wp-block-heading\" id=\"h-the-problem-with-predictability\"><strong>The problem with predictability</strong></h2><p>That doesn’t mean that things can’t ever go wrong. Some blue chips have managed to badly disappointed investors. But it is a rarity. Generally, blue chips have more reliable revenue streams. They might also have a broader customer base, which can help to make their performance more predictable.</p><p>The downside, however, is that their predictability can lead to pricier valuations. The price to earnings ratio, which is the price that we pay for every dollar of earnings, can be quite high. That is because investors are more inclined to pay a premium for reliability.</p><p>After all, when a swathe of analysts covers blue chip stocks, there are very few places for large caps to hide. Analysts’ forecasts might only differ by a few cents in either direction in terms of revenue, profit and dividends. So, it is not surprising that bargains are few and far between among the blue chips.</p><p>Small caps are a totally different story, though. They are less well covered by analysts, which means that it may be easier for us to find undervalued stocks. But it does mean a bit more legwork for the intrepid investor.</p><h2 class=\"wp-block-heading\" id=\"h-clean-and-simple\"><strong>Clean and simple</strong></h2><p>On the plus side are cleaner accounts. Smaller companies tend to have simple business models that have not been complicated by frequent acquisitions and disposals. Their accounts are not only easier to understand but they also make forecasting more straightforward, if we are prepared to do the homework.</p><p>There is something else about small caps. Since their operations tend to be more local and limited in scope, it means that they could, if they want to, have more room to expand. It can be difficult for a large cap to double its revenue. But a small cap could if it wanted to.</p><p>Interestingly, though, small caps prefer to stick to their chosen niche markets. These markets are probably too small for large companies to bother with. However, to be a successful niche player, the target market should still be of sufficient size to be profitable. It should also have growth potential and preferably lots of repeat purchases.</p><p>Investment guru Peter Lynch once said: “If you stay half-alert, you can pick the spectacular performers right from your place of business or out of the neighbourhood shopping mall, and long before Wall Street discovers them.”</p><div class=\"mailmunch-forms-in-post-middle\" style=\"display: none !important;\"></div><p>Consequently, if we are interested in small caps we should keep our eyes peeled. We should keep our minds open for interesting brands. In the main, we tend to associate big brands with big companies. But that could be a mistake.</p><h2 class=\"wp-block-heading\" id=\"h-small-companies-with-big-brands\"><strong>Small companies with big brands</strong></h2><p>It is natural to assume that bigger outfits will have mega bucks to spend on advertising. But it might surprise us to find that small companies can have big brands, too. It might have been true in the past that companies had to spend big to keep their products in the forefront of consumers’ minds. But not any more – social media, influencers, and viral marketing have changed the advertising landscape, appreciably.</p><p>To invest successfully in small caps, it is important to stick to tried and tested rules. Just because we are dealing with small caps doesn’t mean that we should abandon our principles. If anything, we should be doing more.</p><p>We should be looking for companies with a good track record of growing revenues and profit. Those businesses should have little or no debt. They should be able to generate lots of free cash flow. They should also demonstrate a long history of paying dividends.</p><p>But that’s not all. Shares of small caps can be volatile because liquidity in their shares could be low. Consequently, we need to build a carefully curated portfolio that could help reduce the swings in share prices. Banking on just one or two small caps is akin to jumping on a pogo stick.</p><p>The portfolio should be designed to generate as much regular cash flow as possible. That should allow us to turn volatile share prices into a boon rather than a bane. I can’t wait to get started.</p><p>Many investors think DeepSeek lowering AI costs means less revenue for tech companies. But that’s not the full story, and believing it could cost you. In our latest free report, we unpack a surprising insight from a top tech CEO who explains why lower AI costs may actually drive <em>more</em> tech spending, not less — and he’s got the numbers to prove it. If you’ve misunderstood this trend, you could miss out on some of the biggest investment opportunities. <a href=\"https://thesmartinvestor.com.sg/how-genai-is-reshaping-the-stock-market-art/\">Click here now</a> to access “How GenAI is Reshaping the Stock Market” today to get the full breakdown.</p><p>Follow us on <a href=\"https://www.facebook.com/thesmartinvestorsg/\">Facebook</a>, <a href=\"https://www.instagram.com/thesmartinvestorsg/\">Instagram</a> and <a href=\"https://t.me/thesmartinvestorsg\">Telegram</a> for the latest investing news and analyses!</p><p>An earlier version of this article appeared in The Business Times.</p><p><em>Disclosure: David Kuo does not own shares in any of the companies mentioned.</em></p><div class=\"mailmunch-forms-after-post\" style=\"display: none !important;\"></div>",
            "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2025/02/20-300x200.png",
            "link": "https://thesmartinvestor.com.sg/the-discipline-of-investing-in-small-caps/",
            "pub_date": "2025-06-13 11:32:09",
            "source": "thesmartinvestor",
            "kind": 1,
            "language": "en"
        }
    ]
}