{
    "data": [
        {
            "id": "4779561",
            "title": "Medicure Inc. (MCUJF) Q4 2024 Earnings Call Transcript",
            "type": "transcript",
            "description": "<p>Medicure Inc. (<a href=\"https://seekingalpha.com/symbol/MCUJF#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link\" title=\"Medicure Inc.\">OTCPK:MCUJF</a>) Q4 2024 Earnings Call April 29, 2025 8:30 AM ET</p> <p><strong>Company Participants</strong></p> <p>Albert Friesen - Chief Executive Officer<br/> Neil Owens - President and Chief Operating Officer<br/> Haaris Uddin - Chief Financial Officer</p> <p><strong>Operator</strong></p> <p>Welcome to Medicure’s Earnings Conference Call for the Quarter and Year ended December 31, 2024. My name is Holly and I will be your operator for today’s call. [Operator instructions]</p> <p>Before we proceed, I would like to remind everyone that this presentation contains forward-looking statements relating to future results, events and expectations, which are made pursuant to the Safe Harbor provisions of the U.S. Securities Litigation Reform Act of 1995. Forward-looking statements involve known and unknown risks and uncertainties, which could cause the company’s actual results to differ materially from those in the forward-looking statements. Such risks and uncertainties include, among others, those described in the company’s most recent annual information form and Form 20-F. Later, we will conduct a question and answer session. Please note that this conference call is being recorded, and today’s date is April 29, 2025.</p> <p>I would now like to turn the conference call over to Dr. Albert Friesen, Chief Executive Officer of Medicure Inc. Please go ahead, Dr. Friesen.</p> <p><strong>Albert Friesen</strong></p> <p>Thank you, Holly, and good morning to all on the call. We appreciate your interest and participation in today’s call. Joining me today in the 2024 financial statements is Dr. Neil Owens, President and Chief Operating Officer; and Haaris Uddin, Medicure’s Chief Financial Officer.</p> <p>The net revenue for 2024 was $21.9 million, a slight increase from the previous year, which was $21.7 million. The company recorded a net loss for 2024 of approximately $1 million or $0.10 per share compared to a net loss of $922,000 or $0.09 per share last year. The net loss is due in large part due to non-cash expenses, including $2.3 million of amortization<span class=\"paywall-full-content\"> of the company’s assets and $196,000 of share-based compensation expense on stock options granted to employees and directors during the prior year.</span></p> <p class=\"paywall-full-content\">There was a bit of a decrease in the AGGRASTAT revenue and increase in professional fees as well. There was higher revenue from sales of ZYPITAMAG through Marley Drug and including current year’s expenses was R&amp;D of $3.1 million largely for the MC-1 PNPO clinical trial. We have added a fifth focus the past year, that being the development of a novel drug related to MC-1 with significant market potential. So a reminder that the 5 business focuses for Medicure are holding sales and profits from AGGRASTAT, growing ZYPITAMAG revenue and profit, growing the Marley Drug online pharmacy business, the development of MC-1 for PNPO deficiency and the new chemical entity related to Medicure’s historic drug development with very large market potential.</p> <p class=\"paywall-full-content\">I’d now like to turn the call over to our CFO, Haaris Uddin, to review and provide some color on the 2024 financial statements.</p> <p class=\"paywall-full-content\"><strong>Haaris Uddin</strong></p> <p class=\"paywall-full-content\">Thank you, Dr. Friesen. A couple of quick items to note before I start. All dollar figures are in Canadian dollars, unless otherwise noted by each presenter. And as a reminder, you can obtain a copy of our complete set of our financial statements for the year ended December 31, 2024, on the Investors page of our website. Alternatively, a copy of all financial statements and management discussion and analysis can be obtained from sedarplus.ba. I will now provide some key highlights of our financial performance for the year ended December 31, 2024. Total revenue for the year ended December 31, 2024, was $21.9 million compared to $21.7 million for the year ended December 31, 2023. Net revenues earned from AGGRASTAT during the current year totaled $8.1 million, a decrease from the prior year, where net revenue from AGGRASTAT was $9.7 million.</p> <p class=\"paywall-full-content\">The decrease in AGGRASTAT revenue during the current year is a result of pricing pressures from increased competition stemming from the launch of generics, tirofiban hydrochloride. Net revenues earned from ZYPITAMAG through the traditional insurance channel during the current year totaled $3 million, which is an increase from the $2.4 million of net revenue earned during the prior year. The increase in ZYPITAMAG sales through the traditional insurance channel can be attributed to greater utilization of the products through insurance formularies, specifically Medicare Part D. This increase is offset by increased wholesaler fees in addition to higher coverage gap payments to pharmacy benefit managers. For Marley Drug, net revenue during the current year totaled $10.8 million, an increase from the prior year, where net revenue totaled $9.6 million.</p> <p class=\"paywall-full-content\">The pharmacy business has undergone a change in its product mix since the prior year, resulting in the increase in revenue during the current year, and the pharmacy continues to focus on fulfillment partnerships, its e-commerce platform and increased sales of ZYPITAMAG. Offsetting the increase in revenue is a decline in reimbursements from pharmacy benefit managers, which only impact insured prescription revenue. AGGRASTAT cost of goods sold for the year ended December 31, 2024, totaled $2.5 million, a decrease from the prior year, where cost of goods sold totaled $3 million. The decrease in cost of goods sold is the result of a decrease in volume of AGGRASTAT sold, which is consistent with the lower revenue recorded in the current year.</p> <p class=\"paywall-full-content\">ZYPITAMAG cost of goods sold for the current year totaled $1.4 million, an increase from the prior year, where cost of goods sold for ZYPITAMAG totaled $974,000. Included within the cost of goods sold for ZYPITAMAG in the current year is $759,000 relating to products sold to customers and $620,000 from amortization of the ZYPITAMAG intangible assets. The increase in cost of goods sold noted during the current year is due to a higher volume of products sold during 2024 in addition to a recovery, which was recorded in the prior year of $281,000 relating to ZYPITAMAG royalties. Marley Drug cost of goods sold totaled $4.9 million during the year ended December 31, 2024, an increase from the prior year where cost of goods sold totaled $3.7 million.</p> <p class=\"paywall-full-content\">The increase in cost of goods sold is a result of a higher volume and the nature of products sold through both the mail order and e-commerce platform during the current year. Selling expenses totaled $8 million for the year ended December 31, 2024, a decrease from the prior year, where selling expenses were $8.3 million. The decrease in selling expenses during the current year is a result of management’s efforts in optimizing its sales and marketing expenses. This included a reorganization of the company’s sales team in addition to focusing our marketing channels, which provided the greatest return on investment. General and administrative expenses totaled $4.8 million for the current year, in comparison to $4.1 million during the prior year.</p> <p class=\"paywall-full-content\">The increase in general and administrative expenses in the current year is a result of higher professional fees, primarily related to legal fees, offset by lower share-based compensation expense on previously granted stock options to key employees and directors of the company. Research and development expenses for the current year totaled $3.1 million compared to $2.4 million during the prior year. The increase during the current year is primarily due to the timing of research and development expenditures relating to each development project the company is currently undertaking, which in the current year primarily related to the development of MC-1. Other income during the current year totaled $1.9 million. The other income recorded during the current year was a result of a legal settlement between the company and its contract development and manufacturing organization.</p> <p class=\"paywall-full-content\">The company received a settlement payout in the fourth quarter of 2024. During the prior year ended December 31, 2023, the company did not record any other income. The company reported finance income of $165,000 during the current year in comparison to finance income of $65,000 during the prior year ended December 31, 2023. The finance income recorded during the current year consisted primarily of interest income earned on the cash held by the company, offset by bank charges and finance expenses on the company’s lease obligations. The company recorded a foreign exchange loss of $71,000 during the current year in comparison to a foreign exchange loss of $108,000 during the prior year. The change in foreign exchange relates to changes in the U.S. dollar exchange rates during the respective years, which led to an unfavorable foreign exchange loss during both the current and prior years.</p> <p class=\"paywall-full-content\">Adjusted EBITDA for the current year was negative $437,000 compared to an adjusted EBITDA of $1.9 million during the year ended December 31, 2023. The decrease in adjusted EBITDA during the current year is primarily due to higher Marley Drug cost of goods, lower AGGRASTAT revenue as well as higher research and development expenses. And this amount – these amounts are offset by a decrease in selling expenses, higher ZYPITAMAG sales through both the Marley Drug Pharmacy and traditional insurer channel. Subsequent to year-end, the company acquired 100% of the outstanding shares of Gateway Medical, an independent pharmacy located in Portland, Oregon in exchange for total consideration of $580,000.</p> <p class=\"paywall-full-content\">In addition, the company also signed an agreement with the intention of acquiring 100% membership interest of West Olympia Pharmacy, an independent pharmacy located in West Olympia, Washington for total consideration of $975,000. The transaction of West Olympia is subject to the licenses of the pharmacy transferring from the seller to the buyer prior to the transaction closing. The transaction is expected to close in the second quarter of 2025, and both pharmacies were intended to be acquired with the intention of expanding the company’s Retail Pharmacy operating segment and creating synergies with Marley Drug. As at December 31, 2024, the company had cash totaling approximately $7.2 million, an increase from the $6.4 million of cash held as of December 31, 2023. The company does not have any debt on its books.</p> <p class=\"paywall-full-content\">I want to remind you that there will be an opportunity at the end of today’s call for you to ask questions regarding the financial results of the company as a whole. And with that, I would like to turn the call over to our President and Chief Operating Officer, Dr. Neil Owens, for some additional commentary regarding our operations.</p> <p class=\"paywall-full-content\"><strong>Neil Owens</strong></p> <p class=\"paywall-full-content\">Thank you, Haaris, and good morning, everyone. I’d like to start with some updates on our ZYPITAMAG business. Sales of ZYPITAMAG sold through Marley Drug grew by 23% from $2.6 million in 2023 to $3.2 million in 2024. We continue to use a field-based sales team as well as prescriber and consumer marketing and have refined our marketing messaging to what we have found resonates best for both.</p> <p class=\"paywall-full-content\">Patients still have challenges in accessing ZYPITAMAG through their insurance coverage, which is the reason why selling ZYPITAMAG through Marley Drug is such an effective approach. Similarly, due to wholesaler and coverage gap fees, low PBM reimbursements and product returns selling through Marley Drug provides a much higher gross margin.</p> <p class=\"paywall-full-content\">We’ve also found that adherence rates for patients taking ZYPITAMAG is more than 40% higher through Marley Drug compared to other retail pharmacies because of our customer service and engagement strategies, this helps for reducing our attrition rate and increasing revenue. Net revenue through insured channels and the standard retail pharmacy model grew by 25% from $2.4 million in 2023 to $3 million in 2024 due to an increase in purchasing from wholesalers and changes in our mix of insured customers. Overall, ZYPITAMAG represents a priority for growth through efforts of our sales and marketing team.</p> <p class=\"paywall-full-content\">Further on our Marley Drug business, net revenue grew by 12.5% from $9.6 million in 2023 to $10.8 million in 2024. This is due to an increase in ZYPITAMAG sold through the pharmacy business as well as generic medication sales due to multiple marketing strategies used in 2024. Notably, the sale of Brenzavvy tablets through Marley Drug, which is an accessible alternative SGLT2 inhibitor to JARDIANCE and FARXIGA, contributed revenue of $807,000 in 2024. Another recent example is the exclusive sale of sitagliptin, which is a first generic entry for another popular diabetes medication. Medicure is working on leveraging Marley Drug’s reputation for customer service, unique branded medication solutions and national distribution to continue to drive growth. Challenges we have faced include competition and fluctuation in cost of goods, which impact our margins as well as lowering our customer acquisition costs as much as possible.</p> <p class=\"paywall-full-content\">We also plan to invest further in our e-commerce website to make it a best-in-class experience for customers. Recently, Medicure announced the acquisition of Gateway Medical Pharmacy and signing of a definitive agreement with West Olympia Pharmacy. These additional pharmacy subsidiaries immediately grow our customer and prescriber base for both ZYPITAMAG and other branded products and will be adopted under the Marley Drug brand. Additional benefits of these acquisitions include faster shipping times and redundancy, growing our brand nationally, increasing our revenue and are cash flow positive.</p> <p class=\"paywall-full-content\">In terms of our AGGRASTAT business, net revenue fell from $9.7 million in 2023 to $8.1 million in 2024 due to generic Tirofiban competition. Medicure remains the only manufacturer of the 3.75 milligram bolus format, which is typically administered before the infusion unit. We continue to provide support to our U.S. hospital accounts and plan to remain price competitive in targeted ways. Medicure’s R&amp;D focus is primarily on its Phase 3 study to seek approval of MC-1 as the first FDA-approved therapy for patients with PNPO deficiency, which is a rare pediatric disease leading to seizures and is ultimately fatal if untreated. If successful, use of Medicure’s legacy product MC-1 could lead to a priority review voucher, which can be redeemed or sold and provides significant value. The FDA granted approval to start enrollment, and so enrollment is ongoing with patients receiving treatment with MC-1.</p> <p class=\"paywall-full-content\">Medicure also recently received Fast Track designation for MC-1 for its intended indication, which will facilitate the review of Medicure’s FDA new drug application. Medicure did decide to remove the entire coding of the MC-1 tablets to speed up absorption based on the feedback from clinicians, and therefore, that batch was produced and is now being sent to the clinical sites for use. Recently, the Phase 3 study’s first patient has completed the study enrollment period and has now moved into a continuation phase post enrollment. Medicure recently announced that it has signed an asset purchase agreement for the acquisition of the patent and intellectual property related to the discovery of new chemical entities that can be developed for therapeutic use. We believe that the new chemical entities will promise to provide improvements over existing lead compounds in alignment with treatment of diseases being targeted by Medicure and could provide significant long-term value upon completion of all required preclinical and clinical studies and regulatory approval.</p> <p class=\"paywall-full-content\">Medicure has yet to announce the clinical therapeutic targets, however, has started preclinical testing and API development of the lead compound. Overall revenue in 2024 of $21.9 million was only slightly higher than 2023 of $21.7 million despite increases in ZYPITAMAG and Marley Drug revenue due to lower AGGRASTAT revenue, higher Marley Drug cost of goods, as well as higher general and administrative expenses from higher than expected legal expenses and higher research and development expenses, which were $3.1 million in 2024. We are therefore reporting a negative EBITDA of $437,000 and a net loss of $1 million for the year.</p> <p class=\"paywall-full-content\">Medicure remains debt-free. And to reiterate, the company’s short-term goals are focused on growing ZYPITAMAG, growing Marley Drug and our pharmacy business, maintaining AGGRASTAT sales and the development of new products, short-term seeking the approval of MC-1 to receive a priority review voucher and long-term, the development of our new chemical entities and intellectual property for diseases with large market potential.</p> <p class=\"paywall-full-content\">With that, I would like to turn the call back to Dr. Friesen for final comments.</p> <p class=\"paywall-full-content\"><strong>Albert Friesen</strong></p> <p class=\"paywall-full-content\">Thank you, Neil. Though overall revenue was consistent with last year, there were significant developments through the acquisition of Marley, which we think strongly complements Medicure’s business, including sales and marketing of ZYPITAMAG. The acquisition of the two pharmacies recently supports our focus on growing the business and diversifying our revenue and asset base near-term through acquisitions and long-term through R&amp;D, carefully investing to grow our future profitability. My goal and that of our Board, management and staff is to continue to build this business with a stable long-term outlook to generate value for our shareholders. And as always, I want to express my sincere appreciation to the outstanding team of employees we have been blessed with.</p> <p class=\"paywall-full-content\">Thank you, our shareholders, for your continued support and interest. Now, Holly, I will turn it back to you to lead us through the Q&amp;A.</p> <p class=\"paywall-full-content\" id=\"question-answer-session\"><strong>Question-and-Answer Session</strong></p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">[Operator Instructions] Your first question for today is from Zach Trees [ph], a Private Investor.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content\">Yes. My name is Zach. Thank you guys for the hard work you guys are doing. I just have a few brief questions. My first question is in regard to the general and administrative expenses. I saw that legal fees were the primary cause of the increase last year. Do you guys see this coming back down in 2025?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Albert Friesen</span></strong></p> <p class=\"paywall-full-content\">I don’t know, Neil, did you want to – or Haaris?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Haaris Uddin</span></strong></p> <p class=\"paywall-full-content\">Yes. What I can say is I would expect there are still few significant legal fees in 2025. We can comment further on that, but I don’t see that actually coming down too much further, unfortunately.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content\">Okay. If I may have just two other quick questions, in regard to R&amp;D, it seems that the primary expense right now is for the MC-1 development. Do you expect those expenses to continue at a similar level in 2025?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Albert Friesen</span></strong></p> <p class=\"paywall-full-content\">Yes. Go ahead.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Haaris Uddin</span></strong></p> <p class=\"paywall-full-content\">Yes, it’s a good question. I think that they should come down versus 2024. However, we have started investing in the new intellectual property. So, overall, our R&amp;D expenses will probably be similar, its right around $3 million. I think that we are forecasting. So, it should be consistent with 2024 as well.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content\">Okay. Thank you. I appreciate that. Just last question – yes, last two questions here. For the Phase 2 trials for MC-1, do you guys have any update on the timeline for that?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Haaris Uddin</span></strong></p> <p class=\"paywall-full-content\">Yes. So, I can answer that one as well. It is a 12-month study. And so we are expecting to enroll all patients this year. It’s a very small study. It’s only – we are only targeting to enroll 10 patients, but it’s an extremely rare disease. So, it takes some effort to find all of those patients. But we should expect to enroll all patients this year, and then they will be enrolled for 12 months. We have seen it – as I mentioned, we have had one patient complete in 12 months, but it’s going to be staggered as patients enroll. But then we do have a shorter review period once we have completed the study because it’s an orphan disease. So, it’s basically an accelerated review period.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content\">Okay. Thank you. I really appreciate that. And then the last question is regarding your latest acquisitions, which is exciting. I was just wondering if you guys could provide any color on the synergies that you are expecting.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Haaris Uddin</span></strong></p> <p class=\"paywall-full-content\">Yes, I can jump in on that one as well. There are many. As mentioned, gaining national brand exposure for ZYPITAMAG and the drug is challenging. And what this does is it gives us an immediate exposure to, I would say, tens of thousands of patients through both pharmacies, not only the patients, but the providers that we can market ZYPITAMAG and our other branded products to. So, basically, we can integrate them quite effectively and not only that, but we are going to see some cost savings on our cost of goods just through increased purchasing power as we add the pharmacies. But it also provides redundancy just for shipping so that because we fill all 50 states, we send medications to all the 50 states, these other pharmacies can provide faster shipping times to the West Coast, only because we are trying to be competitive with other pharmacies that offer home delivery. So, we want to be best-in-class in that sense, and this redundancy overall in terms of fulfillment.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content\">Okay. Thank you.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Albert Friesen</span></strong></p> <p class=\"paywall-full-content\">And thank you, Zach, for the questions.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content\">Yes. Thanks as well.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">[Operator Instructions] We have reached the end of the question-and-answer session. And I would now like to turn the floor back to Dr. Albert Friesen for closing remarks.</p> <p class=\"paywall-full-content\"><strong>Albert Friesen</strong></p> <p class=\"paywall-full-content\">Again, thank you for those on the call. We appreciate it, and we look forward to further updates for the next quarter. Again, thank you. Have a great day.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">Thank you, ladies and gentlemen. This concludes today’s conference. Thank you for your participation. You may now disconnect.</p>",
            "link": "https://seekingalpha.com/article/4779561-medicure-inc-mcujf-q4-2024-earnings-call-transcript",
            "pub_date": "2025-04-30 16:37:19",
            "source": "seekingalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4779562",
            "title": "Arafura Rare Earths Ltd. (ARAFF) Q3 2025 Earnings Call Transcript",
            "type": "transcript",
            "description": "<p>Arafura Rare Earths Ltd. (<a href=\"https://seekingalpha.com/symbol/ARAFF#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link\" title=\"Arafura Rare Earths Limited\">OTCPK:ARAFF</a>) Q3 2025 Earnings Conference Call April 29, 2025 8:30 PM ET</p> <p><strong>Company Participants</strong></p> <p>Darryl Cuzzubbo - MD, CEO<br/> Peter Sherrington – CFO<br/> Shaan Beccarelli - Head of Corporate Affairs &amp; Investor Relations</p> <p><strong>Conference Call Participants</strong></p> <p>Brett Smith - B&amp;L Smith Super Fund<br/> James Lowry – Unidentified Company<br/> Ronald Lomax - Unidentified Company<br/> Lee Birch - Birch Corp<br/> Bernard Ho - Unidentified Company<br/> Paul Stevens - Unidentified Company<br/> Roberto Versace - Versace Capital<br/> Steven Darrington - Unidentified Company<br/> Steven Allen - Unidentified Company<br/> Andrew Ballard - Unidentified Company<br/> Nick Stott - Unidentified Company</p> <p><strong>Operator</strong></p> <p>Thank you for standing by, and welcome to the Arafura Rare Earths Limited March 2025 Quarterly Report Investor Call. [Operator Instructions]</p> <p>I would now like to hand the conference over to Mr. Darryl Cuzzubbo, Managing Director and CEO. Please go ahead.</p> <p><strong>Darryl Cuzzubbo</strong></p> <p>Thanks, Harmony, and good morning, everyone. Thank you for making the time to join us today for our quarterly update. For those that are new to these calls, my name is Darryl Cuzzubbo, the managing director of Arafura Rare Earths. And, again, today with me is Peter Sherrington, our CFO.</p> <p>A lot has happened since our last quarterly update, both from an external market perspective and in terms of activities to secure the best possible pathway to fit that reward’s existing shareholders and opens up the best long term growth options for our company.</p> <p>Between Peter and I, we will make some comments on the external market, how we are progressing towards securing the equity ahead of FID, and the Traxys offtake agreement recently announced before opening to your questions.</p> <p>So let me start by summarizing how we see the external market. We’ve seen escalating trade tensions between the U.S. and the rest of the globe, but in particular China. On April, the U.S. imposed<span class=\"paywall-full-content\"> China specific tariffs of 36% on the imports of rare earth magnets. China subsequently announced plans to restrict exports of high-performance magnets and rare earth products on national security grounds with no specific country being targeted. This has created significant supply uncertainty for nearly 90% of the world’s high performance permanent magnets required for everything from everyday electronics to electric vehicles, wind turbines, robotics, and military equipment. We are already hearing a supply disruptions for ex China manufacturers such as Tesla, noting that their robot manufacturing is being affected.</span></p> <p class=\"paywall-full-content\">In response to this, The U.S. President signed an order directing the commerce secretary to begin a national security review, noting that the U.S. dependency on mineral imports raises the potential for risks to national security, defense readiness, price stability, and economic prosperity and resilience. Within 180 days, the commerce secretary is required to report his findings back to the president, including whether to impose further tariffs.</p> <p class=\"paywall-full-content\">It should be noted that the European Union has already stated some time ago that they will introduce trade restrictions through their Critical Raw Materials Act where no more than 65% of their needs can come from a single country.</p> <p class=\"paywall-full-content\">In conjunction with these developments, our federal government has announced plans to secure strategic reserves of critical minerals, including rare earths, which presents a potential mechanism that can be used to break China’s monopoly overpricing. It was in anticipation of circumstances like this that Arafura has held tightly to our ore-to-oxide rare earths strategy so that we can offer a meaningful alternative to China’s rare earths supply chain.</p> <p class=\"paywall-full-content\">If you look across the globe, we are uniquely positioned as a truly construction ready project that can bypass China’s supply chain. Given that we have secured the debt required, our only remaining step ahead of moving into construction is raising the required equity. I believe that our timing could not be better.</p> <p class=\"paywall-full-content\">With these developments, we should expect that there will be a bifurcation of rare earths pricing, creating the market opportunity for a seaborne based pricing system. The domestic rare earth prices in China should no longer be a functional representative price for a non-China magnet value chain.</p> <p class=\"paywall-full-content\">Importantly, Argus, a well-regarded independent forecaster, believes that a long-term incentive pricing of U.S. $163 a kilogram is necessary to create a rest of world NdPr supply chain that isn’t dependent on China.</p> <p class=\"paywall-full-content\">Now let me make a couple of comments on securing the required equity before handing over to Peter to talk through our recent Traxys offtake agreement, and then we’ll open up to questions.</p> <p class=\"paywall-full-content\">As stated previously, we have been targeting 50% to 60% of our equity to come from cornerstone investors before raising the remainder from institutions and the broader market, including current shareholders. This target of 50% to 60% is dependent on market conditions, which have been volatile, particularly given the recent uncertainty of the impact to the global economy of a potential trade war. Consequently, we have been pursuing the upper end of this target range.</p> <p class=\"paywall-full-content\">Earlier this quarter, we announced securing A$200 million from the National Construction Fund as part of our cornerstone investor funding. Following significant engagement and progress over the last quarter, we are confident in achieving our cornerstone investor equity target, and we are now in a position to be able to progress with multiple investor pathways to a fully funded solution. This is important. Having multiple pathways not only firms up securing the required funding, but also so that we can attain the best outcome for our shareholders and the long-term objectives of the company.</p> <p class=\"paywall-full-content\">Specifically, Arafura is assessing a potential joint venture structure, which could significantly reduce the equity required to fund Arafura’s remaining project interests. Given the need to evaluate the merits of multiple pathways as well as some potential cornerstone investors requiring additional time to progress through their internal processes and due diligence. FID for Nolans will extend beyond the previously advised window of the first half of this calendar year.</p> <p class=\"paywall-full-content\">We will update the market as material equity funding milestones are achieved in advance of announcing FID later this calendar year.</p> <p class=\"paywall-full-content\">We expect that as we progress the different funding solutions during this quarter, we will be able to provide more definitive guidance on FID timing. I do want to point out that we will only progress a funding solution that requires more time if it presents a better outcome for our shareholders and the long-term objectives of the company.</p> <p class=\"paywall-full-content\">Given this and the advanced status of our engineering, we have conducted an operational review. This has led to a reduction of project and engineering effort that will see our financial runway push out to the first quarter of next calendar year 2026. This decision does, however, mean that we will need to ramp back up the project and engineering capability post bid, placing up to an additional four months to the project schedule.</p> <p class=\"paywall-full-content\">We will use this four month ramp up period as an opportunity to retest market prices and retender where appropriate to ensure that the best possible capital outcomes for project are being achieved.</p> <p class=\"paywall-full-content\">I will now hand over to Peter to talk through the strategic importance of the Traxys offtake. Thank you, Peter.</p> <p class=\"paywall-full-content\"><strong>Peter Sherrington</strong></p> <p class=\"paywall-full-content\">Thanks, Darryl. During the quarter, we announced and concluded a binding offtake agreement with Traxys Europe for a base amount of 100 tonnes per annum of NdPr. The offtake agreement has a five-year period. And at Arafura’s option, we can nominate up to a further 200 tonnes per annum of NdPr to be placed into the market with Traxys. For those who don’t know, Traxys is a global physical commodities trader, and it trades battery materials, industrial minerals, and has existing business in the rare earths sector and with other metals as well.</p> <p class=\"paywall-full-content\">We know that Arafura has been prioritizing offtake partners who bring strategic support to Nolans, and this is, in most instances, a link to equity investment. We know that the Traxys in offtake doesn’t bring equity, but it does provide us with some volume flexibility, which we felt was quite strategic. We, in effect, have a 100 tonnes per annum amount, but an optional amount of 200 tonnes per annum. The key here is that can assist us with managing variability in production volumes and delivery schedules that arise over the life of the initial off take agreements.</p> <p class=\"paywall-full-content\">We also saw some significant value in building a strategic relationship with a trading company who has a deep understanding of the rare earths market. And from that perspective, Traxys was a good fit. So whilst the volume was small, it doesn’t have a link to equity. It’s fairly strategic from a long-term perspective in building that relationship. And it’s also critical to us in that it provides us some optionality around a volume from 100 tonnes to 300 tonnes to placed with that off taker. And we were sort of very keen to get this arrangement locked in. And just Frank Richards, our sales and marketing manager, did a good job in structuring this off take and worked well with Traxys in order to complete the arrangement.</p> <p class=\"paywall-full-content\"><strong>Darryl Cuzzubbo</strong></p> <p class=\"paywall-full-content\">So, Harmony, we might hand over to you for any questions coming through.</p> <p class=\"paywall-full-content\" id=\"question-answer-session\"><strong>Question-and-Answer Session</strong></p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">Thank you. [Operator Instructions]</p> <p class=\"paywall-full-content\">Seems there are no phone questions at this time. I’ll hand back to your speakers to address your webcast questions.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Brett Smith</span></strong></p> <p class=\"paywall-full-content\">What level of assurance or confidence can you give shareholders that FID will happen before the end of the calendar year?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Yeah. So let me take that one, Brett. So that’s probably the million-dollar question. Right? So let me share with you what we’re doing around that. Right? And you can you can see this in the introductory, comments. So there’s a there’s a few parts to it.</p> <p class=\"paywall-full-content\">So firstly, we’ve engaged with multiple cornerstone investors more than what we need to secure, the equity that’s required and that gives us optionality. That gives us multiple pathways to get there. And with that, that gives us confidence to secure FID. And, and also by having different options, it gives us options to choose what is in the best interest of our shareholders in a long-term company. We’re confident of achieving FID for that for that very reason.</p> <p class=\"paywall-full-content\">If you look at some of the geopolitical events that has raised awareness around the importance of rare earths to the manufacture of permanent magnets and why you need permanent magnets. I know everyone on this call has been aware of that, but I think that awareness across the globe hasn’t been there. But that awareness is increasing rapidly, and that is very helpful for us.</p> <p class=\"paywall-full-content\">The other thing that we’ve got to take into account, though, is that many investors are, I’m going to say, somewhat sitting on their hands waiting to see what happens with this potential trade war. So the way we’re playing this is we’re engaging with that cornerstone investors more than what we need. We’re using the opportunity of this increased awareness of the importance of rare earths to engage with other parties so they’re ready to come in so that as the market settles down, we’re ready to move.</p> <p class=\"paywall-full-content\">Long story short, we’re confident of achieving FID because of that engagement. And as we achieve milestones, we will share that with the market so that you can see the progress that we’re making.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Brett Smith</span></strong></p> <p class=\"paywall-full-content\">If the current government is returned this weekend, does their promise of a strategic critical mineral stockpile present an opportunity for Arafura and additional offtake?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Yeah. It does. It does, Brett. So I would make a couple of observations. So firstly, the strategic reserve is helpful in getting up a rare earths sector in Australia, including Nolan’s. And I think Nolan’s has a, you know, first cattle of the raid, has a significant role to play in that.</p> <p class=\"paywall-full-content\">If you look at the number one reason we don’t have a non-China supply of rare earths, it’s because of China’s control over the pricing. With the last 12 months, they’ve either been making marginal profits or have been losing money. So establishing a strategic reserve and offtakes, I think presents the opportunity to create a different pricing mechanism, which would obviously benefit us.</p> <p class=\"paywall-full-content\">I think the other reason for a strategic reserve, though, is it gives the Australian government additional clout at a time where trade patterns are being are being rewritten. But I also note that the Australian government has said that they would go through an extensive consultation process to make sure that this strategic reserve is used in, if you like, in the best long-term interest of Australian into rare earths sector.</p> <p class=\"paywall-full-content\">So there’s a lot to still be worked through there, but I think it’s a very positive development and is very timely for us.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">James Lowry</span></strong></p> <p class=\"paywall-full-content\">How does AIU propose to mitigate construction costs with transport infrastructure to get Nolan’s product to Darwin Port?</p> <p class=\"paywall-full-content\"><strong>Darryl Cuzzubbo</strong></p> <p class=\"paywall-full-content\">Yeah. So a good question. So firstly, our engineering is quite extensive. And why that’s important is because it locks down scope. So if you lock down scope, you have less surprises as you progress the project. That is a key driver of CapEx.</p> <p class=\"paywall-full-content\">The other driver of CapEx, of course, is the cost of that of that scope. And, we have developed commercial strategies and developing commercial strategies to make sure that we get the best competitive pricing. You’ll have noted that earlier I mentioned that, we will need four months to ramp back up our project team post bid before moving into construction proper. And we’re going to use that time to retest some of our pricing where we know that there is more capacity in the market and has a bit more competition than there was earlier.</p> <p class=\"paywall-full-content\">But just to answer your question, I mean, there’s a couple of key drivers to manage your CapEx. One is locking down the scope through advanced engineering, which we’ve done. And then secondly, having sourcing strategies that get the best potential pricing for that for that scope, which is what we’re doing.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Ronald Lomax</span></strong></p> <p class=\"paywall-full-content\">Linus has been in production for many years but has never been able to pay a dividend. How long does Arafura expect to be until they be profitable and pay a dividend?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">So what so we can’t talk to exactly what’s going to happen in the future. But what we can talk to is what we expect to happen and how we can help that happen. So the number one issue that the rare earth sector, including Linus, has been having to deal with is China’s control of pricing. That control will come to an end or be minimized when there is a when a number of things can happen.</p> <p class=\"paywall-full-content\">One, when a structural supply deficit happens, the pricing will naturally increase. And we’ve seen that in the past when there’s been, short-term supply disruptions. We’ve seen the pricing double to triple. If that had have occurred on a long term, Linus would have been paying dividends, I am sure.</p> <p class=\"paywall-full-content\">So if you look at the forecast of demand doubling over the next 10 years, and China’s ability to meet that demand, we believe and other forecasts believe there will be a structural supply deficit, and that will create a very different pricing mechanism. So that’s one trigger that will create a different pricing mechanism.</p> <p class=\"paywall-full-content\">The second thing that will create a different pricing mechanism is, and we’re seeing this playing out today, right, is when trade restrictions are being applied, whether that’s through restrictions or tariffs, and that creates a non-China pricing index. And this is where the Australian strategic reserve can play a very important role in creating a seaborne trade only NdPr index. What that means is China’s domestic production and, consumption of rare earth magnets is taken out of the equation, and therefore, you have a truly functioning NdPr index that reflects true supply and demand.</p> <p class=\"paywall-full-content\">Argus believed that in that sort of scenario, we would see pricing close to triple – long-term pricing close to triple of what we’re seeing today.</p> <p class=\"paywall-full-content\">The third trigger of a different pricing environment is, and I’m going to use EV buyers as an example here. Most electric vehicle buyers want to be a responsible part of the energy transition. A lot of the rare earth magnet that come out of China, it has been getting their feedstock from places like Myanmar, which have poor environmental standards, but poor human rights standards as well. As that becomes -- as awareness of that grows, I’d like to think that EV buyers will be more selective and demand that the supply of the materials that go into making electric vehicles is coming from responsible sources.</p> <p class=\"paywall-full-content\">So I’ve just talked through three triggers that will create a very different pricing environment that will then enable us to grow, pay dividends in the future, etc., etc. It only takes one of those three to trigger the sort of pricing environment, and we’re already seeing the second trigger, which is trade restrictions related taking place.</p> <p class=\"paywall-full-content\">So that’s why we’re confident that we will be a very profitable organization that’s able to grow and ultimately pay dividends.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Lee Birch</span></strong></p> <p class=\"paywall-full-content\">Could you please confirm whether the potential joint venture involves a single party or multiple parties? Furthermore, would such a partnership reduce the risk of further dilution for existing shareholders?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">So we’ll be able to share more when we’re at a position to share more. But one of the benefits, obviously, with the joint venture is that it significantly reduces dilution. This quarter, we will be assessing our different options as they progressed, and they do need to be progressed before we get to a point where we can assess what’s in the best interest of our shareholders. But one of the pluses with joint venture structure is that it reduces dilution.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Bernard Ho</span></strong></p> <p class=\"paywall-full-content\">How is AIU going with securing remaining binding offtake agreements? Is GE still in the pipeline?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Yeah. Did you would you like to talk to that one, Peter?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Peter Sherrington</span></strong></p> <p class=\"paywall-full-content\">Yeah. No problems. So in terms of securing the remaining offtake, the issue is not so much around the requirement for the offtake. And I think some of the events that we’ve seen over the last couple of months since the U.S. tariff announcements have probably reinforced that view that there is a need for a non-China -- or a supply diversification.</p> <p class=\"paywall-full-content\">So I think that the challenge for us is that we are trying to link the remaining offtake to strategic equity. And we’re going to hold pretty hard on that because we believe that NdPr offtake is strategic, and we’re going to link the equity to that. And we’ll stick to that. That’s probably the challenge that presents to us around securing offtake.</p> <p class=\"paywall-full-content\">The second part of the question, so we’re confident we will get that, but we are probably making our work around getting the offtake more challenging by linking that equity to it. But it’s critical to the funding strategy which we’ve set out.</p> <p class=\"paywall-full-content\">In terms of GE, we have an ongoing relationship with GE. We have seen that, for example, GE has probably been not gaining market share in the offshore wind turbine business. That is making it difficult for them to make a commitment now to offtake, but we remain engaged with them on looking at ways that they may be able to commit to offtake as we start to close out the final offtake group. So whilst we don’t see them as one of the groups that we will be engaging with on the equity opportunities, we still engage with them on offtake.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Shaan Beccarelli</span></strong></p> <p class=\"paywall-full-content\">There are a number of questions coming through regarding the alternative funding solutions or potential alternative funding solutions. So I’m just going to lump them into to one question.</p> <p class=\"paywall-full-content\">Is there any more information you can share about the potential joint venture, and is the structure likely to be a 50-50 joint venture?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Yeah. So I can’t share anymore at this point. Right? So I’m very mindful that there’s a need for additional information. And as soon as we can share it, we will share it.</p> <p class=\"paywall-full-content\">The reason for flagging it, though, is because in the past, we’ve been talking about our equity strategy, and we haven’t specifically flagged the JV structure. But that is a real alternative. But it’s too early for us to comment anymore at this stage, but we’re mindful that there is a strong desire to name more. And as soon as we can, we will share it.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Paul Stevens</span></strong></p> <p class=\"paywall-full-content\">Is Arafura seriously considering dysprosium and terbium geochemical processing capability?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Good question. So our current CapEx does not include that. We’ve got processing capability locked in through third party to take the heavies to a oxide, but that is an option that we’ll always be open to and always be looking at. Peter, do you want to make any additional comments to that?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Peter Sherrington</span></strong></p> <p class=\"paywall-full-content\">Yeah. So in in the short term, as Darryl mentioned, we see some third-party processes and they’re in the right jurisdictions who have the ability to process that material, and we’ve had engagement with those groups around separating the DY and TB because we do get inquiries around those particular products. And again, we see them as strategic. And whilst they are not significant in terms of revenue, we probably see them as being important in terms of locking in those final off takers and equity providers.</p> <p class=\"paywall-full-content\">Yeah. But as Darryl mentioned, at present, our CapEx does not include the scope of separating those products. But I think ultimately, it’s something we would look to try and work through ourselves. But I think we would be up for our first challenge of producing NdPr on spec and rely on those tollers as an interim measure.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Roberto Versace</span></strong></p> <p class=\"paywall-full-content\">Are there any concerns in the change of government and whether the current government funding may be withdrawn?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Good question, Roberto. So, so we’re not concerned about a potential change in government. I mean, parties are supportive. The opposition have said that they would support funding that we’ve already received. I would note that the current government has very welcome their support for the production tax incentive. That is that is helpful. And the current government has also raised the strategic reserve, and that that still has to be worked through on the assumption that they get reelected. But if you if you take a step back, the Nolan’s project creates significant employment, significant downstream manufacturing, across Australia. And consequently, we enjoy the support of both parties at both the Northern Territory and the federal level. So we’re not we’re not we’re not concerned.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Steven Darrington</span></strong></p> <p class=\"paywall-full-content\"><strong>I</strong>s the proposed strategic stockpile likely to be associated with further government equity joint venture opportunities?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">It’s too early to say. The Australian government has really just outlined at a very high level what they intend to do with the strategic reserve and that they will enter into a consultation process, and we look forward to participating in that.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Steven Allen</span></strong></p> <p class=\"paywall-full-content\">You mentioned retendering where appropriate. Can you advise what the potential criteria for doing that would be?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Yeah. Good question. So, Steven, so the environment is a little bit different today than it was when we got the original tenders and we went for a process and selected our preferred tender. It’s we’ve seen our projects pulled back, some operations, nickel, cease or going to cease, and that’s created some additional capacity in the market. And we’ve had some tenders come back to us and said that if there is an opportunity, they would like to retender.</p> <p class=\"paywall-full-content\">So we will be selective in retendering where we think there is a benefit, mindful that we also don’t want to delay our project schedule as well.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Andrew Ballard</span></strong></p> <p class=\"paywall-full-content\">The Australian government supports stated interest free loans of up to a billion dollars. Is management engaging with the government on this opportunity?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Peter, do you have any comments on that?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Peter Sherrington</span></strong></p> <p class=\"paywall-full-content\">No. I’m aware of the facility that the shareholder’s referring to. Sorry, Darryl. I mean, obviously, we’re engaged with the government on debt financing but there are some concessional interest rates on the facilities that we’ve secured. Some of them are referenced to commercial rates as well, but they’re all on interest payable on amortization basis.</p> <p class=\"paywall-full-content\">So, yeah, I can’t provide any comment. We can look into it further and provide some further comment if there’s something that we we’ve missed.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">It’d be great to if you didn’t mind sending through some details on that. If there’s something we’re not aware of, which would surprise me, but we would be very interested in pursuing that.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Nick Stott</span></strong></p> <p class=\"paywall-full-content\">Is Phase II a part of any offtake JV and or equity negotiations?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Good question. So phase II is obviously a draw card because it presents a significant growth opportunity for any party. However, given that we’re not talking about a decision for phase two, it’s excluded from any binding agreements, but it’s obviously a draw card for investors and potential JV partners.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Bernard Ho</span></strong></p> <p class=\"paywall-full-content\">With the Trump presidency, do you see the US government potentially being part of any equity funding and or grant funding given their national security concerns?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Darryl Cuzzubbo</span></strong></p> <p class=\"paywall-full-content\">Bernard, so, good question. Right? So, again, I probably can’t say too much, but what I can say is that as we look for a fully funded solution and the if you like the U.S. is growing attention to securing rare earths supply, we’re certainly exploring avenues around that. But there’s nothing that’s at a point that we can be definitive about at this point.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">That’s all the written questions for now. So, Darryl, I’ll pass back to you for closing comments.</p> <p class=\"paywall-full-content\"><strong>Darryl Cuzzubbo</strong></p> <p class=\"paywall-full-content\">Okay. So, look, thank you everyone for again for your time, and for your questions. Any follow-up questions, please send them send them through.</p> <p class=\"paywall-full-content\">Let me just make a couple of concluding comments. Particularly the last few months, the importance of developing a diversified rare earths and permanent bag supply chain has been thrown into sharp focus by recent geopolitical events.</p> <p class=\"paywall-full-content\">Arafura’s Nolan’s project remains the only significant construction ready, auto oxide rare earth project in the world, offering the potential to bypass the dominant Chinese supply chain. We continue to make significant progress executing our equity funding strategy, which is the final piece to put in place before making a final investment decision.</p> <p class=\"paywall-full-content\">Following the initial cornerstone investment from the National Reconstruction Fund, we’re confident securing a cornerstone investment target with multiple pathways to get there.</p> <p class=\"paywall-full-content\">Our timing is fortuitous, but we have the right project at the right time. I’d like to thank you for your time for dialing in, and we look forward to providing you updates in the near future.</p> <p class=\"paywall-full-content\">Thank you.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">[Operator Closing Remarks].</p>",
            "link": "https://seekingalpha.com/article/4779562-arafura-rare-earths-ltd-araff-q3-2025-earnings-call-transcript",
            "pub_date": "2025-04-30 16:37:16",
            "source": "seekingalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4779572",
            "title": "MAC Copper Limited (MTAL) Q1 2025 Earnings Call Transcript",
            "type": "transcript",
            "description": "<p>MAC Copper Limited (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/MTAL#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link\" title=\"MAC Copper Limited\">MTAL</a></span>) Q1 2025 Earnings Conference Call April 29, 2025 7:00 PM ET</p> <p><strong>Company Participants</strong></p> <p>Mick McMullen - Chief Executive Officer<br/> Morne Engelbrecht - Chief Financial Officer</p> <p><strong>Conference Call Participants</strong></p> <p>Daniel Morgan - Barrenjoey<br/> Ben Wood - Wilsons Advisory<br/> David Radclyffe - Global Mining Research<br/> Timothy Hoff - Canaccord<br/> Eric Winmill - Scotiabank</p> <p><strong>Operator</strong></p> <p>Thank you for standing by, and welcome to the MAC Copper Limited Q1 Results Call and Webcast. All participants are in a listen-only mode. There will be a presentation followed by a question-and-answer session. [Operator Instructions]</p> <p>I would now like to hand the conference over to Mr. Mick McMullen, CEO. Please go ahead.</p> <p><strong>Mick McMullen</strong></p> <p>Thank you very much, and thanks everyone for joining us on what is a busy reporting schedule given the shortened holiday period in Australia. I'm Mick McMullen, I'm the CEO. I'll run through the presentation. I'm joined by our CFO, Morne Engelbrecht, who will talk to some of the slides on the financials. This deck has been released on the ASX along with our quarterly report this morning, and as usual, we've got the disclaimers and everything at the front that you can all read at your leisure.</p> <p>So, look, MAC Copper at a glance, we get an enterprise value of around about $940 million. We're sort of planning to get over 50,000 tonnes of copper in the not-too-distant future on an annual basis, very strong balance sheet. Obviously, we've announced the refinancing of the debt that we did during the quarter. Morne will run through that. And just so everyone is clear, we took - to make sure the market understands how many shares we're going to issue, 82.5 million shares, and issue about 3.18 million warrants at a strike of $12.50 a share.</p> <p>The gearing under 20%, which<span class=\"paywall-full-content\"> is within our range of where we sort of target. And we've got two key growth projects underway, the ventilation work, which is - we'll talk about at later slides. And then the really exciting news actually is the Merrin Mine that we started rolling out in the marketplace during the last quarter, and we've made some really good progress on that. And so we've got quite a few slides on that as we are quite excited about that thing.</span></p> <p class=\"paywall-full-content\">So, going forward, first quarter is always our softest quarter. If you recall, the fourth quarter last year was a very strong quarter. And then obviously, we then have to come through the sort of the January period where we pushed very hard in the back six weeks of last year. And we typically see a little bit of seasonal variation in weather as well, with sort of summer storms.</p> <p class=\"paywall-full-content\">It really is a function of as sort of where we are in the stope sequence, and we can see the stope sequence we have ahead of us right now we've got a lot of large tonnage, very high-grade stopes that have been coming online over the last few weeks. And therefore, we're not changing our guidance based on what we can see coming out of the ground ahead of us.</p> <p class=\"paywall-full-content\">C1 was still pretty decent at $1.91 a pound, total cash cost of about $2.47 a pound and a realized price of $4.04 a pound for the quarter. And if you read that little footnote there, we've had some questions from people about the impact of the hedges on received price and so we are now showing that received price net of hedges.</p> <p class=\"paywall-full-content\">I'll let Morne really go through all the balance sheet and the financials, and liquidity. But for this year, 43,000 tonne to 48,000 tonne of copper is where the guidance sits. Copper grade somewhere between 3.8% and 4%, and obviously, we had a very strong grade profile during Q1 and growth CapEx of somewhere in the order of $20 million, $25 million and sustaining of $40 million to $50 million.</p> <p class=\"paywall-full-content\">And overall, we have seen some good tailwinds coming in this year from both exchange rate and TCRCs. And actually, for those of you who follow the market, we've seen actually spot copper treatment charges at negative $40 a tonne which is sort of should indicate a pretty good annual benchmark settlement for next year, possibly even lower than where we currently sit.</p> <p class=\"paywall-full-content\">So that's been quite a good positive thing, which I guess has obviously helped our C1 despite the lower volume during the quarter. Safety, we like to talk about. I would say I've said on calls in the past that our TRIFR has been okay, but probably a little sticky, I suppose. But now we're starting to see the benefit of all the hard work that the team at site have done with the TRIFR starting to trend down quite nicely. And I think by the end of April, we've ended up at around a TRIFR of around 7, actually, for the last 12 months. So that's great.</p> <p class=\"paywall-full-content\">One of our big sustaining capital projects that we're doing is our Tailings Storage Facility. So the Stage 10 embankment, that's on track for completion in the fourth quarter of this year. Again, just for the Australians, we're an annual financial year, so in the December quarter and that will provide us capacity up to about 2030. And so, we are actually building all of that now. So we're well on track. We've had no reportable environmental incidents during the quarter. So from an ESG point of view, actually, we've had a pretty good improvement on where we had been tracking before.</p> <p class=\"paywall-full-content\">Our production, look, obviously, we saw a production trend down. As I said, it was a combination of pushing very hard during the fourth quarter. You can see there the December quarter numbers were very strong, and probably a day and a half of production lost in February due to some summer storms, which again, if you think back to last year, exactly what we had that period. Grade was good. So, head grade is a bit over 4% copper. And we expect to see the Q2 grade to be as strong, if not a bit stronger. And again, really, the increase in C1 was driven by volume, right? We've always sort of said that fixed costs are sort of circa 70% of our volume, but we did have a bit of a win on the TCRCs.</p> <p class=\"paywall-full-content\">And in the word version of the quarterly that we put out, if you look at our production and cost in the month of March. Obviously, as we sort of did a lot of catch-up work in January after the very strong December quarter. If you look at the month of March, we produced just under 4,000 tonne of copper and our C1 was around about $1.45 a pound. So that sort of gives you an indication of where we think the business should be and can be.</p> <p class=\"paywall-full-content\">And again, it's really making sure that we have as a minimum two or three months really strong in a quarter, and actually, this Merrin Mine has the ability to sort of smooth out some of those ups and downs in the production cycle. So, overall, it was an okay quarter. We do expect always the March quarter to be our softest quarter, and that pattern has been maintained.</p> <p class=\"paywall-full-content\">Lots going on this slide here. I guess we've sort of - again, we've had some questions from people around total CapEx and sort of what's in growth and exploration and sustaining. And Morne has done a great job on the graph on the left there sort of trying to outline what we've spent the money on. You will note that sustaining CapEx has dropped down a fair bit actually. We had a very strong spend on the Stage 10 capital expenditure during the December quarter, and sort of ahead of the game there, also some of the timing of rebuilds has basically resulted in us needing to spend less capital.</p> <p class=\"paywall-full-content\">You can see there the growth CapEx was sort of pretty constant around about that $4 million, and what's in growth CapEx. So we don't put tailings dams into growth that's in sustaining. But we do put Merrin Mine expenditure, and the capital event project sits in there, and then we spent about just over $1 million on exploration.</p> <p class=\"paywall-full-content\">Development meters. So again, we're starting to give a little bit more detail for people here as to where the development meters are going. We're coming from. And you can see here that blue bar on the graph on the right is the Capital Vent project, which we've spoken about, has been very important for the future of the mine.</p> <p class=\"paywall-full-content\">You can see we're starting to ramp up the development meters there. Again, for those of you who followed us for a while. As we turn off from the existing workings and head out to these things, the development rates are quite slow because we're interacting with the existing mine, and that's Merrin Mine and the Capital Vent project have both been the same.</p> <p class=\"paywall-full-content\">But as we get a bit further out, then we can start not interacting with the mine, and we can really start ramping up those meters. And so, that's really what you're seeing in that graph on the right.</p> <p class=\"paywall-full-content\">In addition to that, we did an extra 227 meters of capital development up in the Merrin Mine. So if you think about total development for the business, we are actually starting to ramp up capital development quite a bit here, and you will see why in the Merrin Mine, that's actually we've been able to do a lot of development meters with not a lot of equipment and for pretty cheap cost.</p> <p class=\"paywall-full-content\">So look, our goals are still the same. It's really been consistent, safe, low-cost copper production. We do want to advance our ventilation project. We want to get the Merrin Mine online, and obviously the balance sheet. So this sort of bridge gives you a bit of an idea of where we see the production coming from. So for next year, 2026, the midpoint of guidance around about 50,000 tonnes of copper. We see the Merrin Mine being additive to that and we're getting quite excited about the Merrin Mine as you're going to see in the next few slides here.</p> <p class=\"paywall-full-content\">So, targeting production from the fourth quarter being the December quarter this year. This is everything from surface down to about 900 meters below surface. It's the Merrin mine. It's got a whole bunch of different deposits in there, but just making life easier, we just call it that. Not all of that is in or S-K 1300 resources, but we have sufficient confidence in those mineralized estimates to make investment decisions, and really that revolves around the age of some of the assay data and assay certificates with the resource and reserve QPs and the mine planning teams have done a Herculean effort here to digitize a lot of old data and to go and do check drilling and confirmation work, which has taken quite some time. This is data that's gone back over 40 years, 50 years, but actually, we found a significant amount of mineralization that was sitting in there.</p> <p class=\"paywall-full-content\">Most of it sitting very close to existing development. I try and break it down into the simplest form by saying there's really four separate components to this mine. There's the quite high-grade narrow, three, four meters wide at 10% to 20% copper. In that QTS South Upper, which is that little blob sitting right up on the top-left of that page there, that image. That's what we're driving out to now. Then there's a reasonably high grade sort of 8% to 10% zinc with a little bit of lead and a high-grade zinc zone, which our plan is to mine that and truck that up to polymetals to the Endeavor mill for treatment.</p> <p class=\"paywall-full-content\">We then have what we call a medium-grade copper ore body, which actually in terms of tonnage is the largest part, quite substantial, around about 2.5% copper. And then last is the mixed, which is a mixed copper-zinc material, which actually is starting to become reasonably sizable as well. The beauty of this thing is that it is completely separate to the rest of the mine. We access it through the decline. It's 150 meters to 200 meters below surface. It's fantastic ground. The team that's up there is running as a separate operation and is doing development at a much faster rate than we currently can do at the bottom of the mine.</p> <p class=\"paywall-full-content\">We really have no great constraints apart from equipment and people. We've been spending a lot of time at site with the corporate team over the last six weeks actually adding resources to this. We've doubled the number of jumbos that are going in there and increasing the number of trucks, increasing the people. Because, quite frankly, this is a lever we can pull very cheaply.</p> <p class=\"paywall-full-content\">Our cost per meter to develop is roughly one-third of what it is at the bottom of the mine. And as we've said often, the more you look, the more you find at CSA and I'll run through some of the things that we found. So again, we're sort of on track for some production for copper out of this during the fourth quarter. And we're actually quite excited about this.</p> <p class=\"paywall-full-content\">So the view on the left is a surface plan, all that light gray looking stuff is the surface projection of the existing underground workings. QTS South Upper is heading off to the left side of the page. Pink Panther is another deposit we've been drilling out from surface, and sort of that is the surface expression of the Merrin Mine.</p> <p class=\"paywall-full-content\">As we have developed the drive out towards QTS South Upper, we have discovered quite a bit of massive sulfide, both copper and you can see in that - actually that's the tagboard cutty for independent firing there, but that's about 2.5 meters of high grade massive sulfide for copper, which was not in any of the models at all. We've also developed through some quite high-grade zinc and lead mineralization as well on the way out there.</p> <p class=\"paywall-full-content\">So, we think there's a lot of opportunity to expand this. And as I've said, there's no real constraints in terms of going faster or doing more, apart from people and equipment. So we now have independent ventilation that's been established there. So again, as you start developing out from the existing drives, it's slow, you're interacting with the rest of the mine. The team have managed to tap into an existing vent shaft out there that's not connected to the bottom of the mine. And during the month of April, we've established independent ventilation and therefore independent firing, and now we can really ramp up development rates.</p> <p class=\"paywall-full-content\">Having said that, one jumbo up here has been getting about the same amount of meters more or less as three jumbos at the bottom of the mine. So and consequently, very cheap on a unit rate basis. So we're pretty excited about this area. You can see here this is the drive going out to QTS South Upper and again the more you look, the more you find we drilled actually that vertical hole on the right is a geotech hole for where the vent rise was going and it hit the typical three to four meters at 10% to 20% copper mineralization.</p> <p class=\"paywall-full-content\">So all of a sudden we decided to go and drill some more holes up there, and guess what, we've extended that ore body vertically about 70 meters now. So we knew enough to go to make the investment decision to go out there, but we knew everything was still open. As we go out there, we're finding more and more stuff. So we're pretty happy with the way that's all going.</p> <p class=\"paywall-full-content\">It really will be a separate mine to the rest of the mine. So again, the existing mine is being accessed to, the ore comes out through the haulage shafts. This is coming out through the decline. It's around about a six-minute drive from the ore body to the ROM pad and very low unit rates relative to what we currently cost us to mine and quite good grade as well, actually.</p> <p class=\"paywall-full-content\">And so we've been asked, well, how big could this thing be? Not all of it's in reserve, very little of it's in reserve, in fact, is actually in JORC Code resource. I think it's pretty topical right now, but this would be a wood lawn-sized mine, but mostly copper with a bit of zinc as opposed to the other way. That's probably the most analogous thing I can give to people right now just for the Merrin Mine, is that this would be a round about a Woodlawn-sized operation. So you can tell while we're quite excited about and why we're throwing more resources at it as quickly as we can.</p> <p class=\"paywall-full-content\">Ventilation project, so again, chugging along. You could see from that graph earlier that the development meters is really starting to ramp up in that thing, still on track for Q3, the September quarter next year, after completion. This is really important for unlocking the bottom of the mine allows us really for the bottom of the mine to get additional vent. And so, in the immediate term, we're developing this Merrin Mine, which will have a reasonably long life, but also we haven't taken our eye off the ball for this thing because this is actually really important for unlocking the bottom of the mine.</p> <p class=\"paywall-full-content\">With that, I'm going to hand over to Morne, and he can talk to people about the financial side of things.</p> <p class=\"paywall-full-content\"><strong>Morne Engelbrecht</strong></p> <p class=\"paywall-full-content\">Right. Thanks, Mick. Good evening, morning, everybody.</p> <p class=\"paywall-full-content\">Going to Slide 15 now, we announced during March 2025, the very exciting news that we completed the refinance, as Mick said, of our debt structure with the recut of the senior debt facilities, including the early repayment of the mezzanine facility. Overall, we have significantly delevered and simplified our balance sheet over the last year, reducing our net gearing by more than 50% to just under 20%, as Mick said, at the end of March 2025.</p> <p class=\"paywall-full-content\">Just to recap what has changed with the refinance. So, as you remember, we had the old facilities, which were made up of the $159 million term-loan facility. There was a $25 million revolving credit facility. A $145 million mezzanine debt facility and then a $45 million Aussie environmental bond that was provided by Glencore. The new facilities are made up of $159 million term loan facility, $125 million revolving credit facility, and an AUD45 million environmental bond now provided by three new Australian banks.</p> <p class=\"paywall-full-content\">Some of the key highlights of the refinance is really around we've now fully repaid the mezzanine debt facility. So that's the $160 million that we repaid on that facility, which included the 4% premium in the interest to June. We did extend the maturity of the old facilities as well, so both the term and the revolving facilities to March 2028.</p> <p class=\"paywall-full-content\">We increased the revolving credit facility by $100 million to $125 million providing even greater flexibility and available liquidity. And the refinance provides for repayment holiday to 30 September '25. And then also we've got a new repayment profile, which reduces our repayments by $123 million by December '26, when comparing the old versus the new repayment profile.</p> <p class=\"paywall-full-content\">Importantly, we also reduced the average weighted cost of debt by more than 30%. So that's sort of setting at the end of March to sort of around that 6.84% on the senior debt we've got outstanding at the moment. That sort of saving equates to about 100 - equates to about $14 million per annum cash interest saving.</p> <p class=\"paywall-full-content\">And then finally, on the contingent copper payments to Glencore, we have maintained the contractual position that the contingent payments will not be payable before June '26, even if triggered other than for - from free cash flow after satisfaction of all of our operating costs, royalty, debt repayments, and stream servicing costs.</p> <p class=\"paywall-full-content\">So overall, we are extremely pleased with the refinance position of the balance sheet and obviously very thankful for the great support that's been provided by our lenders in that regard. Moving to Slide 16, and the all-important cash flow waterfall. Just to go through a few key elements there. So firstly, again, we had a very healthy free cash flow from operations there after sustaining CapEx of around $30 million for the quarter. Secondly, we paid that, as I said, $160 million to extinguish the Mezzanine facility, which included that 4% premium and then also the interest paid of around $9 million from 1 January to 16 June '25, that's included in that 160.</p> <p class=\"paywall-full-content\">You will note the interest there that we have from the senior facility of $3 million. And as I said before, with the repayment of that mezzanine debt, we're now saving around $14 million per annum on interest on that. We also sold some concentrate at the port of just over 1,500 tonnes at the end of March. So that was just to align the production and sales from a cash point of view, albeit we couldn't recognize it as revenue because it wasn't loaded on ship by the end of March, but that sort of happened in early April.</p> <p class=\"paywall-full-content\">So in summary, our senior facility is now sitting at sort of $159 million. We threw down on about $66 million on the revolving facility and then we had $75 million of cash in the bank at the end of March as well. So that gives us that sort of net debt figure of $150 million. And all in all, we also had a very healthy liquidity of $153 million, so almost AUD245 million. Liquidity available to us at the end of March and that sort of consisted of that undrawn revolving facility of $60 million.</p> <p class=\"paywall-full-content\">We also had outstanding QP receipts of $8 million unsold concentrate of about $8.2 million. And that investment in Polymetals, which has done really well for us at around $3 million as well, that sort of contributed to that sort of liquidity. So, overall, very strong and healthy balance sheet position and with the completion of the refinance and obviously the repayment of the mezzanine debt facility there, so that - which will buy some significant cash interest savings for us going forward.</p> <p class=\"paywall-full-content\">Going to Slide 17, just a slide we've shown before, just showing our targets around production, cash costs and gearing. Mick has already covered off on how we are targeting significant growth through the execution of those two key projects in terms of the Merrin Mine and the Ventilation Capital project. So, yes, so - which we'll deliver at the end of this year and then Q3 next year, respectively. And that will drive that targeted annual copper production above 50,000 tonnes.</p> <p class=\"paywall-full-content\">On the cost side of things, again, we've been shipping away at the cash cost there. And C1 has reduced significantly from around 30% to $1.91 from the March quarter compared to June '23. And then, as Mick has mentioned as well, the C1 in March with the production that roughly 4,000 tonnes in March dropped to about $1.49 per pound. So that's very pleasing to see and already demonstrates that we sort of getting to that target of $150 that we have for 2025.</p> <p class=\"paywall-full-content\">And then with the refinance, as we've sort of walked through that's reduced significantly from where we started out, and that's sort of within our target range of just below 20%. So all very pleasing and pleasing to see that all those metrics are paying the right way, and pleasing to see the progress there.</p> <p class=\"paywall-full-content\">And, back to you, Mick.</p> <p class=\"paywall-full-content\"><strong>Mick McMullen</strong></p> <p class=\"paywall-full-content\">Sure. Thanks for that.</p> <p class=\"paywall-full-content\">So look, I think in summary, we're executing on the plan, the base plan, maintaining guidance. We expect to have a pretty strong second quarter based on the production profile we have ahead of us. Our investment in Polymetals has done really well. They look to be progressing well towards ramp-up. I guess we actually have some high-grade zinc material in the Merrin Mine that we could mine quite quickly. We're just waiting to see how they go ramping-up. But again, we would like to think that by the fourth quarter of this year, we are shipping them some zinc mineralization for treatment.</p> <p class=\"paywall-full-content\">We have signed that tolling agreement with Polymetals. But that's - subsequent to the end of the quarter, I think on the 1st or 2nd April, we invested another AUD2.5 million into Polymetals at AUD0.35 and trading it to 90-ish. So that's been a good return for shareholders.</p> <p class=\"paywall-full-content\">And overall, as I said, we're liking Merrin Mine more and more the more we look at it. The ease with which we can get stuff done, mining is never easy. But on a relative basis, it is quite easy up there. It's very shallow, fantastic ground, really quick to develop stuff, and we are finding more and more material up there that can go through either our plant or the Polymetals plant.</p> <p class=\"paywall-full-content\">And again, it is a wood lawn-sized mine, but predominantly copper. And we'll try and as we sort of - we're moving drill rigs out of the bottom of the mine, that will give us more ventilation down there for production. We've got a 12-year reserve life at the bottom of the mine anyway, but we want to pull those rigs up and put them up in the top part of the mine in that Merrin Mine so that we can start drilling that material out and getting it into reserve so that we can actually start talking about it in a bit more of sort of S-K 1300 type manner.</p> <p class=\"paywall-full-content\">So overall, look, I think our employees have done a pretty good job. We obviously had a really strong December quarter, and then we had a bit of catch-up work that we had to do during January and into February. But it is pleasing to sort of see turnover has stabilized. We've seen, I think, March was probably if not the lowest, certainly one of the lowest turnover months we've had since we've owned the mine. And again, the safety has improved sort of quite markedly.</p> <p class=\"paywall-full-content\">So with that, I'm going to hand it over for questions, and happy to take questions from anyone likes to ask some.</p> <p class=\"paywall-full-content\" id=\"question-answer-session\"><strong>Question-and-Answer Session</strong></p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">[Operator Instructions] Your first question comes from Daniel Morgan from Barrenjoey. Please go ahead.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Daniel Morgan</span></strong></p> <p class=\"paywall-full-content\">Hi, Mick, Morne, and team. Probably first question just for Morne. Can I just confirm that from a cash flow perspective, your production and sales are aligned? So I note that you sold officially 1,200 tonnes less copper than produced in the quarter, but you also got the $22 million payment from Glencore. Is my interpretation correct? Basically, from a cash perspective, your production equals sales.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes. I mean, that's typically how we try to run it on a quarterly basis. It's difficult to make all the shipments sort of work out exactly in terms of the quarterly reporting. So in terms of the sales versus production, so if you look at what we presold, just over 1,500 tonnes, if you add that to the sales volume, you sort of get to the production volume. So that's what I sort of try to do on a quarterly basis, is to try and match the cash with the production, just to have that sort of consistency in terms of every quarter sort of matching up. So that's the aim.</p> <p class=\"paywall-full-content\">We can't recognize it as sales. I kind of add it to the sales figure, or the sales revenue, and I can't add it to the free cash flow from operations. But until it's loaded onto the ship, that I can add the cash to it. So I do that - we do that just to smooth out and make sure that we report to the market, I suppose, cash that reflects the production, because obviously, we've sent the cost into that production already. So, that's the aim really.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Daniel Morgan</span></strong></p> <p class=\"paywall-full-content\">No, that's clear. And Mick, maybe going to Merrin. I think you indicate expectations of first ore at the end of 2025, Q4-ish. Will you get any development ore as you go is there any potential to pull a stope, or is it barren? I guess you've found stuff as you've been developing across</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes. Well, actually, that massive sulfide sitting in that cutty right there, look, the short answer is we'll be able to pull development ore out. We actually already have, I don't know, dozen truckloads or half a dozen truckloads of fairly high-grade zinc-lead mineralization sitting on the surface that we mine through as part of the development. So yes, look, we're obviously going to be opportunistic and take it as quick as we can. Right now, Polymetals isn't running, so that stuff sitting on the surface. But if we see copper mineralization that is worthwhile taking, we'll obviously get that and we'll put it through the plant.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Daniel Morgan</span></strong></p> <p class=\"paywall-full-content\">And so I appreciate that the Merrin is still an evolving saying, uncertainty and hard numbers, et cetera, are difficult to talk to at the moment. But what tonnage would you see as a success based on where you're sitting now for 2026, for example, I'm talking ore, ore tonnage, and where would it come from? I mean, you identified a few different areas of mineralization, which have, I guess, different outcomes with grade and economics?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes, actually, maybe that plan that's on that slide there would be good. So QTS South Upper, I think if we do somewhere - look, I'm hoping we can mine it a bit narrower than what the current plan is, but somewhere like 150,000 tonnes at 5%, 6% copper out of that. Maybe a little bit out of Pink Panther as well. It's lower grade and then something like 150,000 tonnes, call it 9% zinc to truck up the road to Polymetals.</p> <p class=\"paywall-full-content\">And I would think the sort of what we call the medium-grade copper, that stuff that's about 2.5% that's actually bit more bulk tonnage. Just not quite sure how much of that will get out next year, but I don't know, about 100,000, maybe 150,000 tonnes of that at 2.5, something like that.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Daniel Morgan</span></strong></p> <p class=\"paywall-full-content\">And just for clarity, these numbers you're providing are these run rate numbers, or is that what you would cumulatively success would be for 2026 in --</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes. Look, run rate is higher than that, but we won't be - because we're getting into it at the end - towards the end of this year, we won't be at full run rate on average for next year. But yes, that sort of number, I think we should be able to get out.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Daniel Morgan</span></strong></p> <p class=\"paywall-full-content\">Okay. Thank you very much. I'll let others ask questions.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes. But again, you can see why we're pretty excited about this because it has the potential to add meaningful production to us and we've got estimates of what our mining cost will be, but we can look at what our cost per meter of development is and it is one-third of what we're currently paying at the bottom of the mine, right.</p> <p class=\"paywall-full-content\">So 2.5%, our medium grade stuff at only 2.5% copper whilst not quite as exciting as 4% at the bottom of the mine, the cost per tonne for that is very low and it's only going to cover your variable-cost, right, like it doesn't cost us any more overhead or through the plant or overhead through G&amp;A, it's the same stuff, same costs.</p> <p class=\"paywall-full-content\">So yes, we think we can make quite a lot of money. So the other advantage of this Merrin Mine is obviously, we've spoken about it at length. The CSA Mine has these very high-grade stoping areas that, when you're in them, it's fantastic; when you're not in them, it's less fantastic. We can produce anywhere from 2,000 tonne of copper in a month to 5,500 tonnes of copper in a month. And whilst we can see the stoping profile and we're comfortable on an annual basis, clearly, the market likes to see less volatility on a quarter-by-quarter basis, right?</p> <p class=\"paywall-full-content\">So one, we think we can make a lot of money out of this Merrin Mine. So that's a great idea. Fantastic return for the capital deployed. But secondly, we think it has the ability to allow us to smooth that production profile out and derisk the operation because it's coming out of different part of the mine, different means of getting out as well. So to me, that's actually a big advantage of this thing is it allows me to engineer out that inherent volatility that the CSA Mine, like the current CSA Mine has, right? So two advantages. I always like to make money out of things, but the second one is smoothing that volatility up is really important.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Daniel Morgan</span></strong></p> <p class=\"paywall-full-content\">Sorry, Mick, to come back. Just on the fixed price leverage - fixed-cost leverage, sorry, in the business. Is it fair to say that the mine is about breakeven at maybe 35,000 tonnes per annum of copper production, and then after that, that's your margin. Is that a fair way of looking at it?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">I think it will be a lower number than that. Morne would be able to work it out for you. But I have done the exercise a while back. I would think it's high 20s, 30, yes. Probably the number.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Daniel Morgan</span></strong></p> <p class=\"paywall-full-content\">Thank you so much. I'll pass it on.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Thanks.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">Thank you. Your next question comes from Ben Wood from Wilsons Advisory. Please go ahead.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Ben Wood</span></strong></p> <p class=\"paywall-full-content\">Hi, Mick and Morne. Positive to see you guys that the strong volumes coming through in March led to those meaningful cost reductions, I mean, that we were sort of baking into our forecast. My question sort of previous copper production guidance for calendar year '26 was sitting between 48 and 53 kilotonnes. But I noticed in this release that you referenced a further down that there's a pathway to greater than 50 kilotonnes of copper equivalent production. And just sort of wondering, should we interpret this as perhaps a more conservative outlook in '26 for copper, but perhaps signaling a greater emphasis of zinc, or how should we sort of yes, interpret that?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Well, not a real change to be honest with you. I think, yes, we've obviously, if we are - when we put that guidance out originally, we weren't planning on mining any zinc. Now we are planning on mining some zinc. We've obviously got the agreement in place with Polymetal. So we've got an outlet for it. I think with between - with what we see in this Merrin Mine, we're feeling pretty comfortable on the - there's upside risk in that forecast. But it's a bit of an evolving thing, this Merrin Mine, right. Like, I think I'd rather get to the end of this year, and then I can upgrade next year. If that makes sense.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Ben Wood</span></strong></p> <p class=\"paywall-full-content\">Yes. No worries.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">So, I'll develop the mine by that stage, right. Then I'll have a much better idea.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Ben Wood</span></strong></p> <p class=\"paywall-full-content\">Excellent. So, just a second one as well, if I can. And previous sort of estimates for the vent project sitting at about $40 million there's sort of been $8 million spent on growth CapEx in the last two quarters, sort of implying about $34 million, $35 million left for the Vent project. Is that still on track?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes, although I think it's AUD42 versus $8.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Ben Wood</span></strong></p> <p class=\"paywall-full-content\">Yes.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">So, yes, that's right.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Ben Wood</span></strong></p> <p class=\"paywall-full-content\">Are those numbers still sort of hold?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes. Look, again, I think we may not have it in the deck. I think it's in the word version of the quarterly. The cost - as we're doing more meters, the - Morne you may have the exact number, but I think we saw a reduction in the cost per meter of development come down a bit as we did more meters. But yes, no…</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Ben Wood</span></strong></p> <p class=\"paywall-full-content\">No, that's down to about $11,000 a meter from 12.5.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes. No, that's about - yes. So, look the bigger components obviously is when you start - we got to do a bit more development, but we - there's some - somewhat sizable vent fans that have got to be bought. So they're from memory of don't hold me to it, but off the top of my head, there'd be $4 million or $5 million between those two there as like a one-off lump. And then there's rise a boring work, which is the other sort of big component, right.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Ben Wood</span></strong></p> <p class=\"paywall-full-content\">All right. Thanks, team, I'll hand it on.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">Thank you. Your next question comes from David Radclyffe from Global Mining Research. Please go ahead.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">David Radclyffe</span></strong></p> <p class=\"paywall-full-content\">Hi, good morning, Mick and Morne. My question is just coming back to that profile again, and maybe just thinking about the shaft production for the year, because it looks like you've got an average sort of north of 3,000 tonnes per day or hoisted. And the mine hasn't done that for a while. So, maybe could you talk to just that the outlook for this year and give us some more color on how that profile looks? And maybe is there some more great upside there that gives you confidence in hitting your targets? Thanks.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes, that's right. So again, look, we've been very clear that sort of when we bought the mine, let's dilution control and mining practices weren't best-in-class, I think is probably the best way to put it. So the guidance for this year that we had for grade was, I think it's on the front slide there, but it was 3.8 to 4, and obviously, we're running at 4.1, yes, throughout to 4.</p> <p class=\"paywall-full-content\">So we are sort of seeing a little bit better grade. So I've always rather haul less dirt for the same metal. So what's likely to happen is round about that sort of 4%, maybe 4.1% for the year, and haul a little bit less, that's probably what - where it looks like it's coming out.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">David Radclyffe</span></strong></p> <p class=\"paywall-full-content\">Okay. That makes sense. And thanks for that. I'll pass it on.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">[Operator Instructions] Your next question comes from Tim Hoff from Canaccord. Please go ahead.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Timothy Hoff</span></strong></p> <p class=\"paywall-full-content\">Sorry, guys. I was muted there. I was just wondering around the off-take terms that you've got for any zinc production that might have been produced through the tolling arrangement. Does that go through Glencore's current arrangement?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">No, not at this stage. So it is a tolling agreement, so as opposed to an all-sale. So we will get con back to deal. We have not at this stage signed off-take. And I've spoken about the copper market in terms of - it's incredibly tight for copper con. Actually, it's really tight for zinc con as well. I must admit I haven't had a look for a few weeks, but zinc con on spot will be, if not below zero, pretty close to zero.</p> <p class=\"paywall-full-content\">And so we - our immediate focus has been to charge on out to get the high-grade copper out there. Quite frankly, there's high-grade zinc we could take in a very short space of time even quicker than the copper, but we have to wait for Polymetals to be up and running right. And let them get up and running and not try and force them, get them up and running, but that I just - we have a draft of the off-take. We'll be signing something new in the not-too-distant future.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Timothy Hoff</span></strong></p> <p class=\"paywall-full-content\">Okay. Fantastic. Just to clarify that the copper is also separate to the CSA off-takes.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Sorry, which copper?</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Timothy Hoff</span></strong></p> <p class=\"paywall-full-content\">So the copper - any copper you might produce through polymetallic or going to poly?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">Yes, that's right. Yes. Well, if we're sending copper or up to Polymetals, we won't recover the copper because it their circuits are zinc-lead circuit. So, that's why we've chosen the zinc-lead ore up there, anything that's got copper in it, that's going to run through our plant.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Timothy Hoff</span></strong></p> <p class=\"paywall-full-content\">Right, Roger. I think that was it for me. Thank you.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">Thank you. Your next question comes from Eric Winmill from Scotiabank. Please go ahead.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Eric Winmill</span></strong></p> <p class=\"paywall-full-content\">Great. Thanks very much, Mick and team for taking my question. Sorry if I missed it earlier, the line was cutting out a bit. But just on tariffs, I mean, are you seeing any issues in the supply chain, or anticipating any major impacts in terms of cost or availability of consumables, things like that?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Mick McMullen</span></strong></p> <p class=\"paywall-full-content\">It doesn't seem to be an issue for us right now. Obviously, look, it's a very unstable world. I think Morne and our General Counsel did an amazing job getting our refinancing done notwithstanding the ups and downs in the market and everything, I sleep much easier knowing that we have all that liquidity and no near-term principal repayments to weather any storms.</p> <p class=\"paywall-full-content\">I think that's more what we're going to see. We haven't seen any like consumable or critical spare issues at this stage, we can't rule them out. It's probably more of a - just a what I would call a general market uncertainty, right, that's been more of an issue for us. But as I say, I do sleep much easier having that refinance done.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Eric Winmill</span></strong></p> <p class=\"paywall-full-content\">Okay. Fantastic. No, I appreciate that. Thanks very much. I'll hop back in the queue. Cheers.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">Thank you. There are no further questions at this time. I'll now hand back to Mr. Mick McMullen for closing remarks.</p> <p class=\"paywall-full-content\"><strong>Mick McMullen</strong></p> <p class=\"paywall-full-content\">Look, I appreciate everyone. I know it's a really busy reporting period in Australia. Look, I think clearly we - if you ask me at the end of last quarter, which was our strongest quarter, what would I want, more copper is always the answer. Clearly, in Q1, more copper is the answer. I'll say the same thing at the end of Q2, just given the leverage we have to our fixed costs. But I think things that we've got a really good runway ahead of us now for 2025 and into '26.</p> <p class=\"paywall-full-content\">The major projects are all being executed. And look, the more we get into this Merrin Mine, the more we really think that thing has got the ability to really move the needle for shareholders and capital on that, it's - if you can see our growth CapEx for this year, in total, that Merrin Mine circa AUD25 million for that kind of production, it's a no-brainer for us to do it, right. And so, we're very excited about it and - but obviously not taking an eye off the ball with our Capital Vent Project. You can see those development meters, and that really starting to pick up.</p> <p class=\"paywall-full-content\">So thanks, everyone, and we'll talk to you after Q2.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">And that does conclude our conference for today. Thank you for participating. You may now disconnect.</p>",
            "link": "https://seekingalpha.com/article/4779572-mac-copper-limited-mtal-q1-2025-earnings-call-transcript",
            "pub_date": "2025-04-30 16:37:12",
            "source": "seekingalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4779578",
            "title": "Perseus Mining Limited (PMNXF)Q3 2025 Earnings Call Transcript",
            "type": "transcript",
            "description": "<p>Perseus Mining Limited (<a href=\"https://seekingalpha.com/symbol/PMNXF#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link\" title=\"Perseus Mining Limited\">OTCPK:PMNXF</a>) Q3 2025 Earnings Conference Call April 29, 2025 7:00 PM ET</p> <p><strong>Company Participants</strong></p> <p>Nathan Ryan - Media Relations<br/> Jeff Quartermaine - Managing Director and Chief Executive Officer<br/> Lee-Anne de Bruin - Chief Financial Officer<br/> Jacob Ricciardone - Chief Development Officer</p> <p><strong>Conference Call Participants</strong></p> <p>Levi Spry - UBS<br/> Richard Knights - Barrenjoey</p> <p><strong>Nathan Ryan</strong></p> <p>Good morning and welcome to the Perseus Mining Investor Webinar and Conference Call. [Operator Instructions] I'll now hand over to Perseus Mining Managing Director and CEO, Jeff Quartermaine. Thank you, Jeff.</p> <p><strong>Jeff Quartermaine</strong></p> <p>Thanks very much, Nathan, and welcome to Perseus Mining's webinar to discuss our March '25 quarter report. I'm joined on the call today by two of my colleagues. Our CFO, Lee-Anne de Bruin, needs no introduction. She has been an integral part of our leadership team for quite some time and has frequently participated in these webinars. We are also joined today by Jacob Ricciardone. Jacob joined Perseus earlier this year in the role of Chief Development Officer with specific responsibility for exploration tech services and development. And Jacob will be available to respond to any detailed questions that you may have on either our organic growth projects, or similar matters later in the webinar. So welcome, Lee-Anne and Jacob.</p> <p>Now the agenda for today's webinar is the same as usual. I’ll start by providing an overview of what Perseus has achieved operationally during the quarter, and then we’ll hold a Q&amp;A session to dive into any specific matters that have not been addressed either during the presentation or indeed in the market releases that we have made to the market either on the quarterly or the release we put out last Monday that spoke to the decision to move forward with the Nyanzaga development.</p> <p>For those of you who<span class=\"paywall-full-content\"> are participating in this webinar via your computer, you should be able to track the presentation visually on your screen to get into that point. Now in summary, it seems that every quarter we report almost the same thing, namely that our team at Perseus has once again delivered very strong gold production results, competitive all-in-site costs, and with the help of the rising gold prices, expanded cash margins, and increased free cash flow and cash balances.</span></p> <p class=\"paywall-full-content\">Now in terms of the Australian gold sector at least and possibly globally, our performance in closing cash balance, which I might say stands at US$801 million or for our Australian business, AUS$1.25 billion. It’s better than most in the gold sector based on the reports that we've seen from our peers so far this month.</p> <p class=\"paywall-full-content\">Now this does beg the question of why our consistently strong operating performance doesn't translate very accurately into relative share price performance. This is an issue that's challenged us for some time, and several theories have been put forward about why we traded a discount to our peers. And these include the African discount, so to speak, and the quality of Perseus assets and portfolio, particularly the remaining lives of our assets. Now I won't dwell on these observations too much as, in my opinion, both of them are fairly fundamentally flawed. But rather than complain about the misunderstanding.</p> <p class=\"paywall-full-content\">What we have done this quarter is taken some very decisive action to address both the issue of asset quality and African risk. The two major growth initiatives, both fully funded from existing cash reserves, I might say, have been materially advanced during the quarter or since our last webinar, and they include the CMA Underground development at our existing Yaouré Gold Mine in Côte d’Ivoire, and, of course, the commencement of the development of the Nyanzaga project in Tanzania.</p> <p class=\"paywall-full-content\">Now both of these initiatives will be a subject of more focused discussion in the presentation that follows, as both of these projects will materially upgrade our existing production base that has, I repeat, already been generating outstanding operating results consistently for the last 5 or 6 years.</p> <p class=\"paywall-full-content\">Now, hopefully, the quality of these new two new additions will gain some recognition. And, of course, if they don't, the new operations will certainly help us to continue the long stream of outstanding results generated by the company. So in summary, things are rolling along very nicely at Perseus, and let’s go to the presentation so that I can demonstrate what I’m talking about.</p> <p class=\"paywall-full-content\">So if we look at the operating and financial results in summary that we've published today. So for the quarter, production 121,605 ounces, down slightly from the prior quarter, which was in fact an outstanding quarter. The all-in-site cost across the Group is $1,209 an ounce, up slightly for two reasons. One is that the production is down slightly, but also because of the increase in royalty payments due to the higher gold prices that we’ve been receiving. The gold prices averaged $2,462 an ounce, giving us a margin of US$1,253 an ounce.</p> <p class=\"paywall-full-content\">Now on -- in terms of the margin, I did read in the papers earlier this week, a very prominent United Kingdom investor complaining that the gold sector hadn’t taken the opportunity to generate margins. Well, I would point out that our cash margin is in excess of a 100%, and that's generated something like a $152 million of notional cash flow for the quarter, resulting in a cash and bullion balance at the end of the quarter of US$801 million.</p> <p class=\"paywall-full-content\">Now I point out that that US$801 million does include 34,208 ounces that of gold that were valued at the spot price on the March 31, which is $3,115. So down from where it is today, in fact. But, nevertheless that's how that number has been arrived. I should say also it does not include any debt. We don’t have any debt even though we do have an undrawn line of credit of US$300 million.</p> <p class=\"paywall-full-content\">Now if you look at that in context with what we've done in the past, as I said, the December was up slightly, but in the last four quarters, there’s been a fairly remarkable consistency in our performance. And during that time, we've seen the gold price rise, and we've seen the cost kept reasonably steady. All three operations are running reasonably well, although I have to say, not without the challenges as I'll mention in just a moment. But certainly in this rising gold price environment, it is giving us the opportunity to significantly generate or expand our margins and cash, et cetera, et cetera.</p> <p class=\"paywall-full-content\">Now looking forward, we are now 1-month pretty much through the 3 months of the quarter. Happy to say that we are operating bang on targets at the moment and we will continue to deliver certainly good results into the future if indeed nothing untoward happens in the next couple of months.</p> <p class=\"paywall-full-content\">Now in terms of what is -- what we are predicting, this chart that you can see shows the guidance that we have given to the market. Now we are obviously very well positioned relative to the forecast for the half year and the full financial year. I think if anything, what we are going to be doing is provided that nothing untoward happens between now and the end of June, we will end up in the upper quartile of the production range that we've given the market. And at this stage, we are quite some way below the bottom end of the cost range. So, that's a pleasing outcome. And that, of course, has occurred notwithstanding the higher royalties, et cetera, that I mentioned before.</p> <p class=\"paywall-full-content\">Now if you look at where the productions come from, I'll just quickly run through the three operations. So Yaouré was the standout again as it has been for some time, 57% of our total production. So it's the main contributor. The cost this quarter were down a bit on where they have been, and we've been the beneficiary this quarter of the fact that we did have accelerated stripping in the last couple of quarters.</p> <p class=\"paywall-full-content\">Now recall I mentioned on this presentation for the last couple of quarters that we were -- we did get behind in our stripping, and we had accelerated stripping in the last couple of quarters to get back on track. We are back on track, and we are now accessing high grade material. And so that's been what has caused this pretty good cost performance in the last quarter.</p> <p class=\"paywall-full-content\">The issue that is challenging us at the moment, if anything, at Yaouré is the fact that we've moved from or we've just opened up the Yaouré open pit. We've been mining in the CMA Open Pit up until now. So the geology in the Yaouré Pit is quite complicated, and our grade control procedures need to be modified to adjust to the new ore body. And at this stage of the game, we haven’t quite got it right. We’ve got a positive reconciliation in tonnes and negative reconciliation on grade, but overall positive on ounces.</p> <p class=\"paywall-full-content\">But that's something that we are working on pretty furiously at the moment to get that right because that is important for us going forward because ore from that Yaouré Open Pit is going to be blended with ore from the CMA Underground, and I'll talk about this in just a moment, but we signed off on that operation earlier this quarter.</p> <p class=\"paywall-full-content\">Now as far as Edikan is concerned, it was a little bit disappointing relative to the prior quarter. About 34%, 35% of our gold comes from Edikan. Right across the board, the metrics were slightly under where we had hoped they would be. But, nevertheless, the costs were still fairly good. I mean, US$1,177 per ounce at Edikan is right in the bottom end of the global cost curve. And I think full credit to the team that we've been able to keep a lid on our costs at Edikan going for over the last few years.</p> <p class=\"paywall-full-content\">Reconciliation there is very good, or is within market ranges, et cetera, et cetera, so we are not too concerned there. We have started mining in the Nkosuo Pit, which is a new pit that was discovered a few years ago by our team. Now this ramp up and this is partly what's attributed to the performance this quarter. Our ramp up has been a bit slower than we were hoping for as a result of some land access issues in the area. These are gradually being addressed. And not before time, I might add, given that the AG and Fetish pits are getting towards the end of their life. So we will be mining from Nkosuo in the next quarter in full steam ahead. And, hopefully, by then, we’ll have things sorted out.</p> <p class=\"paywall-full-content\">Now one of the points I might just make on Edikan while we are talking about, which I think is important in the context of geopolitics is that our mining licenses at -- in Ghana have been renewed. They've been signed off by the minister, and will be presented to parliament, I believe, as part of a batch in May this year to get a parliamentary ratification.</p> <p class=\"paywall-full-content\">So, some of the issues that have been reported in Ghana recently, I can say that most certainly don't apply to Perseus as far as our standing in the country, we are in good standing. And we have the opportunity to extend the mine life at Edikan mine. So we've been doing quite a lot of work on strategic options, and we’ll publish this data later on in the year. But, certainly, we believe that there is a an extended life at Edikan looking forward.</p> <p class=\"paywall-full-content\">Sissingué. Sissingué has been a little bit disappointing this period as well, and there are once again fairly solid reasons for that. All of them, the metrics have been reasonably okay other than grade, and the grade is down as a result of not accessing the higher grade material at Fimbiasso in the way that we are wanting to do. Part of that, a large part of that relates to our contractors' performance, equipment availability and productivity. We have addressed those issues by bringing in some additional equipment ourselves and hiring it back to them, And we will overcome this issue as we move forward. But, certainly, the performance this quarter was not where we would like it to be.</p> <p class=\"paywall-full-content\">Once again, similar sort of thing. We are getting good reconciliations across the across the site. And I think that the life of Sissingué, it can be extended quite materially through these strategic options that we've been evaluating, and we will, as I say, communicate those when all of that work has been completed. So the production is in reasonably good shape.</p> <p class=\"paywall-full-content\">I'm now going to hand to Lee-Anne to address some of the financial metrics. Please, Lee-Anne.</p> <p class=\"paywall-full-content\"><strong>Lee-Anne de Bruin</strong></p> <p class=\"paywall-full-content\">Thanks, Jeff, and hello, everybody. Good to be on the call. You'll see from the slide in front of you that our cash flow and our overall balance has grown significantly since the last time we reported, which was $704 million. It’s now sitting in $801 million including bullion. We have zero debt and but still have our undrawn credit line of US$300 million. We continue to make contributions up to our host countries, contributing this quarter $22 million in tax.</p> <p class=\"paywall-full-content\">The capital expenditure for the period of $17 million points out that does include $11.4 million relating to the Nyanzaga pre-FID expenditure. And we also in the period contributed $10 million into the share buyback, which I will talk a little bit to a little bit later.</p> <p class=\"paywall-full-content\">If we move on to the reconciliation of our all-in-site costs to our all-in-sustaining costs, reminding the listeners that Perseus has for many years reported an all-in-site cost number, which is a pure cash number and doesn't necessarily agree with the IFRS all-in-sustaining cost. And so we've put the slide in just to explain those differences so everybody is aware.</p> <p class=\"paywall-full-content\">You’ll see that we have got a reconciliation because we use produced versus sold. In the period, we had inventory movements because Edikan was building up stockpiles. And then the corporate admin costs, which is included in the all-in-sustaining cost, is not included in the all-in-site cost number.</p> <p class=\"paywall-full-content\">Moving on to the hedging position and strategy, we have always continued to focus on downside price protection to ensure the certainty of our cash flows, particularly now that we have committed to the Nyanzaga project over the next 2 years. However, giving consideration to the robust gold environment in which we are operating, we have revised strategy from using spot deferreds and forward contracts to a Zero Cost Collar approach. And this does -- this provides us downside projection, but does allow us for upside participation. And what we’ve set out here, which I won't go into too much detail, just sets out so you can see what our hedge book looks like going forward over the next 4 years or 3 and a bit years, should I say, and how the introduction of this new strategy is giving us that upside participation.</p> <p class=\"paywall-full-content\">The next is the share buyback. This is our position as of the 9th of April, when we enter the blackout period. And so, we’ve executed at that period 32.78% of the buyback, which was about $32.74 million. With the release of the Nyanzaga FID and the quarterly this morning, we will likely commence participation in the share buyback again.</p> <p class=\"paywall-full-content\">And that's all for me from the financial side, Jeff.</p> <p class=\"paywall-full-content\"><strong>Jeff Quartermaine</strong></p> <p class=\"paywall-full-content\">Okay. Thanks, Lee-Anne. Yes, the share buyback has been pretty interesting, I have to say, and I think it has actually materially benefited our shareholders the way we’ve implemented it over the last few months being able to support the market when there were unusual things going on and providing some real support at times when it was needed.</p> <p class=\"paywall-full-content\">I'd like to now talk about the organic growth piece. As I said, this is pretty important piece of our business and something we've given a lot of attention to in the last couple of quarters. The CMA Underground development was the first of the -- first cab off the rank, and that was we announced the FID decision, the financial final investment decision in late January. This is a an underground operation off the side of the existing CMA pit. Things are moving along very nicely on in preparation for cutting the first portals in July of this year. We've appointed Byrnecut as our contractor. They’ve mobilized on the site, and preparations are well and truly underway.</p> <p class=\"paywall-full-content\">And we’ve have gone ahead with the decision based on a -- an in principle approval by the Ministry of Field Mines, Petroleum and Energy in Cote d’Ivoire. We believe that this Ministerial Decree will be issued in the next week or so as all of the prerequisites for the issuing of the document have now been completed. So we are in very good shape as far as the project is concerned.</p> <p class=\"paywall-full-content\">Now if we look at the schedule, as I said, the Byrnecut busily on the site working in getting things organized. Equipment has been shipped and has been arriving on the site, and we are getting ready to get into the portal firings on the 1st of July. So we are well and truly on track for that. Quite a deal of work has been done to locate the various portals and the like. And some of those areas have been exposed, some of them will come into the -- in the future, but we are getting very much on the front foot as far as being able to move into that exercise on the schedule that we've set out.</p> <p class=\"paywall-full-content\">I've got a couple of photographs on the slide on the screen just showing a few of the site works that have been underway. We've had to, obviously expand our accommodation and an office capacity to be able to fit another large contractor and hit workforce in. We’ve also had to upgrade a few of the services, water power, et cetera, et cetera, to make sure that the underground operation will be fully serviced when we get going. So all of those things are moving forward very strongly, and we are in a very good place, I believe. We've been recruiting quite heavily over time, bringing in some very high caliber people in the underground mining space, which, as people know, is new to the Perseus business.</p> <p class=\"paywall-full-content\">Now the other very important project that we’ve initiated since the last webinar has been the Nyanzaga gold project in Tanzania. We took a -- an affirmative final investment decision earlier this week, and we announced to the market the position. So we are moving ahead with that project. Our budget for the exercise going forward is around $523 million, including contingencies, pre-production costs, et cetera, et cetera. So, it's pretty much in line with what we were expecting it would be as we were sort of doing the work over the last 12 months.</p> <p class=\"paywall-full-content\">The important thing to note on this is that the funding of this project is coming via noninterest bearing loans from Perseus to the operating company and relying on our existing cash balance of US$801 million. So we need no external financing to go forward with the project. We -- all the money is in place, and that gives us a lot of flexibility in terms of moving forward.</p> <p class=\"paywall-full-content\">One thing I would say is that we've had some very, very constructive engagement with the government of Tanzania over the last 12 months, clarifying terms on the existing framework agreement and the shareholders’ agreement. And I would say, well done indeed, call out Lee-Anne and her team who have been leading the charge on that, done a terrific job in being able to establish really strong relationships with the government and convert that into meaningful documentation that will govern the project going forward.</p> <p class=\"paywall-full-content\">And just so -- so slides to show you what we are talking about. So the -- Tanzania is on the Eastern side of the African continent, and the project, the Nyanzaga project sits on the southern shores of Lake Victoria. It’s in an area where there’s been quite a lot of mining in the past, particularly Barrick [ph] have been active in their North [indiscernible] et cetera. So these are names, bullion -- these are names that are well known, Golden Prides, and other ones, [indiscernible]. These are names that are very well known to the industry.</p> <p class=\"paywall-full-content\">So there is a long history of mining in the country, and the Nyanzaga project will be the first new project for about 17 odd years in Tanzania. So it’s very exciting for everybody. The site is reasonably compact. It's -- we've got allocations made for waste dumps and tailings dams, et cetera. It is relatively adjacent to Lake Victoria. So, environmental management is a very, very important piece of what we are doing going forward.</p> <p class=\"paywall-full-content\">Now the way we are developing this project is different to the previous owners who were envisaging a small open pit at the top and using that the proceeds from that pit to fund a drive down on higher grade material at depth and having an underground operation. What we are doing is we are going to do a single large open pit initially, and then we’ll see where we go to from there. So it’ll -- this open pit will be developed in a couple of stages. You can see on the slide the white and the blue lines being the various stages that we will embark on, and that orange line is the outline of the pit that we’ve approved. Now this is what we’re calling the first phase of the this particular project.</p> <p class=\"paywall-full-content\">The difference between the orange line and the pink line are inferred resources. And we what we will be doing, the inferred resources into these areas here, what we will be doing over time is drilling those out, converting them into indicated or measured, and putting them into the mine plan. And, ultimately, we would expect end up with a pit that some something aligned to that pink line, which will have a very much expanded ore or mineral resource and ore reserve reporting.</p> <p class=\"paywall-full-content\">The -- what we’ve done with the processing facility, it’s a larger processing facility than was previously envisaged. This is a 5 million ton nameplate plant designed by our contractors Lycopodium who we’ve worked with in the past on several of our -- of all of our, actually, operations. And, of course, Lycopodium is very well known in Africa having built just about every decent plant in the last 15, 20 years, I would think. This plant is fairly standard. There's nothing fancy in the process flow sheet. So you got SAG Mill, Ball Mill, thick in a CIL, et cetera, et cetera, and then Electrowinning. So nothing terribly fancy around this, and we believe if anything, the mine the plant will operate above nameplate as tends to be the case with these local plants.</p> <p class=\"paywall-full-content\">The metrics that are related to the project, I guess, the important metric is that we believe that the reserve that we are working for -- to at this particular point in time is about 2.3 million ounces, which is recently close to the previously announced reserve, which from which we will extract about 2 million ounces of gold. The production will average around 200,000 ounces over the 11-year life. I mean, it peaks out at about 2.46 at one particular point. But very importantly, the all-in-site cost, it runs at around $1,200 an ounce. And that cost is -- has been very carefully benchmarked not only against other operations in Tanzania, but also what we’ve actually done elsewhere on the continent.</p> <p class=\"paywall-full-content\">From an investment point of view, we have used a $1,700 pit shell for the design of the mine that use a $2,100 per ounce long-term gold price in calculating our metrics. And as you can see from the slide, the undiscounted cash flows, both pre-tax and post-tax at $2,100 are pretty interesting, but at $2,700, they’re even more interesting. And, certainly, we believe that this will be a project that will generate very, very substantial benefits for all of our stakeholders as we go forward.</p> <p class=\"paywall-full-content\">The production forecasts, as you can see from the slides on, as I said, averaging around the 200,000 ounce mark over the life of the project as it's currently known, but it does peak out at various times quite a bit higher than that. So it's a pretty steady production profile and one that will add materially to our overall Group profile going forward. So looking forward, we’re very confident in our ability to deliver the project as planned. I mean, Perseus, as you are aware, has successfully developed and is now operating three gold mines on the African Continent, Edikan, Sissingué, and Yaouré, and doing that fairly successfully.</p> <p class=\"paywall-full-content\">Now what very importantly, many of the contractors and the employees who were engaged on the [indiscernible] bill, for instance, and delivered that one ahead of schedule and under budget during the COVID crisis, they’ll also be working on Nyanzaga. So we’ve managed to bring most of the team back together, and we think that that’ll deliver some significant benefits.</p> <p class=\"paywall-full-content\">Now the other good thing about this project is it’s -- there’s very significant in country capacity in terms of skilled and unskilled labor and also industrial capacity. Not only that, we’ve got very strong support from our host communities and very importantly, the host government. So all of the ingredients that are needed there are there for the project to go ahead and perform very strongly in its current configuration.</p> <p class=\"paywall-full-content\">Now I’ve mentioned a couple of times term Phase 1. We do believe that there will be a second phase to this project. We are already embarked on a second phase of resource definition drilling, which we believe will add materially to the mineral resource and the reserve, and that will be announced in due course when all of the data comes in. It's not only resource definition drilling, might add, but we are also doing metallurgical and geotechnical drilling to further inform the design of the pits and the like. And I think there are some real opportunities potentially coming from this work to perhaps improve the cost structure going forward.</p> <p class=\"paywall-full-content\">Now in terms of the schedule, we've done quite a lot of work already in terms of awarding various packages and getting underway and some early works, et cetera, et cetera, and building how relocation housing. So that's going along fairly strongly, and we will be moving into full scale development works as very, very soon. In fact, we are doing it right now, and we’ll be looking to be producing first gold in the first quarter of 2027. In fact, I think I’d be very surprised if it’s not a tad earlier than that given that everybody is incentivized to deliver that outcome, but we’ll stick with the Q1 '27 for the time being.</p> <p class=\"paywall-full-content\">And just a couple of photographs to show you what has been happening on the site, and you can see visually that there has been a good deal of preliminary bulk earthworks underway both in terms of preparing for the main camp and the process plant. We’ve got the site pretty well lined demarked with fence line, et cetera, et cetera, and things are moving along pretty nicely on that front. The relocation housing has been an important piece of what we are doing.</p> <p class=\"paywall-full-content\">We've got -- we are building approximately 260 odd houses, I think it is, for people who will be impacted by our operations. And so far, we are about 23.5% of the way through that program. We have delivered or we've completed 29 houses, and I think 26 of the 29 are currently occupied by very happy residents, I might say. So that program is moving along very nicely and is being very well received by our host communities.</p> <p class=\"paywall-full-content\">The community consultation piece, as I said, is extremely important here. We do want to make sure that the people are kept well informed along the way, and they know exactly what we’re doing. We also want to make sure that people have the opportunity to gain employment on the mine site and to benefit from commercial activities in the region. So our community teams do spend a lot of time out and about talking to the local communities, and I think that based on our prior experience, that will be beneficial as we go forward.</p> <p class=\"paywall-full-content\">Also, part of that, as I said, is educating people and bringing them through into the workforce, and we've already started that process of making sure that we recruit locally to the greatest extent possible and that people are taking up the learning curve as best we can get them because they will be making a significant contribution as we go forward.</p> <p class=\"paywall-full-content\">I’ve mentioned the second phase of resource definition drilling, which is underway. I mean, it’s a fairly healthy program that we've got in mind, and we do have some serious expectations about what that will yield. But I think the guys have got a pretty good eye on what the ore body looks like and the work that’s being done is high-quality. And as I said, the aim is to deliver an upgraded reserve before too much longer. So that’s pretty much it as far as growth is concerned.</p> <p class=\"paywall-full-content\">I haven’t mentioned, of course, the other initiatives that we have. I mean, we have The Meyas Sand Project in the Sudan that we are looking at various options there to try and see how we can best add value to our shareholders through that exercise. We’ve also got a few unlisted investments around the place. And I think, actually, the value of those unlisted -- of those listed investments is something like a US$111 million. So if you're looking at the liquidity of the company, you can add US$111 million to the US$801 million of cash in bullion, and that says the Perseus is in fairly good shape to fund its way going forward.</p> <p class=\"paywall-full-content\">Now I’ve a couple of times, particularly in relation to Nyanzaga the importance of the sustainability piece, the ESG pieces. And right across the company, that is something that is very important to us. So, safety is a primary focus, and the safety statistics that we are generating month in, month out, I think are very, very credible in any company, let alone on the African continent. In fact, they’re as good as you’ll see globally where we've got a TRIFR of 0.74, which is well down on a lot of our other peers.</p> <p class=\"paywall-full-content\">The community contribution, Lee-Anne mentioned that earlier on. We continue to put quite a strong economic contribution into all of the countries wherever we operate, Ghana, Côte d’Ivoire, Tanzania. Sudan, this is not -- this takes very several forms. I mean, clearly employment is one and taxation is another, and, of course, procuring from the local vendors is very important. But fairly significant amounts of money are going into the economies of those host countries, and we think that is important.</p> <p class=\"paywall-full-content\">Local employment is terribly important in terms of being able to give people opportunities. And we do our best in terms of diversity in all the forms that it takes. People like to focus on gender diversity more than some of the other forms. And in that respect, we do -- we have got about 15% female employees in the workforce.</p> <p class=\"paywall-full-content\">But I would hasten to mention that people should read that number in the context of the cultures that we are operating in. This is not Australia. This is -- these are African countries where they have a different approach to life. And so, quite understandably the proportion of female employees is down on what you might find in a Western environment.</p> <p class=\"paywall-full-content\">We had no significant community events during the period, and I think that reflects the work that we put into working with our host communities. And similarly, on an environmental front, we are in pretty good shape there as well with no significant environmental issues causing concern. So, look, right across the board, things are traveling quite well.</p> <p class=\"paywall-full-content\">As I said at the start of the call, we have had a good quarter on all fronts, and now we've been continuing to produce gold all-in-site costs cash flow, et cetera, et cetera. And as I said, look, pleasingly, this work has been done conducted in a safe manner. We are a little ahead of our safety -- targeted safety standards, and we do compare fairly well with our peer group. So that's extremely gratifying and important to us.</p> <p class=\"paywall-full-content\">Now looking forward, our production and cost guidance for the 6 months to June '25 is unchanged, as I said earlier, and we are predicting very solid performances relative to that half year and full year guidance that we've given. And looking further into the future, we are embarked on our current -- we are currently embarked on our annual planning cycle.</p> <p class=\"paywall-full-content\">And before long, we expect to be able to publish an up -- an updated long-term production and cost forecast for the entire Perseus Group based on these revised plans. And I’ve no doubt that what this will do is provide further clear evidence that our strategy of producing between 500,000 and 600,000 ounces of gold per year at a cash margin of no less, but usually a lot more than $500 an ounce will continue for some time into the future, and that’s irrespective of any other M&amp;A activity we’ll do into the future.</p> <p class=\"paywall-full-content\">Now I have been promising that Group forecast for some time, and we are in the process of putting it together. What we are trying to do is to ensure that we maximize value from our existing asset base before we go public, and we don't want to go prematurely. We want to be able to show our investing public what we are going to do and then be able to deliver on that plan, and that will be coming out fairly shortly.</p> <p class=\"paywall-full-content\">What we are also trying to do as part of that exercise is to smooth out our production profile going forward. And we are doing a fairly good job on that, I might say, given that when we took a decision to postpone the development of The Meyas Sand Project in 2023, it did cause a little bit of a hiccup as far as our production profile is concerned, but that's been largely addressed through Nyanzaga and the CMA Underground and the like. But there is more work to be done before we can go public. And so as soon as we can, as I say, we’ll release that information.</p> <p class=\"paywall-full-content\">Also, looking forward, the concept of us continuing to look to grow our diversified asset portfolio will remain very important for us, and we believe that we are able to -- by being involved in multiple operations in multiple countries, we are able to remove a lot of the volatility that comes with operating on the African continent. Importantly, this means that as an investor, you can be confident that your investment in Perseus remains in very solid and good hands. And this is an important point, I think, in terms of addressing this issue of African.</p> <p class=\"paywall-full-content\">Just staying on African discount on the share price, we do operate well on the African continent, and we have been doing it for quite a long time. Now it’s not a guarantee that that’s going to continue into the future, but it’s a pretty good indicator, I think, that this issue of African discount is somewhat overdone.</p> <p class=\"paywall-full-content\">We will, however, continue to remain very receptive to new ideas. And if the right value creation opportunities come along, then Perseus is in a great position to execute to continue on our growth journey. I might say these opportunities are fairly few and far between at the moment, but particularly given where the gold price is. But we do live in hope, and we do have the capacity to execute at a moment’s notice should the right opportunity come by.</p> <p class=\"paywall-full-content\">So as a company, our focus on generating material benefits for all of our stakeholders is remains probably very prominent for us. And I’m talking about host governments, communities, employees, providers of goods and services, and, of course, our investors. And we will remain very, very focused and vigilant on that and continue to deliver our stated mission of the company, and that’s something that we are very proud to have achieved today.</p> <p class=\"paywall-full-content\">Now in conclusion, I do once again want to acknowledge the fantastic contribution made by all of the men and women that make up the Perseus board management and operating teams in what is now five countries in which we operate where including Australia where we are headquartered. There is absolutely no doubt that as a team, our people strongly supported by their families, and I can’t emphasize the importance of the family support enough.</p> <p class=\"paywall-full-content\">We continue to do an outstanding job, and I want to sincerely thank you all. Many of you are listening into this call today, but I want to thank you all for that on behalf of all of our shareholders and for all of the efforts that you've been delivering and helping us to continue delivering on our promises. So thanks very much for your attention today.</p> <p class=\"paywall-full-content\">This brings my presentation to a close. And now Lee-Anne, Jacob, and I are happy to address any questions that you may have. Thank you.</p> <p class=\"paywall-full-content\" id=\"question-answer-session\"><strong>Question-and-Answer Session</strong></p> <p class=\"paywall-full-content\">A - <strong>Nathan Ryan</strong></p> <p class=\"paywall-full-content\">Thank you, Jeff. Just a reminder, if you would like to ask a question directly to the company, please use the raise hand function within Zoom. Your first question comes from Levi Spry at UBS. Please go ahead, Levi.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Levi Spry</span></strong></p> <p class=\"paywall-full-content\">Yes. Good morning. Thanks, Nathan. Thanks, Jeff, and team. Thanks for the call. Another nice -- very nice quarter. Couple of quick questions starting with Nyanzaga. So can you just comment on, I guess, the aims of the optimization? So, obviously, in [indiscernible] we are always pretty impatient, but some of the some of the assumptions are probably a little bit more conservative than what I’ve had previously. So can you just talk to that second phase, what the goals are with that reserve update? Is it about life extension and adding value that way, or can you squeeze a bit more grade up upfront early?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">Well, I think we are looking at expanding the reserve, full stop, at this particular time. Now whether we do expect that the grade will be beneficiary, but whether it -- is reflected immediately, I’m not a 100% sure. But what -- one of the optimizations or one of the areas where we may see some improved performance through there is in the actual throughput rates of the plants. Every plant that we've built in the past with the help of Lycopodium seems to outperform the nameplate.</p> <p class=\"paywall-full-content\">Now the nameplate of this one is 5 million ton per annum, but it wouldn't surprise me if we don’t we are not putting more material through than that actual name would suggest. But, certainly that's an issue that we -- where we believe we got some benefit. We believe that we can expand the size of the resource the open pittable resource quite significantly, and that’ll be, as I say, published within well, before we start actually producing.</p> <p class=\"paywall-full-content\">But the other area that is of interest to us, and I can’t say very much about this at this point other than to say that the guys brought back some pure [ph] results at depth the other day. And there’s not a lot of them, but what we saw of them certainly give us optimism that even though we are building a very large open pit, full 500 meter deep pit, there is still very significant potential for an underground operation off the bottom of that.</p> <p class=\"paywall-full-content\">As we go forward and as we get further down in the pit, we will be drilling further down there to confirm that, but that’s an extent -- possible extension that’s not even remotely factored into any numbers at this particular point. So, look, we believe that this the inside of the project can and will develop into a world class operation and have very little doubt about that.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Levi Spry</span></strong></p> <p class=\"paywall-full-content\">Yes. Good. Yes. Thank you. Thanks, Jeff. And then just moving to Sissingué, a bit of a tougher quarter there. Can you just talk to the future of that operation and any potential for maybe recycling that asset as you've got growth elsewhere in the portfolio?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Lee-Anne de Bruin</span></strong></p> <p class=\"paywall-full-content\">Yes. Look, the plan as it stands at the moment I mean, I think on the reserve, it’s something like about a 3-year life from now. But we believe that by reassessing some of those pits, we can actually extend the life well beyond that. Now what that involves, of course, is using a higher cutoff -- a higher gold price on the pitch shell. And, of course, what that means is that your operating cost goes up, so you need to be able to trade off production against margin, basically. And it does depend on your view on the gold price.</p> <p class=\"paywall-full-content\">Where we are going with the project now, though, is we are about to start opening up the Bagoé deposits. We’ve been mining at Fimbiasso and Sissingué in -- over the last couple of years, hauling ore from Fimbiasso back to Sissingué. We are now about to open up Bagoé, and we’ll be holding back from there later this year. And we will be mining down there in, I think there’s three pits down there at the present time that we have delineated. So, it's got a reasonable future. And in fact, the production levels come that are budgeted for next year are quite materially above where we are this year because the grade from Bagoé is quite attractive.</p> <p class=\"paywall-full-content\">Now what actually happened was that when we started mining at Fimbiasso, we discovered that, in fact, there was actually quite a lot more ore there than we had originally envisaged. Now what we decided to do was to mine out those deposits before we went to Bagoé. So we deferred opening Bagoé by about a year, basically, while we mined out Fimbiasso. Now while it’s all there, it is at a lower grade than Bagoé. So that's partly what contributed to the dip in production this year and the like as well as some operating challenges, of course, that I mentioned earlier.</p> <p class=\"paywall-full-content\">But, look, the Sissingué has got a pretty decent life ahead of it, pretty decent remaining resource. When we started this project, it had a 4.5-year mine life. Well, I think based on what we are talking about now, 9 years from start to finish is certainly not out of the order of possibility. And so, we will look at that in the context of our portfolio. If we bring in other assets that are producing a lot more in demand management time, then we may consider that this project might be better off in somebody’s hands. But we haven’t reached that decision point at this particular stage, but it has to be an option that we consider.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Levi Spry</span></strong></p> <p class=\"paywall-full-content\">Yes. Got it. Okay. Thank you. And just last one, sorry. Juggling [ph] on a few calls here, but did you mention any of the upcoming catalysts for reviewing your investment in Bankan and PDI?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">No. I didn’t, actually. But I think it's well-known that we've entered into a confidentiality agreement and a standstill agreement with Predictive. We can't make an investment decision until we've had full access to data and evaluated what the opportunity is worth. I would say, though, that if you look at Predictive and Bankan and compare it to, say, Nyanzaga, it's multiples more costly than what the Nyanzaga project has ever been. So, in the current environment, it looks pretty darn difficult, but you never know. The data may tell us a different story, but we don't have any plans for it at the present time. We are very comfortable to sit where we are and see what the future holds.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Levi Spry</span></strong></p> <p class=\"paywall-full-content\">Got it. Thank you. Appreciate your time. Thanks, Jeff.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">No problem.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Nathan Ryan</span></strong></p> <p class=\"paywall-full-content\">Thank you. Your next question comes from Richard Knights at Barrenjoey. Please go ahead, Richard.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">Hey, Richard. You’re on mute.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Richard Knights</span></strong></p> <p class=\"paywall-full-content\">Apologies. There we go. Hi, Jeff and Lee-Anne. How are you? Just one on grade reconciliation or the grade and tonnage reconciliation at CMA Open Pit. I'm just wondering how to think about that over the next 12 months. I mean, obviously, it's been positive by an order of magnitude over the last 12 months.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">CMA -- CMA Open Pit is fine. Where the challenge is in the Yaouré Pit, which is a new one.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Richard Knights</span></strong></p> <p class=\"paywall-full-content\">Right. Yes. Okay. And so what -- yes, go ahead.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">We've -- so the geology is really quite complicated. There are a number of structures there coming in at different angles and things like that. And just the grade control techniques that we've used aren't -- weren’t giving us as accurate a result as we are used to seeing. So we've had Jacob and his team have been working furiously on this to rectify the processes. And I think Jacob can make comment if need be on it, but we are making good progress and we expect to see improvements coming forward. So it is an important point because there is definitely mineralization, a lot of mineralization there, and we want to make sure that mineralization gets captured and put in the mill, not lower grade material.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Richard Knights</span></strong></p> <p class=\"paywall-full-content\">So what percentage of the feed over the next 12 months will come from that Yaouré Open Pit roughly?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">Look. Top of my head, I don’t have that number. But as we go forward, I did have those numbers actually. When we will be using the Yaouré Open Pit in combination with the CMA underground, I think I think something like 70% to 80% of the ore will come from the Yaouré Pit, but 50% of the grade will come from the CMA Underground. So it's something like that. I mean, those numbers are in the public domain, and I just can’t recall them exactly. But -- so getting Yaouré right is really important for us, and that's why we've put such a concentrated effort into addressing that reconciliation issue because it's not something that we are comfortable with. It's something that we have to fix in short order.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Richard Knights</span></strong></p> <p class=\"paywall-full-content\">No worries. Thanks. And just one more follow-up on Nyanzaga. I mean, you’ve talked about the Phase 2 potential there. Is that something we’re going to hear about in 2025, or is that sort of a longer term story?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">Well, look, I think it’ll take us all of '25 to do the drilling, I would say. And then some -- so it won’t be in this calendar year, I don’t expect, but next year, it will be coming through. So, look, it's just part of the ongoing process of what we do. We could've deferred development and drilled the whole thing out before we started, but we thought that taking what we've got for the time being made a lot of sense. It allowed us to get into production earlier to address the longer term production profile of the company, and that we'll backfill with additional reserves as and when they are delineated, assuming that they are, of course.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Richard Knights</span></strong></p> <p class=\"paywall-full-content\">No worries. Makes sense. Thanks. Thanks, guys.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jeff Quartermaine</span></strong></p> <p class=\"paywall-full-content\">No problem.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Nathan Ryan</span></strong></p> <p class=\"paywall-full-content\">So I will now hand back to Jeff Quartermaine for closing remarks.</p> <p class=\"paywall-full-content\"><strong>Jeff Quartermaine</strong></p> <p class=\"paywall-full-content\">Okay. Well, look. Thanks very much. I know we've taken a lot of time, and today is another busy day for many people, so apologies for that. But, look, we are very comfortable with the way we are tracking. I think we are generating some fairly significant benefits here for our stakeholders, returning money to shareholders both in the form of dividends and the share buyback, and we expect that that’ll continue into the future. So look forward to keeping you informed as we go forward. There’s lots on the horizon. We've had a very busy 3 months, but I think it's been a very productive 3 months, and long may that continue. So thank you very much, and look forward to talking to you again.</p>",
            "link": "https://seekingalpha.com/article/4779578-perseus-mining-limited-pmnxf-q3-2025-earnings-call-transcript",
            "pub_date": "2025-04-30 16:37:04",
            "source": "seekingalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}