{
    "data": [
        {
            "title": "Singapore’s growth engine sputters, analysts spot fatigue as global trade clouds gather",
            "description": "<div><p>SINGAPORE: As the Ministry of Trade and Industry (MTI) reduced its full-year 2025 GDP estimate to the range between 0% and 2%, alluding to “rising headwinds for global trade,” Singapore’s economic development is manifesting initial indications of weakness, analysts say.</p></div><div><p>According to the latest <em>Singapore Business Review</em> report, advance projections disclosed 1Q GDP growth decelerating to 3.8% YoY, down from 5% in the preceding quarter. Quarterly, the economy tapered by 0.8%, with the manufacturing and service sectors leading the slump.</p></div><div><p>The Ministry’s reduction is the newest hint that outside risks are starting to weigh more deeply on Singapore’s export-reliant economy. CGS International experts termed the GDP outcome as “below expectations,” cautioning that “we expect weaker economic growth for the rest of 2025 as sweeping tariffs reduce external demand.”</p></div><div><p>Economic experts from Maybank reflected the same sentiment when they stated that they are drawing in a growth stoppage, although they also clarified that it isn’t a depression yet at this point. Nonetheless, they acknowledged that the tightening in the first quarter was more strident than expected, as manufacturing yield slithered and a few outward-oriented services, like finance and insurance, missed their impetus.</p></div><p>At the core of the slowdown is the intensifying tempest of worldwide trade pressures. Forecasters from CGS International indicated that Singapore’s high reliance on external demand makes it principally susceptible to global trade disturbances.</p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display:block\"></ins></div><div><p>The experts emphasised that while Singapore is confronted with just a tiny 10% tariff from the U.S., the escalating trade pressures between the US and China are likely to spread into the world economy.</p></div><div><p>The same worries resonated with the Monetary Authority of Singapore (MAS), which reacted by enabling monetary policy for the second consecutive time this year. On April 14, MAS decreased the slant of its Singapore dollar nominal effective exchange rate (S$NEER) policy band—viewed as an indicator of policy slackening.</p></div><div><p>To maintain support for existing economic conditions, MAS also reviewed its fundamental inflation estimates downward to 0.5%-1.5 % for 2025, naming dropping energy prices, freezing labour cost pressures, and augmented government appropriations.</p></div><div><p>Notwithstanding the slowdown, Maybank economic experts noted there’s “less of a need to ease policy to a neutral 0% slope at this juncture.”</p></div><p>While growth has decelerated and risks have swelled, experts continue to be guardedly optimistic. Maybank continues to predict a 2.1% growth for 2025, just directly above the reviewed official range, reinforced by construction bustle, dwindling interest rates, and latent monetary inducements.</p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display:block\"></ins></div><div><p>Nevertheless, both research houses underscored caution and care. The outlook centres deeply on outside advancements and affairs, with CGS International cautioning that “a sharper or more prolonged downturn in global trade could have material spillover effects on Singapore’s trade-related industries and, by extension, the wider economy.”</p></div>",
            "link": "https://theindependent.sg/singapores-growth-engine-sputters-analysts-spot-fatigue-as-global-trade-clouds-gather",
            "pub_date": "2025-04-17 19:31:49",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MAS eases monetary policy again in April amid global trade tensions; GDP growth forecast down to 0–2%",
            "description": "<div><p>SINGAPORE: <span style=\"font-weight:400\">On Monday (April 14), Singapore’s central bank said it would “slightly” reduce the rate of appreciation of the Singapore dollar nominal effective exchange rate (S$NEER) policy band following its  <a href=\"https://theindependent.sg/mas-eases-monetary-policy-as-expected-by-most-analysts-2025-core-inflation-forecast-lowered-to-1-2\">January policy move</a>. However, it will continue with a “modest and gradual appreciation”, according to its released monetary policy statement. Meanwhile, there will be no change to the width of the band and the level at which it is centred.</span></p></div><div><p><span style=\"font-weight:400\">The Monetary Authority of Singapore (MAS) added that it “</span><span style=\"font-weight:400\">will closely monitor global and domestic economic developments and remain vigilant to risks to inflation and growth”.</span></p></div><div><p><span style=\"font-weight:400\">This followed expectations from 14 economists surveyed by Bloomberg, who </span><a href=\"https://theindependent.sg/economists-singapore-may-ease-monetary-policy-to-0-as-trumps-tariffs-shake-global-trade\"><span style=\"font-weight:400\">expected the central bank would reduce the slope of the S$NEER policy band</span></a><span style=\"font-weight:400\"> today. According to Channel News Asia (CNA), nine out of 10 analysts polled by Reuters had expected the same.</span></p></div><div><p><span style=\"font-weight:400\">The MAS cited signs of weakening economic activity among Singapore’s key trading partners in the first quarter of 2025. It noted that consumer and business confidence had dropped due to rising trade policy uncertainty, while retail sales and investment plans had also softened. </span><span style=\"font-weight:400\">In the region, exports became more uneven as earlier boosts from trade frontloading faded, although demand for electronics driven by artificial intelligence (AI) remained somewhat </span><span style=\"font-weight:400\">resilient</span><span style=\"font-weight:400\">.</span></p></div><p>MAS said that prospects for global trade and gross domestic product (GDP) growth dimmed in early April after the US imposed tariffs and some countries announced retaliatory measures. Global financial conditions have also tightened as asset markets have begun repricing risks in the global economy.</p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display:block\"></ins></div><div><p><span style=\"font-weight:400\">The government now expects Singapore’s GDP growth to slow to between 0% and 2% in 2025, from 4.4% last year. </span><span style=\"font-weight:400\">MAS core inflation is forecast to average between 0.5% and 1.5% in 2025, from the earlier projection of 1.0% to 2.0% made in January. </span><span style=\"font-weight:400\">Headline inflation, or CPI-All Items inflation, is expected to average 0.5% to 1.5% in 2025, from the previous 1.5% to 2.5%. </span>/<a href=\"https://theindependent.sg/\">TISG</a><span class=\"Apple-converted-space\"> </span></p></div><div><p>Read also: <a href=\"https://theindependent.sg/we-will-fight-to-the-end-trumps-50-tariff-threat-sparks-fierce-response-from-china-calling-it-a-mistake-on-top-of-a-mistake\">‘We will fight to the end’: Trump’s 50% tariff threat sparks fierce response from China, which calls it ‘a mistake on top of a mistake’</a></p></div><div><p><i>Featured image by </i><a href=\"https://depositphotos.com/stock-photography.html\" rel=\"noopener\" target=\"_blank\"><i>Depositphotos</i></a><i> (for illustration purposes only)</i></p></div>",
            "link": "https://theindependent.sg/mas-eases-monetary-policy-again-in-april-amid-global-trade-tensions-gdp-growth-forecast-down-to-0-2",
            "pub_date": "2025-04-15 19:21:55",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore gets ranked 4th globally as 242,400 millionaires flock to the island nation in 2025",
            "description": "<div><p>SINGAPORE: The Lion City lands fourth in the Henley &amp; Partners World’s Wealthiest Cities Report 2025, branding Singapore as a wealth paradise, with 242,400 millionaires calling it home.</p></div><div>\n<h2>What’s driving the spate of millionaires’ exodus?</h2>\n</div><div><p>An article from DM News writes that Singapore has a captivating recipe—an environment conducive to business, low taxes, and a rock-solid legal structure, making it very attractive to entrepreneurs and investors racing for stability.</p></div><div><p>Moreover, Singapore’s strategic post in Asia, matched with world-class infrastructure, trailblazing ports, and a top-notch airport, make the Lion City additionally enticing. Integrate a multicultural ambience with indulgent living options, and a horde of millionaires come flocking in.</p></div><p>Internationally, Singapore has even outdone some wealth capitals. London, once known as a leading favourite of high-net-worth individuals (HNWIs), now stands in sixth place with 215,700 magnates, showing how wealth is leaning toward Asia’s vigorous markets.</p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display: block;\"></ins></div><div><p>The top three in the list are New York, with 349,500 millionaires; Tokyo, 298,300; and the San Francisco Bay Area, 259,200 HNWIs. They still lead, but Singapore is closing the gap fast.</p></div><div><p>Part of Singapore’s advantage is its Global Investor Program. The program allows HNWIs to sink no less than S$10 million into local businesses for a shot at permanent residency.</p></div><div><p>Tech is another driver, with the city positioning itself as a Silicon Valley of the East. Startups and innovation centres are emerging, catching the attention of millionaire founders and venture capitalists keen on riding the upsurge.</p></div><div><p>Another is real estate, where towering condominiums and luxury manors accommodate the elite. Prices are precipitous, and major properties can hit S$5,000 per square foot. For millionaires, it’s a small price for a toehold in this flourishing tiny nation.</p></div><p>The Henley &amp; Partners report also hints at lifestyle perquisites—high-quality schools, Michelin-starred dining, and a secure and hygienic environment. For HNWIs with families, Singapore is a valuable combination of good prospects and a high quality of life.</p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display: block;\"></ins></div><div>\n<h2>Inequality in the glittering Singapore?</h2>\n</div><div><p>However, there’s another side to this dazzling narrative. Wealth absorption in Singapore, where the top 1% hold virtually a third of the country’s affluence, raises prickly questions about inequality.</p></div><div><p>The government appears to be making efforts to address the issue with policies such as advanced taxes and housing appropriations to bridge the gap. However, with the burgeoning number of tycoons getting inside Singapore, the burden is ever present in keeping growth all-encompassing, not just a windfall for the exclusively wealthy.</p></div><div><p>Globally, Singapore’s meteoric rise indicates a wider trend—Asia’s stealing the limelight from Western affluent strongholds. The report noted that over the past decade, cities like Singapore and Hong Kong have expanded and gained ground as Europe and the US fester.</p></div><p>While it’s not invincible, Singapore’s adaptability is mythical. From a lethargic harbour to a millionaires’ magnet, the city-state has a flair for reinventing itself, an attribute that will serve it well as wealth undercurrents advance.</p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display: block;\"></ins></div>",
            "link": "https://theindependent.sg/singapore-gets-ranked-4th-globally-as-242400-millionaires-flock-to-the-island-nation-in-2025",
            "pub_date": "2025-04-12 23:21:38",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Economists: Singapore may ease monetary policy to 0% as Trump’s tariffs shake global trade",
            "description": "<div><p>SINGAPORE: <span style=\"font-weight:400\">Singapore’s central bank will likely ease its monetary policy further after US President Donald Trump announced the biggest tariffs in 100 years, raising fears of a global trade fallout and possible retaliation, as reported by Bloomberg.</span></p></div><div><p><span style=\"font-weight:400\">As of 5 p.m., Wednesday, all 14 economists they surveyed expected the Monetary Authority of Singapore (MAS) to reduce the slope of the Singapore dollar’s nominal effective exchange rate (S$NEER) policy band on Monday.</span></p></div><div><p><span style=\"font-weight:400\">Although the US dollar strengthened against many Asian currencies after US President Trump’s election win in November, investors have started pulling out of US assets because of the unexpectedly high tariffs. Meanwhile, the Singapore dollar has climbed around 2.9% against the US dollar this year.</span></p></div><div><p><span style=\"font-weight:400\">Khoon Goh, </span><span style=\"font-weight:400\">head of Asia research at ANZ,</span><span style=\"font-weight:400\"> expects the MAS to cut the slope all the way to 0%, pointing out that “</span><span style=\"font-weight:400\">the global outlook has deteriorated significantly</span><span style=\"font-weight:400\">.” He said, “</span><span style=\"font-weight:400\">With core inflation forecast to stay well below its long-term average levels, the MAS is now firmly focused on growth.</span><span style=\"font-weight:400\">”</span></p></div><p><span style=\"font-weight:400\">Singapore was hit with a 10% tariff—much lower than </span><a href=\"https://theindependent.sg/sti-falls-3-2-singapore-shares-tumble-again-at-fridays-open-after-trumps-145-china-tariffs-shake-markets\"><span style=\"font-weight:400\">China’s 145%</span></a><span style=\"font-weight:400\">—but as an export-reliant economy, the city-state remains vulnerable to any slowdown in global trade. </span><a href=\"https://theindependent.sg/singapore-economy-to-face-significant-impact-from-tariff-war-recession-not-ruled-out\"><span style=\"font-weight:400\">Prime Minister Lawrence Wong has warned that growth this year will be “significantly impacted</span></a><span style=\"font-weight:400\">” whether Singapore may or may not </span><span style=\"font-weight:400\">avoid a recession</span><span style=\"font-weight:400\">.</span></p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display:block\"></ins></div><div><p><span style=\"font-weight:400\">Because of this, Citigroup sees a higher chance of “a more aggressive” move from MAS on Monday, although it still expects a modest 50 basis-point cut in the slope. </span><span style=\"font-weight:400\">MAS could also choose to shift the centre of its policy band downward, which would let the Singapore dollar weaken. Barclays Plc. is among those who see a low chance that MAS will reduce the slope and shift the centre of its policy band lower.</span></p></div><div><p><span style=\"font-weight:400\">Economist Tamara Mast Henderson of Bloomberg Economics said the “outlook for core inflation looks benign.” She noted that growth was already expected to slow after the rebound in 2024 </span><span style=\"font-weight:400\">and that global conditions now support more easing, as the heavy US tariffs are starting to disrupt trade flows and stir up turmoil in financial markets.</span></p></div><div><p><span style=\"font-weight:400\">UBS AG estimates that the impact of the tariffs will hit Thailand and Singapore the hardest, followed by Malaysia, Indonesia, and the Philippines. </span><span style=\"font-weight:400\">Citi’s Johanna Chua, citing OECD data, said nearly 7% of Singapore’s gross domestic product (GDP) is tied to US spending—second highest among Southeast Asian countries—leaving downside risks to the city-state. </span><span style=\"font-weight:400\">This analysis was made before the US President announced a 90-day pause on the new tariffs while also raising duties on Chinese goods to 125%.</span></p></div><div><p><span style=\"font-weight:400\">On Monday, UBS economists warned that global retaliation could worsen the risks for trade-dependent economies, predicting a “larger-than-usual” reduction in the slope to a 0% stance. </span><span style=\"font-weight:400\">The </span><a href=\"https://theindependent.sg/mas-eases-monetary-policy-as-expected-by-most-analysts-2025-core-inflation-forecast-lowered-to-1-2\"><span style=\"font-weight:400\">MAS had already eased in January for the first time in five years</span></a><span style=\"font-weight:400\">.</span></p></div><p><span style=\"font-weight:400\">Selena Ling, head of research and strategy at Oversea-Chinese Banking Corporation, said, “The question is how much to flatten the slope? The MAS has never gone to zero slope in one fell swoop, so it could be somewhat alarming to market watchers.” She added that, with ongoing external economic and trade uncertainties, a gradual and incremental approach may be wise. </span>/<a href=\"https://theindependent.sg/\">TISG</a><span class=\"Apple-converted-space\"> </span></p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display:block\"></ins></div><div><p>Read also: <a href=\"https://theindependent.sg/we-will-fight-to-the-end-trumps-50-tariff-threat-sparks-fierce-response-from-china-calling-it-a-mistake-on-top-of-a-mistake\">‘We will fight to the end’: Trump’s 50% tariff threat sparks fierce response from China, which calls it ‘a mistake on top of a mistake’</a></p></div><div><p><i>Featured image by </i><a href=\"https://depositphotos.com/stock-photography.html\" rel=\"noopener\" target=\"_blank\"><i>Depositphotos</i></a></p></div>",
            "link": "https://theindependent.sg/economists-singapore-may-ease-monetary-policy-to-0-as-trumps-tariffs-shake-global-trade",
            "pub_date": "2025-04-12 23:21:29",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US tariff surge threatens Singapore economy; could trigger global trade war — Deputy PM Gan Kim Yong",
            "description": "<div></div><div><p>SINGAPORE: On Apr 3, Deputy Prime Minister (DPM) Gan Kim Yong said that the US government’s move to place extensive tariffs on imported products would have a substantial effect on the Singaporean economy and could lead to an international trade war. DPM Gan spoke to the media after US President Donald Trump imposed a 10% tariff on many goods imported from Singapore to the US.</p></div><div><p>Experts believe that such a move could spur a worldwide trade war and affect growth around the world.</p></div><div><p>DPM Gan further said that Singapore households and businesses will need to be prepared for difficult times ahead. Currently, the government is re-evaluating its growth estimates for 2025, and it is prepared and equipped to provide support to families and industries when necessary.</p></div><p>According to the latest Straits Times report, DPM Gan said that it is still too soon to say anything with finality since not all information has been gathered; thus, they need to fully review and fine-tune and to see whether they must recalibrate their economic calculations.</p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display:block\"></ins></div><div><p>Although the 10% tariff on products from Singapore is less than that on goods from other nations, DPM Gan noted that it will affect growth if international trade and economic movements slow down considerably.</p></div><div><p>He emphasized that several countries are already declaring reciprocal tariffs on US products.</p></div><div><p>DPM Gan warns that if these punitive tariff measures persist, then they may intensify into a state that can result in a global trade war, which will, in turn, have a sizeable impact on world affairs and a strong effect on the economy.</p></div><div><p>“It will affect trade flows. You will create choke points for supply chains and also undermine the confidence of consumers and businesses. Investments will also slow down. All these eventually will significantly slow down the global economy. This will also, in turn, affect Singapore’s economic outlook in the medium to long term,” he further added.</p></div><p>DPM Gan told journalists that Singapore is disenchanted with the US move because the US and Singapore have had a venerable economic bond and a free trade agreement (FTA).</p><div class=\"my-8\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-4631505357773597\" data-ad-format=\"auto\" data-ad-slot=\"5091052809\" data-full-width-responsive=\"true\" style=\"display:block\"></ins></div><div><p>DPM Gan said the city-state would consequently engage the US to elucidate how it has designed the tariffs and explain any misinterpretation that has led to the 10% levy.</p></div><div><p>According to the Deputy Minister, “The US-Singapore FTA has been an extremely vital FTA for both nations, which has profited the US meaningfully. For over 20 years, US imports to Singapore have enjoyed zero tariffs. The country has likewise enjoyed a noteworthy and substantial trade excess with Singapore, amounting to S$30 billion,” he said. Naturally, Singapore is disappointed.</p></div><div><p>The Minister further explained that Singapore has an option under the FTA. It can take countermeasures and also pursue dispute resolution. However, the country decided not to do this because imposing retaliatory import duties would just increase the cost of the country’s imports from the US, which would impact Singaporean customers and businesses.</p></div><div><p>“We will reach out and engage our US counterparts and better understand their concerns, see how we can work together constructively to address some of these concerns.”</p></div>",
            "link": "https://theindependent.sg/us-tariff-surge-threatens-singapore-economy-could-trigger-global-trade-war-deputy-pm-gan-kim-yong",
            "pub_date": "2025-04-07 10:21:13",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Foreign woman with 2 y/o daughter says her S’porean husband cheated on her again, but she can’t leave him because she can’t even afford rent",
            "description": "<p>SINGAPORE: A foreign woman was absolutely gutted after finding out her Singaporean husband had cheated on her once again.</p>\n<p>She shared on the r/askSingapore Reddit forum on Saturday (Apr 5) that her husband had been unfaithful multiple times in the past, even during her pregnancy. “I kept forgiving him, hoping he would change, but he didn’t,” she said, her words heavy with the pain of repeated betrayals.</p>\n<p>This time, however, was a bit different. The woman wrote that she found a “video proof” of her husband cheating on her with a masseuse, which she said made her realize that forgiving her husband only encouraged him to make this mistake over and over again and take her for granted.</p>\n<p>She also mentioned that she now wants to divorce her husband but feels uncertain about how to move forward. Her main concern is her young daughter, who’s under 2 years old, and they are currently living in her husband’s parents’ home since they are still waiting for their BTO flat.</p>\n<p>“I can’t afford to rent an HDB flat on my own. My rental budget is only $1,000 per month,” she said.</p>\n<p>Seeking advice, she asked the Reddit community, “As a foreigner going through this kind of situation, what would you do if you were in my place? Should I get divorced and buy an HDB with my daughter? I am a Singapore PR.”</p>\n<h2>“This man will not change his ways…”</h2>\n<p>Singaporean Redditors were quick to give their opinions on the situation, with many urging her to walk out of the marriage and seek help from different organizations.</p>\n<p>“Get a divorce. Visit your nearest Family Service Centre (FSC) and speak to the social worker to see what kind of help they can give you. This man will not change his ways. He doesn’t care about you or your daughter,” one comment read.</p>\n<p>“I am sorry, but you are really too generous. Look, there is a limit to forgiveness, and it takes courage to say, “Enough, this must stop. As others said, go see FSC and follow their advice. Some community centres also offer free legal advice (not sure which ward you live in),” another wrote.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"u6eed3ebc41ac2c3ac27513b98912ae97\" href=\"https://theindependent.sg/angelina-jolie-shares-about-her-divorce-with-brad-pitt/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Angelina Jolie shares about her divorce with Brad Pitt</span></div></a></div><p>“If you continue to stay, your daughter will watch and learn that she should stay in a relationship even if her future partner disrespects her,” a third remarked.</p>\n<p>“Going back to your home country is the best if you don’t have your own source of income. Singapore is too expensive if you’re not a rich PRC, rich Malaysian, rich Indonesian, or rich anything,” a fourth suggested.</p>\n<h2>Where to seek help</h2>\n<p>If you’re going through marital issues, Family Service Centres (FSCs) can be a great place to turn for help. Their counsellors offer support and guidance to help you work through whatever challenges you’re facing, whether it’s relationship problems, parenting struggles, or just needing someone to talk to. It’s a safe space to get practical advice and emotional support.</p>\n<p>On top of that, there’s also the Online Counselling on Family Assist (OCFA) program, which is a joint effort between the Ministry of Social and Family Development (MSF), Strengthening Families Programme centres (FAM@FSC centres), and the Community Psychology Hub (CPH).</p>\n<p>This program is designed to help with various family-related issues, including pre-marital and marital challenges, parenting concerns, divorce, and anything else that impacts family life.</p>\n<h2>Who can use OCFA?</h2>\n<p>OCFA is available to Singapore citizens, permanent residents, and non-residents with a Singapore connection, and it’s open to people aged 18 and above. You can access it through live chat, audio calls, or email, so it’s flexible and convenient.</p>\n<p>Moreover, the service runs Monday to Friday from 9 am to 6 pm (excluding public holidays), and on the eve of New Year, Chinese New Year, and Christmas, it’s available from 9 am to 1 pm.</p>\n<p>Those interested can sign up for this service <a href=\"https://familyassist.msf.gov.sg/content/resources/programmes/online-counselling/\" rel=\"noopener\" target=\"_blank\">here.</a></p>\n<p><span style=\"font-weight: 400;\">Read also: </span><a href=\"https://theindependent.sg/my-maid-is-so-free-until-she-watches-drama-can-meh-employer-asks-how-to-schedule-her-helper-because-maybe-shes-too-free-already/\"><span style=\"font-weight: 400;\">‘My maid is so free until she watches drama, can meh?’ — Employer asks how to schedule her helper because ‘maybe she’s too free already’</span></a></p>\n<p><i>Featured image by </i><a href=\"https://depositphotos.com/stock-photography.html\" rel=\"noopener\" target=\"_blank\"><i>Depositphotos</i></a> <i>(for illustration purposes only)</i></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/foreign-woman-with-2-y-o-daughter-says-her-sporean-husband-cheated-on-her-again-but-she-cant-leave-him-because-she-cant-even-afford-rent/",
            "pub_date": "2025-04-06 17:21:17",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese company’s ‘unhappy leave’ draws mixed reactions from netizens; one says it’s just a way of ‘protecting their loss margin’",
            "description": "<p data-pm-slice=\"0 0 []\">A workplace policy meant to promote emotional well-being among employees has sparked mixed reactions from netizens after a Chinese retail company introduced “unhappy leave” — allowing staff to take time off when feeling emotionally down. While some wished their company had the same benefit, one commenter called the company’s leave just a way of “protecting their loss margin.”</p>\n<p>Talks of Chinese retail tycoon Yu Donglai’s unhappy leave policy resurfaced online after the Facebook page <em>Mechanical Engineering World</em> shared about it, prompting a fresh round of online chatter. The story was reported by the <em>South China Morning Post</em> (SCMP) in April 2024.</p>\n<p>According to the post, staff can take up to 10 extra days off per year, at their discretion, if they’re feeling unhappy.</p>\n<p>SCMP reported that Mr Yu, founder and chairman of the Henan-based retail chain Pang Dong Lai, said during the China Supermarket Week in late March 2024, “I want every staff member to have freedom. Everyone has times when they’re not happy, so if you’re not happy, do not come to work. This leave cannot be denied by management. Denial is a violation.”</p>\n<p>His comment stirred both amusement and scepticism online. Some joked about taking unhappy leave all year round, as they’re unhappy every day, while others said that if such a policy were introduced in their country, offices would be empty.</p>\n<p>One commenter said, “Then 95% of people will be off on unhappy leave,” while another jokingly added, “[If you] apply [for] more unhappy leave, they will say don’t come to work forever.”</p>\n<p>One user chimed in, adding, “I wish my country had this kind of leave too.”</p>\n<p>However, one commenter suggested that the policy might not entirely be for the worker’s benefit. “Remember, the company will not pay you for being unhappy; the company is literally protecting their loss margin,” the commenter said.</p>\n<p>Still, the policy fits into a larger framework of generous employee benefits at Pang Dong Lai, which supports the company’s philosophy of “freedom and love.”</p>\n<p>Pang Dong Lai staff already enjoy 7-hour shifts, full weekends off, 30 to 40 days of annual leave, and a 5-day break during the Lunar New Year. The company’s average monthly salary is RMB7,000 (S$1,293.08), nearly double the national average for retail workers in China, which stood at just RMB3,566 (S$658.73) in 2019, according to China’s retail news outlet <em>linkshop.com</em>.</p>\n<p>According to China Briefing, as of March 21, 2025, 28 regions in China, including Henan, have surpassed the RMB 2,000 (US$275) mark in their monthly minimum wage standards.</p>\n<p>In addition, the company rolled out a job-level certification system that enables even janitors to earn up to RMB500,000 (S$92,362.50) annually as long as their professional capabilities reach a certain level.</p>\n<p>Although Pang Dong Lai has only 13 stores in Xuchang and Xinxiang, both third-tier cities in Henan province, it has earned recognition as “the ceiling of China’s industry” for its exceptional customer service over its 29 years in business.</p>\n<p>The supermarket also features pet cabinets at the entrance, along with pet water and cooling devices for pet lovers, and offers around 100 free services, including blood pressure checks, air conditioner cleaning, and handbag maintenance. /<a href=\"https://theindependent.sg/\">TISG</a><span class=\"Apple-converted-space\"> </span></p>\n<p>Read also: <a href=\"https://theindependent.sg/about-6000-vulnerable-seniors-to-benefit-from-s7-3m-dbs-foundation-programme-but-netizens-say-its-just-a-band-aid-measure/\" title=\"Permalink to: About 6,000 vulnerable seniors to benefit from S$7.3M DBS Foundation programme, but netizens say it’s just a ‘band-aid measure’\">About 6,000 vulnerable seniors to benefit from S$7.3M DBS Foundation programme, but netizens say it’s just a ‘band-aid measure’</a></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/chinese-companys-unhappy-leave-draws-mixed-reactions-from-netizens-one-says-its-just-a-way-of-protecting-their-loss-margin/",
            "pub_date": "2025-04-06 17:11:16",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "‘Maid works nonstop, you ask why so slow; maid rests after work, you ask why so fast finish’ — Netizen urges employers to ‘say something nice’ instead",
            "description": "<p style=\"text-align: left;\">SINGAPORE: A few kind words can go a long way in making helpers feel appreciated and valued, but some employers don’t seem to think this way and instead dish out constant criticism.</p>\n<p>One netizen recently raised this issue in the ‘MDW in Singapore’ Facebook group on Saturday (Apr 5). In her post, she shared how some helpers are criticised by their employers no matter what they do.</p>\n<p>For example, if a helper works non-stop, she might be told, “Wow, you still haven’t finished? So slow ah you,” but if she takes a short break after finishing a task, the comment might be, “So fast you finish? Did you clean properly or not? So free ah you.”</p>\n<p>Frustrated by the unfair treatment, she asked the employers, “Can you just say something nice?”</p>\n<h2>“Don’t take it too hard. It’s a Singaporean thing.”</h2>\n<p>In the comments section, many people shared their own experiences and thoughts on the matter. One person pointed out that remarks like those often come from “older folks, like grannies, who constantly watch over the helper and are never quite satisfied” with how things are done.</p>\n<p>They added that those who haven’t dealt with such behaviour are “lucky” and should be “thankful” for having less stress in their homes.</p>\n<p>Another commenter imagined the type of employer being described and joked that they might as well “install CCTV” if they’re going to monitor every little thing.</p>\n<p>Domestic helpers also joined the conversation, saying they’ve experienced this kind of treatment firsthand. One shared that some employers seem to think “helpers are robots” and joked that even if they rented a robot, they’d still find a reason to scold and “smack” it.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"u4132f25b470a85a292f2610e5ae0cdb8\" href=\"https://theindependent.sg/maid-says-after-working-3-months-for-her-current-employer-she-wants-to-be-transferred-elsewhere/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Maid says after working 3 months for her current employer, she wants to be transferred elsewhere</span></div></a></div><p>Others described similar situations where, if they took a short rest, their employer would inspect every corner of the house, looking for something to criticise. One of them said, “She (my employer) will start looking for things to complain about, and if she can’t find something, she’ll look unhappy.”</p>\n<p>Meanwhile, a few helpers simply chimed in with short responses like “same here” or “so true,” echoing the sentiments of being unfairly treated.</p>\n<p>Moreover, some users encouraged helpers not to renew their contracts if they were constantly being treated this way. Others offered emotional support, advising not to take such comments too personally.</p>\n<p>“It’s ok. Don’t take it too hard. It’s a Singaporean thing. They do that at the office too among their work friends,” one said.</p>\n<p>In other news, a 24-year-old fresh grad who majored in communications and marketing turned to social media to open up about how utterly exhausted he was after job hunting for 90 days straight.</p>\n<p>In a post on the r/askSingapore forum, he vented his frustrations, writing, “(I’ve had) ⁣rejections after rejections. Even scoring interviews feels like striking a pot of gold and going through rounds and rounds only to be rejected or ghosted at the end; although I had a few interviews with some up to the third round, I have received no offers so far.”</p>\n<p><span style=\"font-weight: 400;\">Read more: </span><a href=\"https://theindependent.sg/even-scoring-interviews-feels-like-striking-a-pot-of-gold-24-yo-fresh-grad-exhausted-after-90-days-of-job-hunting/\"><span style=\"font-weight: 400;\">‘Even scoring interviews feels like striking a pot of gold,’ 24 yo fresh grad exhausted after 90 days of job hunting</span></a></p>\n<p><i>Featured image by </i><a href=\"https://depositphotos.com/stock-photography.html\" rel=\"noopener\" target=\"_blank\"><i>Depositphotos</i></a> <i>(for illustration purposes only)</i></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/maid-works-nonstop-you-ask-why-so-slow-maid-rests-after-work-you-ask-why-so-fast-finish-netizen-urges-employers-to-say-something-nice-instead/",
            "pub_date": "2025-04-06 16:11:15",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maid prefers ‘to cook Pinoy food’ for her Chinese employer’s family which they say ‘doesn’t suit our palate’",
            "description": "<p>SINGAPORE: An employer took to social media to voice her concerns about her domestic helper’s food preferences, which had been causing some tension in the household.</p>\n<p>In a post on the ‘MDW in Singapore’ Facebook group, the employer shared that she had been preparing most of the family meals since her helper was having difficulty both eating and cooking Chinese food.</p>\n<p>“(I also) noticed she eats very less,” she wrote. “After probing, I realised she prefers to cook Pinoy food for our Chinese family, which obviously doesn’t suit our palate.”</p>\n<p>Unsure of how to resolve the conflict, she asked the group, “Employers (or helpers), do your helpers (or you) not eat what is cooked as a family meal and prefer to eat their own food? How do you manage that? Is this normal for a fresh helper (Pinoy)?”</p>\n<p>In the comments, many netizens advised the employer to be more patient with her helper, who’s likely still adjusting to the new environment and culture. Some also suggested that the employer be more active and teach her helper how to prepare Chinese meals.</p>\n<p>One shared, “Wow… I’m a Filipino, also. (During) my first two weeks here, my employer was hands-on, teaching me how to cook Chinese food. After I learned, in the third week, my ma’am would send me recipes, and I would do my best to follow them.”</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"ud0d72b5bd2f95c07c028db2825a04b41\" href=\"https://theindependent.sg/maid-says-her-employer-has-withheld-her-pay-forced-her-not-to-return-home-for-another-2-years-and-threatens-to-blacklist-her-if-she-runs-away/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Maid says her employer has withheld her pay, forced her not to return home for another 2 years, and threatens to blacklist her if she runs away or complains to agency</span></div></a></div><p>Another commented, “Talk to her just like how you post it here. It’s ok. Show her videos on YouTube to learn Chinese cooking. My employer used to send me videos of what she wanted to eat. If you buy the groceries, make sure you have the ingredients needed. Eventually, she will get used to the condiments and will learn and adapt. Then, you can tell her that she can cook her own food if she prefers.”</p>\n<p>A third wrote, “Give her time to adjust, ma’am; as you mentioned, she’s new. Slowly introduce her to Chinese cuisine and teach her how to cook. It takes time, ma’am, but slowly, you both will be okay.”</p>\n<h2>Employers should be mindful of their helpers’ food preferences</h2>\n<p>The Ministry of Manpower has clarified on its website that employers must never force their MDW to eat food that ‘she is not supposed to or is not comfortable with.’</p>\n<p>This includes situations where the helper may have specific dietary restrictions, such as those due to religious beliefs, cultural practices, or personal preferences.</p>\n<p><span style=\"font-weight: 400;\">Read also: </span><a href=\"https://theindependent.sg/even-scoring-interviews-feels-like-striking-a-pot-of-gold-24-yo-fresh-grad-exhausted-after-90-days-of-job-hunting/\"><span style=\"font-weight: 400;\">‘Even scoring interviews feels like striking a pot of gold,’ 24 yo fresh grad exhausted after 90 days of job hunting</span></a></p>\n<p><i>Featured image by </i><a href=\"https://depositphotos.com/stock-photography.html\" rel=\"noopener\" target=\"_blank\"><i>Depositphotos</i></a> <i>(for illustration purposes only)</i></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/maid-prefers-to-cook-pinoy-food-for-her-chinese-employers-family-which-they-say-doesnt-suit-our-palate/",
            "pub_date": "2025-04-06 13:31:47",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "‘My maid is so free until she watches drama, can meh?’ — Employer asks how to schedule her helper because ‘maybe she’s too free already’",
            "description": "<p>SINGAPORE: A local employer has found herself in hot water online after posting a complaint about her domestic helper spending “too much time” watching dramas in her free time.</p>\n<p>Posting in the ‘MDW in Singapore’ Facebook group on Saturday (Apr 5), the employer shared that her helper has an incredibly easy workload, considering she and her husband work full-time and their child is at school during the day.</p>\n<p>According to her, the helper is only responsible for preparing two meals daily and occasionally a simple lunch when the employer works from home. Beyond that, there’s pretty much nothing else to do.</p>\n<p>She also added that, while she allows the helper to take breaks once her tasks are completed, she couldn’t help but feel bothered by how the helper spends her free time—watching dramas.</p>\n<p>She then asked the group, “Is it fair for your FDW to watch drama during this (time)? I’m really not sure if I’m a bad employer or what… but so free until watch drama can meh? I think maybe she’s too free already. How does the employer set a schedule for the helper? Thank you.”</p>\n<h2>“You ask her to rest, but she can’t do what she wants on resting time…”</h2>\n<p>In the comments, many condemned the employer for what they saw as a lack of basic respect for the helper’s autonomy and rest time.</p>\n<p>“If she has already done her job, then why not? Just (show) a bit of consideration to your helper and let her watch her favourite drama—why can’t you give (her that)? Your helper is a human, too. She also has the right to do things that make her happy, as long as it doesn’t affect her job,” one netizen said.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"uc0418ce3f708d45450c40b445a567b83\" href=\"https://theindependent.sg/maid-from-indonesia-thanks-singapore-employers-for-letting-her-drive-their-mercedes-benz/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Maid from Indonesia thanks Singapore employers for letting her drive their Mercedes-Benz</span></div></a></div><p>“I think you are confused, madam? You ask her to rest, but she can’t do what she wants on resting time, or maybe, maybe you’re the type of employer who gets a sore brain when you think your helper is doing nothing at home while your kids are in school and you are out working?” another chimed in.</p>\n<p>“So you literally mean she can’t watch drama/movies as long as she works in your house?” a third wrote.</p>\n<p>“You said this timing, but you never tell us the timing. Is it during working hours that most chores are done?” a fourth asked, confused by the employer’s question.</p>\n<p>Some domestic helpers also chimed in on the discussion, letting the employer know that this is normal. One shared, “My boss lets me watch anytime by sharing her Netflix and Disney+ accounts. She even told me not to work too hard in the house. I’ve been with them for 11 years, looking after two kids, aged 11 and 5.”</p>\n<h2>Rest time for domestic helpers</h2>\n<p>Currently, there are no official regulations regarding working hours for domestic helpers in Singapore. However, both the Ministry of Manpower (MoM) and Helperly, a maid agency, recommend that employers provide their domestic helpers with rest periods between tasks.</p>\n<p>This recommendation ensures helpers are not overworked and have sufficient time to recharge throughout the day. As stated on the MoM’s website, “As an employer, you are responsible for the health and well-being of your migrant domestic worker (MDW).”</p>\n<p><span style=\"font-weight: 400;\">Read also: </span><a href=\"https://theindependent.sg/30yo-woman-with-ite-cert-and-background-in-fb-and-retail-struggles-to-land-office-job-asks-if-getting-a-diploma-would-help/\"><span style=\"font-weight: 400;\">30yo woman with ITE cert and background in F&amp;B and retail struggles to land office job, asks if getting a diploma would help</span></a></p>\n<p><i><span style=\"font-weight: 400;\">Featured image by </span></i><a href=\"https://www.freepik.com/free-photo/smart-asian-guy-solving-puzzle-mind-looking-thoughtful-relaxed-upper-right-corner-thinking-making-assumptions-touching-cheek-while-making-up-plan-decision_10178112.htm#fromView=search&amp;page=1&amp;position=5&amp;uuid=24725d8a-9ee7-40d5-82b7-5e8958d61653&amp;query=singaporean+thinks\" rel=\"noopener\" target=\"_blank\"><i><span style=\"font-weight: 400;\">freepik</span></i></a> <i><span style=\"font-weight: 400;\">(for illustration purposes only)</span></i></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/my-maid-is-so-free-until-she-watches-drama-can-meh-employer-asks-how-to-schedule-her-helper-because-maybe-shes-too-free-already/",
            "pub_date": "2025-04-06 12:21:23",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore and South Korea mark 50 years of friendship; what do South Koreans think and love about Singapore?",
            "description": "<p>SINGAPORE: As South Korea and Singapore reached their 50<sup>th</sup> year of diplomatic relations this year, the South Korean embassy has a string of planned activities on the drawing board. Thus, the entire year 2025 will be filled with arts and culture events taking place in several locations within the city-state.</p>\n<p>According to the latest CNA report, while the dedicatory celebrations are designed to bring the citizens of both countries to a deeper understanding and collaboration, there will also be activities focused on children and students to strengthen the alliance between future generations via cultural, literary, and academic exchanges.</p>\n<p>The calendar of events, according to the embassy, is meant to echo the achievements attained by Singapore-Korean relations, revel in the advancement of mutual ties, and look to future teamwork between the two nations.</p>\n<h2>What do South Koreans think and love about Singapore and Singaporeans?</h2>\n<p>In the online forum <em>Quora</em>, one Korean netizen said that they view Singapore as a ‘hyper-modern’ country that very well blends Western efficiency with Asian identity.</p>\n<p>They also think of Singaporeans as ‘model Asians’ who exemplify the best of Eastern Confucianism—meaning hard work, integrity, respect, honour, and family—and Western rationalism referring to Singaporeans’ practicality, advocacy for science, law and order, and individual utilitarianism. The commenter further said that many Koreans are impressed by Lee Kuan Yew and that many study his life and works.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"ua9a9a0e7e3b7c5d1b01c2958971a431a\" href=\"https://theindependent.sg/woman-says-she-may-be-a-maid-in-sg-but-thats-why-she-could-afford-3-houses-two-plots-of-land-and-a-car-in-the-philippines/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Woman says she may be a maid in Singapore, but that's why she could afford 3 houses, 2 plots of land and 1 car in the Philippines</span></div></a></div><p>Another commenter thinks that Singapore is a tiny, wealthy, hygienic, secure, and very strict nation, but in a positive way.</p>\n<p>One netizen confided that when her Korean friends travel to Singapore, they only have one goal, and that is to stay at the Marina Bay Sands Hotel just for the pool on the roof. Also, many Korean girls love to shop at Charles and Keith.</p>\n<p>For another netizen in the forum, ‘enjoyment’ means eating at the Hawker Centre and hanging out at Clarke Quay. This commenter feels safe while walking even at 11 o’clock at night and confided that there were no stray dogs or dangerous-looking people. “I had mostly positive experiences and wouldn’t mind living there again,” he said.</p>\n<h2>Nurturing cultural exchanges</h2>\n<p>South Korea’s First Vice Minister of Culture, Sports and Tourism, Mr Yong Ho-Seong, said that the two countries will continue to foster cultural interactions through the events that have been planned to take place. To recall, in January, South Korea and Singapore launched a logo in Seoul to mark the 50<sup>th</sup> anniversary of diplomatic relations. The logo contains representational elements and colours inspired by both sides’ national flags.</p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/singapore-and-south-korea-mark-50-years-of-friendship-what-do-south-koreans-think-and-love-about-singapore/",
            "pub_date": "2025-04-06 12:01:23",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "‘Is it normal for helpers to not eat a lot?’ — Employer concerned MoM will hold her accountable if something happens to her maid",
            "description": "<p>SINGAPORE: After noticing that her domestic helper had been eating “very tiny” portions during mealtimes, an employer took to social media to ask netizens “whether this behaviour was normal.”</p>\n<p>Posting in the ‘MDW in Singapore’ group on Saturday (Apr 5), the employer shared that she was worried the lack of food might affect her helper’s energy levels and ability to carry out her tasks effectively.</p>\n<p>She also raised a more serious concern: If something were to happen to the helper due to poor nutrition, would the Ministry of Manpower (MoM) hold her accountable as the employer?</p>\n<p>“What if MoM says we, the employers, never gave sufficient meals? Or if something happens due to lack of nutrition, etc.? It becomes the employer’s problem again,” she said.</p>\n<h2>“Maybe she has some problem, madam…”</h2>\n<p>In the comments, many other employers chimed in, offering possible explanations for why the helper might not be eating much. One suggested that the helper could be “on a diet,” while another speculated that the helper might simply be a small eater by nature.</p>\n<p>A third commenter raised a more concerning possibility, saying, “Maybe she has some problem, madam.”</p>\n<p>A fourth shared her own personal experience, writing, “My helper also doesn’t eat a lot because she is single, so scared of gaining weight, and she is not used to the taste of food here.”</p>\n<p>Meanwhile, some netizens offered practical advice, suggesting that the employer simply ask the helper directly about why she doesn’t want to eat. A few even recommended being more proactive in offering a variety of food, trying to find something the helper would enjoy more, or even encouraging her to eat smaller, more frequent meals if she’s worried about gaining weight.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"u48131be2cac17e003fe932088e234a3c\" href=\"https://theindependent.sg/maid-lied-to-employer-about-borrowing-money-from-loanshark-she-now-wants-to-transfer-to-another-family/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Maid lied to employer about borrowing money from loanshark, she now wants to transfer to another family that allows her to stay out of registered premises on weekends</span></div></a></div><p>One domestic helper commented, “That was also my employer’s problem before. Not until my ma’am encouraged me to eat more and let me cook any food I wanted, especially letting me eat rice three times a day and taking vitamins will help too.”</p>\n<p>To ensure that domestic helpers are well-nourished and capable of performing their duties effectively, MoM has mandated that employers provide them with three meals per day.</p>\n<p>Additionally, MOM advises employers to consider their helpers’ personal tastes and dietary preferences when preparing meals.</p>\n<p>In other news, a young man in his final year of university felt utterly discouraged after realising that no matter how much effort he puts in, he just doesn’t seem to tick any boxes that seem to matter most to women.</p>\n<p>Venting on the r/askSingapore Reddit forum on Thursday (Apr 3), he wrote, “I overheard some of my girl-friends talking about their dating preferences, and it really opened my eyes. I realised I hadn’t ticked a single one of their boxes. Not looks, not height, not status. It made me wonder if the game was already over for me before it even started.”</p>\n<p><span style=\"font-weight: 400;\">Read also: </span><a href=\"https://theindependent.sg/i-dont-tick-any-of-their-boxes-not-looks-not-height-not-status-man-feels-discouraged-after-finding-out-womens-standards/\"><span style=\"font-weight: 400;\">‘I don’t tick any of their boxes. Not looks, not height, not status’: Man feels discouraged after finding out women’s standards</span></a></p>\n<p><i><span style=\"font-weight: 400;\">Featured image by </span></i><a href=\"https://www.freepik.com/free-photo/smart-asian-guy-solving-puzzle-mind-looking-thoughtful-relaxed-upper-right-corner-thinking-making-assumptions-touching-cheek-while-making-up-plan-decision_10178112.htm#fromView=search&amp;page=1&amp;position=5&amp;uuid=24725d8a-9ee7-40d5-82b7-5e8958d61653&amp;query=singaporean+thinks\" rel=\"noopener\" target=\"_blank\"><i><span style=\"font-weight: 400;\">freepik</span></i></a><i><span style=\"font-weight: 400;\"> (for illustration purposes only)</span></i></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/is-it-normal-for-helpers-to-not-eat-a-lot-employer-concerned-mom-will-hold-her-accountable-if-something-happens-to-her-maid/",
            "pub_date": "2025-04-06 11:41:16",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PV’s Lim Tean faces backlash over intention to contest Potong Pasir SMC",
            "description": "<p><span style=\"font-weight: 400;\">SINGAPORE: The Peoples Voice’s (PV’s) intention to contest the Potong Pasir Single Member Constituency (SMC) does not seem to resonate well with many opposition supporters, and some have voiced their disappointment on online forums such as Reddit.</span></p>\n<p><span style=\"font-weight: 400;\">“Lim Tean is delusional. If in a three-corner fight like this, I would support SPP (Singapore People’s Party) as this GRC (Group Representation Constituency) used to be under Chiam See Tong and the candidates in his party are likely vetted by him,” mentioned one forum user. In contrast, others said that the SPP chief is planning to lose his deposit in Potong Pasir.</span></p>\n<p><span style=\"font-weight: 400;\">Another forum user shared that while there is a growing desire for more voices of opposition in Parliament, a three-corner contest in Potong Pasir would not do PV any favour. Another netizen also reminded PV that in 2020, the party lost its election deposit in a three-corner contest in the Pasir Ris—Punggol Group Representation Constituency (GRC) </span></p>\n<p><span style=\"font-weight: 400;\">Potong Pasir was previously held by veteran opposition Member of Parliament Mr Chiam See Tong, who first won the SMC in the 1984 general election (GE). The former SPP leader held on to the seat until he ventured out to contest Bishan—Toa Payoh GRC in the 2011 election.</span></p>\n<p><span style=\"font-weight: 400;\">The People’s Action Party (PAP) regained Potong Pasir in 2011 when its candidate, Mr Sitoh Yih Pin, won by a slim 114-vote majority against Mrs Lina Chiam.</span></p>\n<p><span style=\"font-weight: 400;\">Since the loss, SPP has struggled to win back Potong Pasir in the following two elections. In 2015, Mrs Chiam only polled 33.61% against Mr Sitoh, while Mr Jose Raymond improved slightly with 39.33% of the votes in the 2020 election.</span></p>\n<p><span style=\"font-weight: 400;\">Undeterred by setbacks in multiple elections, the SPP is not backing down and has announced that they will once again contest in Potong Pasir. However, they face a potential three-corner fight against the incumbent PAP and the PV.</span></p>\n<h2>PV Throwing hat into Potong Pasir SMC</h2>\n<p><span style=\"font-weight: 400;\">PV’s chief Mr Lim Tean shared with the media on Sunday, Mar 30 that the People’s Alliance for Reform will be sending a candidate to contest in Potong Pasir SMC, adding that winning back the constituency for the opposition is “eminently doable.”</span></p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"ud7e7a61b4976312e52e038d1be745bcf\" href=\"https://theindependent.sg/pvs-lim-tean-targets-ceca-and-ministerial-pay-in-second-facebook-live-talk/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">PV's Lim Tean targets CECA and ministerial pay in second Facebook Live talk</span></div></a></div><p><span style=\"font-weight: 400;\">“For 27 years, he (Mr Chiam) occupied that seat. Our parties may have our ideas about contesting Potong Pasir, but the important thing is for us in this GE to win back Potong Pasir SMC,” said Mr Lim to the media before his alliance’s walkabout at the ABC Brickworks Market and Food Centre.</span><span style=\"font-weight: 400;\"><br/>\n</span></p>\n<p><span style=\"font-weight: 400;\">Mr Lim further explained that the more pertinent question to ask is which party has the best candidate to defeat the PAP in Potong Pasir.</span></p>\n<p>“There is no point in being obstinate and stubborn and saying that you want to field a candidate if you know the whole world can see that at the end of the day, your candidate is not likely to win,” added the PV’s chief.</p>\n<figure aria-describedby=\"caption-attachment-661053\" class=\"wp-caption aligncenter\" id=\"attachment_661053\" style=\"width: 4000px\"><img alt=\"Singapore People’s Party secretary-general Steve Chia during a walkabout at Potong Pasir SMC and Bishan—Toa Payoh GRC. (Photo credit: SPP)\" class=\"wp-image-661053 size-full lazyload\" data-sizes=\"(max-width: 4000px) 100vw, 4000px\" data-src=\"https://media.theindependent.sg/wp-content/uploads/2025/03/487811370_1217058406444898_8957153204100604187_n-scaled.jpg\" data-srcset=\"https://media.theindependent.sg/wp-content/uploads/2025/03/487811370_1217058406444898_8957153204100604187_n-scaled.jpg 4000w, https://media.theindependent.sg/wp-content/uploads/2025/03/487811370_1217058406444898_8957153204100604187_n-300x183.jpg 300w, https://media.theindependent.sg/wp-content/uploads/2025/03/487811370_1217058406444898_8957153204100604187_n-1024x623.jpg 1024w, https://media.theindependent.sg/wp-content/uploads/2025/03/487811370_1217058406444898_8957153204100604187_n-768x468.jpg 768w, https://media.theindependent.sg/wp-content/uploads/2025/03/487811370_1217058406444898_8957153204100604187_n-1536x935.jpg 1536w, https://media.theindependent.sg/wp-content/uploads/2025/03/487811370_1217058406444898_8957153204100604187_n-2048x1247.jpg 2048w\" decoding=\"async\" height=\"2435\" src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 4000px; --smush-placeholder-aspect-ratio: 4000/2435;\" width=\"4000\"/><figcaption class=\"wp-caption-text\" id=\"caption-attachment-661053\">Singapore People’s Party secretary-general Steve Chia during a walkabout at Potong Pasir SMC and Bishan—Toa Payoh GRC. (Photo credit: SPP)</figcaption></figure>\n<p><span style=\"font-weight: 400;\">A day earlier on Mar 29, the SPP’s secretary-general, Mr Steve Chia, had also announced his party’s electoral plan to contest both the Potong Pasir SMC and Bishan—Toa Payoh GRC.</span></p>\n<p><span style=\"font-weight: 400;\">“This coming election, we will still be contesting in Potong Pasir. We cannot let the people of Potong Pasir down. We are working and discussing with PAR about not having a three-corner fight there. I’ve already spoken to them, telling them that we are very firm with our candidates contesting in Potong Pasir,” shared Mr Chia with the media.</span></p>\n<p><span style=\"font-weight: 400;\">Mr Chia and Mr Lim used to be the secretary-general of the opposition party, the National Solidarity Party (NSP). Mr Chia led the party from 2001 until 2005, while Mr Lim took over the leadership from Ms Hazel Poa in 2015.</span></p>\n<p><span style=\"font-weight: 400;\">In 2017, Mr Lim stepped down as NSP’s secretary-general and formed PV a year later. In June 2023, PV announced a new political alliance of four opposition parties, the People’s Alliance for Reform (PAR).</span></p>\n<p><span style=\"font-weight: 400;\">The PAR includes the Reform Party, the Democratic Progressive Party, and the People’s Power Party (PPP). However, in February this year, PPP parted ways with the alliance, citing “irreconcilable strategic differences.”</span></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/pvs-lim-tean-faces-backlash-over-intention-to-contest-potong-pasir-smc/",
            "pub_date": "2025-04-06 08:01:27",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GE2025: RDU unveils People-First vision in Jurong East-Bukit Batok GRC campaign kick-off",
            "description": "<p>SINGAPORE: Red Dot United (RDU) officially launched its campaign in the newly carved-out Jurong East-Bukit Batok GRC with a walkabout and media address on Saturday (5 Apr). Aside from introducing key team members who may be seen at the polls, the party advocated for what it calls a “people-first” movement focused on practical reforms, dignity for all citizens, and honest representation in Parliament.</p>\n<p>The party also emphasised that the area is not new to its team. RDU had contested Jurong GRC in the 2020 general election, which was called a mere three weeks after the party had been registered. The party fielded a five-man team to contest Jurong GRC, which had been a ward that the opposition was understandably hesitant to contest – it was then helmed by Tharman Shanmugaratnam and had always garnered the ruling party’s highest vote share in past elections.</p>\n<p>In the five years since the election, the party has continued walking the ground and staying connected with the residents and their needs.</p>\n<p>Party chief Ravi Philemon had also contested in the neighbouring Hong Kah North SMC in 2015 under the banner of the Singapore People’s Party (SPP) — an experience he says laid the groundwork for the trust he’s built with residents.</p>\n<p>“We are familiar faces. We stayed, walked the ground weekly, and listened,” he shared, referencing not just his personal involvement, but the continuous engagement of his team over the years.</p>\n<p>When asked about the support that Singapore Democratic Chief (SDP) chief Chee Soon Juan cultivated at the ward, Mr Philemon said that he is “always very thankful to Dr Chee Soon Juan”.</p>\n<p>Dr Chee, who contested Bukit Batok SMC at the last general election, has announced his plans to contest Sembawang West SMC at the next polls.</p>\n<p>Mr Philemon said, “He is a guiding light to many in the opposition ecosystem, including to me, and I’m thankful to him that he has worked the ground here in the past 10 years.”</p>\n<p>Acknowledging that Dr Chee helped to grow the political awareness of residents in the ward, Mr Philemon said that RDU is the party that plans to contest this area for the upcoming General Election, and that it will “take from where Dr Chee left off”.</p>\n<p>“I think he has passed the baton to us in a certain sense, and we will continue to continue to run the race on the behalf of Singaporeans,” he said.</p>\n<h3>A voice for Singaporeans</h3>\n<p>Mr Philemon emphasized that since the party was founded in 2020, its mission has not been to push for abrupt change, but to give voice to Singaporeans who feel alienated by the system.</p>\n<p>Drawing directly from years of resident engagement, Mr Philemon announced the theme of the campaign in Jurong East-Bukit Batok — Raising the Standard — which focuses on:</p>\n<p>• Better-paying jobs for youth</p>\n<p>• More dignity and support for seniors</p>\n<p>• Fairer treatment for small businesses</p>\n<p>• Higher quality municipal services</p>\n<p>“Exposure is not enough — people need good pay, a future, and dignity,” he added, responding to recent remarks by Singapore’s Manpower Minister, who had suggested that young jobseekers should value “exposure” over starting salaries.</p>\n<p>RDU’s position is that meaningful employment and fair compensation must come together, especially in a high-cost society like Singapore.</p>\n<p>The secretary-general also expressed concern over the government’s increasing reliance on vouchers as a response to cost-of-living pressures: “We don’t want a food-stamp nation. That cannot be the future of Singapore.”</p>\n<p>He clarified that in countries like the United States, vouchers and food stamps are typically reserved for the most economically vulnerable, serving as a stopgap measure rather than a long-term solution. RDU is advocating for structural reform instead — better job opportunities, wage progression, and targeted support for small business owners.</p>\n<h3>Unity — But Not Monopoly</h3>\n<p>While RDU echoed calls for unity in turbulent times, the party cautioned against the dangers of one-party dominance, using an analogy familiar to many Singaporeans.</p>\n<p>Mr Philemon said, “Unity must not mean everyone joins the PAP. That’s not unity — that’s a monopoly.”</p>\n<p>He went on to compare the political landscape to Singapore’s ride-hailing market, noting how Grab’s early success led to monopoly pricing. “We must avoid that in politics — not by being divisive, but by making sure that voices from all walks of life are represented,” he said.</p>\n<p>He positioned RDU’s vision of change as incremental, thoughtful, and inclusive — not upheaval, but the addition of diverse voices in Parliament.</p>\n<h3>“We’re Not Adversaries — We’re All Singaporeans”</h3>\n<p>Red Dot United’s approach is rooted in cooperation and constructive policy-making. Mr Philemon reiterated that RDU is not running simply to oppose: “We’re not adversaries. We’re all Singaporeans.”</p>\n<p>He stated that RDU is committed to working with all stakeholders — including the PAP, civic society, town councils, and grassroots groups — to propose actionable solutions, not just highlight problems.</p>\n<p>When asked about younger voters, Mr Philemon reiterated one of RDU’s key youth-driven policy proposals: “One of the things that we have called for, with the input of our young people, is to lower the voting age to 18. I think if you can carry guns at 18, you should be able to vote.”</p>\n<p>He stressed that this proposal reflects the political maturity and lived realities of Singaporean youths. He emphasized that this wasn’t just about numbers, but about recognising the lived realities of young Singaporeans — many of whom are already participating in national defence, yet remain excluded from civic decisions that affect their future.</p>\n<p>Aside from putting forth RDU’s strategies and policy approaches, the party also introduced two key ground leads who will spearhead engagement efforts at Jurong East-Bukit Batok GRC ahead of the General Election.</p>\n<h3>Liyana Dhamirah</h3>\n<p>Liyana , who contested Jurong GRC under RDU in GE2020, brings with her a message of compassion and inclusivity. In a forthcoming interview with <i>The Independent</i>, she shared how interactions with elderly residents, especially their unwavering sense of dignity despite hardship, moved her deeply.</p>\n<p>“Dignity is not a luxury. Kindness is not charity. These are responsibilities we owe one another,” she said during her address.</p>\n<p>She promised to keep listening to residents’ needs, adding that real progress is only meaningful if no one is left behind.</p>\n<h3>Harish Mohanadas</h3>\n<p>A former infrastructure engineer turned principal software engineer, Harish represents a new generation of Singaporeans — technically skilled, socially conscious, and tired of systemic barriers.</p>\n<p>“I’ve worked on complex systems. I care about making things work — for everyone.”</p>\n<p>Harish candidly shared how he once felt like an outsider in Singapore’s system, but through sheer resilience and commitment to innovation, he carved out his place in both public infrastructure and software development. He sees parallels between his journey and fellow Singaporeans facing similar struggles.</p>\n<h3>Looking Ahead</h3>\n<p>While the candidates for Jurong East-Bukit Batok GRC have not yet been confirmed, Mr Philemon emphasized that RDU will continue to earn residents’ trust before making formal announcements.</p>\n<p>He said, “We don’t talk about chances or outcomes — we talk about service. If and when elections are called, we will be ready, with the right team and the right intent.”<br/>\n<!--/data/user/0/com.samsung.android.app.notes/files/clipdata/clipdata_bodytext_250405_151443_454.sdocx--></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/ge2025-rdu-unveils-people-first-vision-in-jurong-east-bukit-batok-grc-campaign-kick-off/",
            "pub_date": "2025-04-06 07:01:23",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OCBC to add up to 30 relationship managers in Greater China team as Hong Kong’s wealthy turn to Singapore banks for asset parking",
            "description": "<p>SINGAPORE: OCBC’s private banking arm, Bank of Singapore, is looking to hire 20 to 30 new relationship managers this year for its Greater China team. Mr Rickie Chan, who oversees the Bank of Singapore’s Greater China market, said financial activity in Hong Kong has picked up with more high-net-worth (HNW) individuals looking to keep their assets with a Singapore bank.</p>\n<p>Following his time as an executive at Credit Suisse, Mr Chan joined the bank about a year ago and set a goal to grow client assets by 50 per cent by the end of 2026. His team, based in Hong Kong, is now on track to meet that target.</p>\n<p><em>Bloomberg</em> reported that OCBC’s expansion comes as other banks like UBS and DBS are also growing their private banking teams in Hong Kong to tap into the region’s wealthy client base.</p>\n<p>While China continues to face slower economic growth and a property crisis, wealth managers still see strong long-term potential in the market.</p>\n<p>According to the latest Global Financial Centres Index, reported by the <em>South China Morning Post </em>(SCMP), Hong Kong kept its position as Asia’s top financial centre and ranked third globally. It has pulled ahead of Singapore and is closing in on New York.</p>\n<p>This year, the Bank of Singapore has already increased its headcount in Hong Kong by nearly 30%. Mr Chan, who spent almost ten years at Credit Suisse, said the Greater China market still has “huge” growth potential. He added that if the right talent is available, the bank hopes to bring in 20 to 30 new bankers this year.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"ud3bdee1d35f39af0d0d2f212c49f751b\" href=\"https://theindependent.sg/ocbc-prices-450m-perpetual-capital-securities-first-callable-set-for-2029/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">OCBC prices $450M perpetual capital securities; first callable set for 2029</span></div></a></div><p>Mr Chan took on a broader role in February and now oversees relationship managers serving Chinese clients based in Singapore on top of his Hong Kong responsibilities.</p>\n<p>The Greater China team is the Bank of Singapore’s second-largest by assets under management, just behind its Southeast Asia unit. As of end-2024, sources familiar with the matter said that the bank managed over US$120 billion (S$161 billion), with a headcount nearing 500. Clients can choose between Singapore and Hong Kong when deciding where to place their assets.</p>\n<p>In 2024, OCBC brought in around US$21 billion in new funds across its wealth management units, chief executive Helen Wong told analysts during the bank’s earnings call in February. However, the bank did not provide a breakdown of its private banking unit.</p>\n<p>Meanwhile, Hong Kong has been introducing tax breaks and residency schemes to attract the wealthy as it works to rebuild after years of political unrest, strict pandemic controls and population outflows.</p>\n<p>Bloomberg Intelligence estimates that these efforts could help the city nearly double its private wealth assets under management to US$2.3 trillion by 2030, with more Chinese investors looking to diversify offshore.</p>\n<p>Mr Chan noted growing activity from Greater China clients, including increased trading and new accounts. He added that Singapore’s pull of the rich for asset diversification is not a one- or two-year phenomenon but could be a decades-long trend. /<a href=\"https://theindependent.sg/\">TISG</a><span class=\"Apple-converted-space\"> </span></p>\n<p>Read also: <a href=\"https://theindependent.sg/hong-kong-pulls-ahead-of-singapore-in-family-office-race-for-now-as-both-cities-face-economic-hurdles/\" title=\"Permalink to: Hong Kong pulls ahead of Singapore in family office race, for now, as both cities face economic hurdles\">Hong Kong pulls ahead of Singapore in family office race, for now, as both cities face economic hurdles</a></p>\n<p><i>Featured image by </i><a href=\"https://depositphotos.com/stock-photography.html\" rel=\"noopener\" target=\"_blank\"><i>Depositphotos</i></a><i> (for illustration purposes only)</i></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/ocbc-to-add-up-to-30-relationship-managers-in-greater-china-team-as-hong-kongs-wealthy-turn-to-singapore-banks-for-asset-parking/",
            "pub_date": "2025-04-05 17:11:14",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "If you liked Undercover High School, here are four K-dramas to watch",
            "description": "<p>KOREA: As reported by Soompi, <em>Undercover High School</em> was a hit. Cool NIS agent Jeong Hae Seong is played by Seo Kang Jun, who disguises himself as a high school student for a tricky mission. As an actor, he displayed range, such as showcasing his knack for comedy, acing the action sequences, and articulating the emotions of his role with ease.</p>\n<figure aria-describedby=\"caption-attachment-661118\" class=\"wp-caption aligncenter\" id=\"attachment_661118\" style=\"width: 3500px\"><img alt=\"\" class=\"size-full wp-image-661118 lazyload\" data-sizes=\"(max-width: 3500px) 100vw, 3500px\" data-src=\"https://media.theindependent.sg/wp-content/uploads/2025/04/jinkijoo-fotor-2025040513164.jpg\" data-srcset=\"https://media.theindependent.sg/wp-content/uploads/2025/04/jinkijoo-fotor-2025040513164.jpg 3500w, https://media.theindependent.sg/wp-content/uploads/2025/04/jinkijoo-fotor-2025040513164-300x169.jpg 300w, https://media.theindependent.sg/wp-content/uploads/2025/04/jinkijoo-fotor-2025040513164-1024x575.jpg 1024w, https://media.theindependent.sg/wp-content/uploads/2025/04/jinkijoo-fotor-2025040513164-768x431.jpg 768w, https://media.theindependent.sg/wp-content/uploads/2025/04/jinkijoo-fotor-2025040513164-1536x863.jpg 1536w, https://media.theindependent.sg/wp-content/uploads/2025/04/jinkijoo-fotor-2025040513164-2048x1150.jpg 2048w, https://media.theindependent.sg/wp-content/uploads/2025/04/jinkijoo-fotor-2025040513164-1280x720.jpg 1280w\" decoding=\"async\" height=\"1966\" src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 3500px; --smush-placeholder-aspect-ratio: 3500/1966;\" width=\"3500\"/><figcaption class=\"wp-caption-text\" id=\"caption-attachment-661118\">Photo: Instagram/Jin Ki Joo</figcaption></figure>\n<p>Oh Soo Ah, the feisty homeroom teacher, was played by Jin Ki Joo, who complimented him. The actors kept us entertained during the show despite the fact that there could be more romance between them. Here are four K-dramas if you miss the show.</p>\n<h2>I’ll Go to You When the Weather is Nice</h2>\n<p>Jeong Hae Seong, played by Seo Kang Jun, maybe a daredevil NIS agent, but he also has a sensitive and compassionate side. In this drama, he plays an optimistic bookstore owner named Eun Seob. He is content with everything and embraces a small-town life as an introvert. He is always ready to lend a helpful hand to those around him and is always thoughtful and compassionate.</p>\n<p>Mok Hae Won, played by Park Min Young, is helped by him to mend her broken self-esteem as she moves back to town. She is a cellist who is burnt out and emotionally spent. Eun Seob, her former classmate, helps her out, and they learn how to heal and love.</p>\n<h2>Watcher</h2>\n<p>Jeong Hae Seong is skilled when it comes to outsmarting his adversaries in <em>Undercover High School</em>. In <em>Watcher</em>, Kim Young Goon, played by Seo Kang Jun, is an aloof police officer. An incident in the past traumatised him. Do Chi Kwang (Han Suk Kyu) and Han Tae Joo (Kim Hyun Joo) partner up to investigate and find out the rampant corruption in the police force. Despite repercussions along the way, Young Goon is adamant about finding out the truth.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"u963c687f5703eba289c116bb76e104c0\" href=\"https://theindependent.sg/top-korean-dramas-to-watch-out-for-in-2021/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Top Korean dramas to watch out for in 2021</span></div></a></div><h2>Are You Human, Too?</h2>\n<p>Seo Kang Jun has a funny and romantic side to him, as evident in <em>Undercover High School</em>. In <em>Are You Human, Too?</em>, we get to see this side as well. He plays Nam Shin, the son of an elite family. After an accident, he falls into a coma. A robot that looks like him was created by his mother. It learns the human mannerisms of Nam Shin and replaces him in the real world. Seo Kang Jun’s journey comes with several misadventures and unexpected love angles as robot Nam Shin III adapts to humans and their world.</p>\n<h2>Come and Hug Me</h2>\n<p>In <em>Undercover High School</em>, Jin Ji Koo plays Korean history teacher Oh Soo Ah, who missed her childhood crush. In <em>Come and Hug Me</em>, she plays an actress named Jae Yi, who is unable to forget her tragic past. She is tied by the chains of their traumatic past with childhood sweetheart Chae Do Jin (Jang Ki Yong). Do Jin is trying to atone for the sins of his father. He is also a detective. Can Jae Yi and Do Jin get closure from their tragic past and find a happy future together?</p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/if-you-liked-undercover-high-school-here-are-four-k-dramas-to-watch/",
            "pub_date": "2025-04-05 13:41:16",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dee Hsu denies that the late Barbie Hsu’s jewellery has been sold at auction houses",
            "description": "<p>TAIWAN: As reported by Dimsum Daily, Barbie Hsu passed on Feb 2 during a trip to Japan, where she contracted pneumonia. On Mar 15, her family, who have been devastated as they come to terms with her death, laid her to rest.</p>\n<p>Recently, a rumour surfaced that the actress’ jewellery, which was supposed to be for her daughter, had appeared at auction houses, enraging Hsu’s sister, Dee Hsu.</p>\n<p>According to VnExpress, Dee Hsu denied selling her sister’s jewellery, calling it ‘fabricated.’ Photos of a beautiful Bulgari diamond necklace, which was said to belong to Hsu, have been seen online, and the Taiwanese media are asking the family matriarch about this.</p>\n<figure aria-describedby=\"caption-attachment-642444\" class=\"wp-caption aligncenter\" id=\"attachment_642444\" style=\"width: 1001px\"><img alt=\"\" class=\"size-full wp-image-642444 lazyload\" data-sizes=\"(max-width: 1001px) 100vw, 1001px\" data-src=\"https://media.theindependent.sg/wp-content/uploads/2025/02/barbie-fotor-20250203134652.jpg\" data-srcset=\"https://media.theindependent.sg/wp-content/uploads/2025/02/barbie-fotor-20250203134652.jpg 1001w, https://media.theindependent.sg/wp-content/uploads/2025/02/barbie-fotor-20250203134652-300x169.jpg 300w, https://media.theindependent.sg/wp-content/uploads/2025/02/barbie-fotor-20250203134652-768x432.jpg 768w\" decoding=\"async\" height=\"563\" src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 1001px; --smush-placeholder-aspect-ratio: 1001/563;\" width=\"1001\"/><figcaption class=\"wp-caption-text\" id=\"caption-attachment-642444\">Photo: Instagram/Barbie Hsu</figcaption></figure>\n<h2>Not even a penny left</h2>\n<p>Their mother condemned the actions of an unnamed person, saying that she had anticipated that he would behave this way, talking about Barbie’s ex-husband Wang Xiaofei. She said that she had dedicated her life to her children, but now, there was not even a penny left for her.</p>\n<p>She added that she did not consider what to divide and could not comprehend the wickedness of such a mindset. As for Dee, who is grieving over the loss of her sister, Barbie’s passing feels like the earth has collapsed. She often thinks about her and continues writing songs for her. She said she had to muster the strength to return to work, knowing that Barbie wanted her to cherish and continue her career.</p>\n<p>Dee cannot believe that people continue to spread lies and tarnish Barbie’s memory, even in death. She added that she wants to ask them what more they want when she is gone and what more they seek. As reported by Next Apple, Dee and her mother were targeted by the public when rumours started claiming that the pair and DJ Koo, Barbie’s husband, were selling the late actress’ jewellery, which was supposed to be part of the inheritance for her children.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"u83654888ec4026c33d150602fd139b93\" href=\"https://theindependent.sg/maid-gets-fired-after-s100k-worth-of-cash-jewellery-missing-when-employer-returns-from-overseas/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Maid gets fired for kneeling by the door after cash &amp; jewellery worth S$100K goes missing from employer's home</span></div></a></div><h2>Barbie asked Hsu to cherish her work</h2>\n<p>Dee denied the claims and expressed frustration at the rumours. She felt powerless as the allegations continued online. Dee has not returned to work, and it has been two months since Barbie’s passing. She is focused on writing a song in memory of Barbie. As Barbie always asked her to cherish her work, Dee encouraged herself to pursue her career as a TV host and singer.</p>\n<p>In 1994, the Hsu sisters gained fame as part of the pop duo SOS, which stands for Sisters of Shu (an alternative spelling of Hsu). Their stage names are Big S and Little S. Due to contractual disputes, the group name was rebranded as ASOS. Catchy love songs like “Ten Minutes of Love” made the sisters popular with the audiences.</p>\n<p>As their growing success as TV hosts continued, their music careers eventually took a backseat. Famous for roles in hit TV dramas such as “<em>Meteor Garden</em>,” “<em>Mars</em>,” and “<em>Summer’s Desire</em>,” Barbie became more popular as Dee also became popular for “<em>Kangsi Coming</em>“.</p>\n<div class=\"code-block code-block-36\">According to a ruling by a Taiwanese court, Barbie’s assets, estimated at NT$600 million (S$24.4 million), will be divided between her husband, DJ Koo, as well as her two children from her previous marriage to Chinese businessman Wang Xiaofei.</div>\n<p class=\"Normal\">\n</p> \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/dee-hsu-denies-that-the-late-barbie-hsus-jewellery-has-been-sold-at-auction-houses/",
            "pub_date": "2025-04-05 13:21:21",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tweet about Singapore creating the ‘world’s most efficient healthcare system’ gets 3.5 million views",
            "description": "<p class=\"p1\">SINGAPORE: A thread on X (formerly Twitter) on how Singapore “created the world’s most efficient healthcare system from scratch in one generation”, posted on Apr 2, has gone viral, getting 3.5 million views just this week.</p>\n<p class=\"p1\">Its author, a US-based entrepreneur named Justin Mares, who founded TrueMed and other startups, explained the differences between how Singapore and the US have approached healthcare. From the beginning of his thread, he pointed out that while Singapore spends $4,000 (S$<span class=\"relative -mx-px my-[-0.2rem] rounded-sm px-px py-[0.2rem]\">5,341</span>) per person on healthcare, the US spends $15,000.</p>\n<p class=\"p1\">He traced this back to the choices made by the government of founding Prime Minister Lee Kuan Yew before the 1960s when Singapore’s gross domestic product (GDP) was low, and the ratio of doctors to the population was quite small.</p>\n<p><img alt=\"\" class=\"aligncenter wp-image-661025 size-full lazyload\" data-sizes=\"(max-width: 4000px) 100vw, 4000px\" data-src=\"https://media.theindependent.sg/wp-content/uploads/2025/04/tweet-SG-healthcare-scaled.jpg\" data-srcset=\"https://media.theindependent.sg/wp-content/uploads/2025/04/tweet-SG-healthcare-scaled.jpg 4000w, https://media.theindependent.sg/wp-content/uploads/2025/04/tweet-SG-healthcare-300x280.jpg 300w, https://media.theindependent.sg/wp-content/uploads/2025/04/tweet-SG-healthcare-1024x956.jpg 1024w, https://media.theindependent.sg/wp-content/uploads/2025/04/tweet-SG-healthcare-768x717.jpg 768w, https://media.theindependent.sg/wp-content/uploads/2025/04/tweet-SG-healthcare-1536x1435.jpg 1536w, https://media.theindependent.sg/wp-content/uploads/2025/04/tweet-SG-healthcare-2048x1913.jpg 2048w\" decoding=\"async\" height=\"3736\" src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 4000px; --smush-placeholder-aspect-ratio: 4000/3736;\" width=\"4000\"/></p>\n<p class=\"p1\">Despite this, Singapore chose to make healthcare its fifth priority after international recognition, defence capabilities, economic development, and housing.</p>\n<p class=\"p1\">“Why? Building wealth creates resources for healthcare,” Mr Mares wrote, explaining Singapore’s “secret weapon most analysts miss: The ‘outpatient dispensary’ network.”</p>\n<p class=\"p1\">Singapore first built small healthcare facilities that were extensions of larger hospitals or healthcare centres that provided primary healthcare services before the government invested in more expensive hospitals.</p>\n<p class=\"p1\">“They moved most primary care away from expensive hospitals to these clinics that former Health Minister Khaw Boon Wan called ‘low-hanging fruit,’” Mr Mares explained, noting its “High return on low investment.”</p>\n<p class=\"p1\">He went on to show how Medisave, the autonomy and price transparency of public hospitals, how polyclinics work, how the number of doctors has increased over the years, and so on. The proof of Singapore’s success has been increased life expectancy, which is one of the highest in the world.</p>\n<p class=\"p1\">Mr Mares also listed suggestions for the US to “implement Singapore-style reforms,” which includes insurance reform.</p>\n<p class=\"p1\">For him, by far, the most crucial element is for the “Government as a system architect, not just payer. This means regulating hospital expansion, managing doctor supply, controlling medical school seats, and setting price ceilings. Not full control, but smart oversight,” although he admitted that this may not be popular with many.</p>\n<p class=\"p1\">He ended his thread by writing, “Could the US implement these reforms? Politically, it would be incredibly difficult, but with healthcare bankrupting families and crippling businesses, we’re running out of alternatives. The Singapore model isn’t perfect, but it’s better than what we have now.”</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"u9c08e6e0869c7a070e437f0791561a8d\" href=\"https://theindependent.sg/tan-cheng-bock-and-shanmugam-all-smiles-as-political-challenge-looms/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Tan Cheng Bock and Shanmugam all smiles as political challenge looms</span></div></a></div><p class=\"p1\">On r/Singapore, where the tweet thread was shared, the Americans who commented agreed that their healthcare system leaves much to be desired, especially for people who do not have a lot of resources.</p>\n<p class=\"p1\">“The US is completely two-tiered and depends almost exclusively on your employer/access to different health plans. It’s either great or (otherwise), and a lot of people don’t get this, but in the US, what health insurance a company offers can be a key deciding factor in choosing a job offer,” one wrote.</p>\n<p class=\"p1\">A commenter added, “Previously, for the price of insulin per month in the US, you could get a Nintendo Switch 2. Imagine needing to have the money to buy a Nintendo Switch 2 every month just to survive.”</p>\n<p class=\"p1\">Another recalled: “Anecdotes of how people need to set up gofundmes to afford healthcare, or those people in ambulances who insist on being brought to a different hospital (which may not be the nearest) so that the medical care can be covered under their insurance.”</p>\n<p class=\"p1\">A Singaporean commented, “Our healthcare isn’t 100% free because LKY looked at the UK’s NHS and believed that making healthcare 100% free will cause citizens to neglect their health, so he wanted the citizens to pay something reasonable but not too high. We also have a safety net to provide free healthcare for those who really cannot afford it.”</p>\n<p class=\"p1\">Another agreed, writing, “We have multiple safety nets for people who know where to look. If people need, go to an MTP session, and people can point you in the right direction.”/TISG</p>\n<p>Read also: <a href=\"https://theindependent.sg/sporeans-cheer-pay-bump-for-healthcare-workers-but-some-wonder-if-its-an-election-year-perk/\" title=\"Permalink to: S’poreans cheer pay bump for healthcare workers, but some wonder if it’s an election-year perk\">S’poreans cheer pay bump for healthcare workers, but some wonder if it’s an election-year perk</a></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/tweet-about-singapore-creating-the-worlds-most-efficient-healthcare-system-gets-3-5-million-views/",
            "pub_date": "2025-04-05 12:01:20",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI takeover? Why workers in Southeast Asia fear losing their jobs to automation",
            "description": "<p>SOUTHEAST ASIA: Escalating all over the world, especially in Southeast Asia, is the fear that artificial intelligence (AI) will negatively impact people’s livelihoods. There is a huge percentage of working individuals fearing for their jobs compared to those who are optimistic about technology adaptation and the benefits it might bring.</p>\n<p>A recent Ipsos study featured in a People Matters Global article found that 65% of respondents in 31 countries and regions fear AI will result in work dismissals and outright job losses—up from 64% last year. This apprehension is predominantly noticeable in Southeast Asia, where AI-driven dislocation appears to be an imminent certainty.</p>\n<p>A staggering 73% of Malaysian workers voiced unease about AI substituting jobs.</p>\n<p>In Indonesia (85%) and the Philippines (81%), the fear is more profound as workers prepare for automation’s increasing impact. Even in Singapore, which is considered to be advanced, an astounding 67% of respondents are anxious that AI could result in extensive job losses.</p>\n<p>These statistics accentuate the region’s mounting disquiet as AI acceptance and implementation accelerate and as AI tools streamline industries and redesign job structures.</p>\n<p>While AI can potentially generate new jobs, confidence is in short supply. The Ipsos study disclosed that only 43% of those surveyed around the world believe AI will produce more work engagement, highlighting an unmistakable gap between prospects of job loss and job creation.</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"u070aa3da6f4f0ad5c3559e39a1b888e5\" href=\"https://theindependent.sg/singapore-central-bank-pledges-100m-to-boost-ai-and-quantum-technologies-in-finance/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">Singapore central bank pledges $100M to boost AI and quantum technologies in finance</span></div></a></div><p>China is an exception, as 77% of respondents believe AI will mean more jobs, not job loss or displacement. This dissimilarity advocates that a country’s economic guidelines, workforce compliance, and AI-driven investments considerably form public awareness.</p>\n<p>The World Economic Forum’s current Future of Jobs report exacerbates the anxiety, affirming that 41% of companies worldwide intend to cut their workforce by 2030 because of AI-driven mechanization. This reinforces the idea that industries will require fewer human workers as AI develops.</p>\n<p>However, the same report underscores that 77% of establishments aim to reskill or upskill their personnel to work together with AI. This proposes that organizations recognize the necessity of balancing automation with human engagement.</p>\n<p>To offset AI-related apprehensions, specialists highlight the value of adaptability. Workers should view AI as an instrument of efficiency rather than an unswerving rival.</p>\n<p>“AI can appear sinister at first glance–an otherworldly force poised to replace human expertise, yet understanding and harnessing AI can open doors to innovation, efficiency, and personal growth. We might be surprised by how beneficial it can be to step closer,” said Jonathan Gabay, a senior lecturer at Oxford College of Marketing in the UK.</p>\n<p>Refining capabilities, like ingenuity, critical thinking, and problem-solving abilities, where AI still struggles, can provide workers with resilience in an ever-shifting job market.</p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/ai-takeover-why-workers-in-southeast-asia-fear-losing-their-jobs-to-automation/",
            "pub_date": "2025-04-05 11:51:26",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gen Z Singaporean wants to stay single and child-free for life, to the dismay of their parents",
            "description": "<p class=\"p1\">SINGAPORE: A young local took to Reddit to ask for advice, explaining that their parents do not support their “firm decision” to stay single for life, feeling that they are too young to make such a choice. The post author asked users on the platform about what life is like as a single in Singapore, especially in the longer run, when they are older.</p>\n<p class=\"p1\">In an April 2 (Wednesday) post on <span class=\"s1\">r/askSingapore, they explained that they’re still a student. At this point, they have no plans to date, get married, or have a family and children, and they enjoy independence and plan to live alone.</span></p>\n<p class=\"p4\">A big reason for this appears to be the fact that they are self-described “extreme introverts,” and their experience of family life as the oldest of five siblings has been stressful.</p>\n<p class=\"p1\"><span class=\"s1\">“</span>I just plan to study hard, get into local Uni, be employed in a job I’m passionate about and explore adulthood life. My parents think I’m too young to say all these things, but staying single will make my life less stressful. I’m someone who values freedom and quietness in a home. I understand loneliness is a huge factor, but I enjoy spending time alone and am much used to it,” the post author wrote.</p>\n<p class=\"p1\">There have been many commenters on the post so far. One, who identified themself as a fellow, but older single, wrote, “I can tell you, there will be more pressure from parents who don’t understand.”</p>\n<p class=\"p1\">Adding that they are learning to cope with parental pressure, they told the post author, “TBH, it’s a lot better to be single and happy than to be attached and miserable.”</p>\n<p class=\"p1\">Another told the post author, “You don’t have to tell your parents you want to be single for life. Just do it. By a certain age, if you don’t date or get married, they would accept that singlehood would be a permanent state.”</p>\n<p class=\"p1\">They added, however, that their married friends tend to have less time for hanging out after they have kids, which leaves them with their single friends, with whom they can share “common non-marriage and non-kids topics.”</p>\n<div style=\"clear:both; margin-top:0em; margin-bottom:1em;\"><a class=\"u2d962b05d0a0dd7a2bf6b43c3adae829\" href=\"https://theindependent.sg/youre-a-bto-partner-not-a-wife-netizen-tells-woman-whose-husband-barely-communicates-with-her/\" rel=\"dofollow\" target=\"_blank\"><!-- INLINE RELATED POSTS 1/1 //--><div style=\"padding-left:1em; padding-right:1em;\"><span class=\"ctaText\">See also</span>  <span class=\"postTitle\">“You're a BTO partner, not a wife” — Netizen tells woman whose husband barely communicates with her</span></div></a></div><p class=\"p1\">As for the single life in Singapore, one wrote, “Life is flexible. I got money from working all these years. Eat whatever I want, buy whatever I want, go overseas a few times every year to countries I want, whenever I want — just solo travel. It’s super chill. In fact, I am dragging a [piece of] luggage right now on the way to the airport. Haven’t got my house yet, but I’m not worried about not being able to afford it.”</p>\n<p class=\"p1\">Another chimed in to say, “The solo travelling is ‘sooo’ worth it, la. I love photography, and being able to take my time to capture the shots is huge for me. Couldn’t imagine anything else right now other than my next trip.”</p>\n<p class=\"p1\">Not that they’re<span class=\"s1\"> alone in their choice to not get married and have children one day, though the reasons others give have been somewhat different. Around the world, more and more millennials and Gen Zers have expressed the same sentiments, in part due to concerns about high living costs, the environment, global tensions, and other reasons.</span></p>\n<p class=\"p1\"><span class=\"s1\">A 2024 US survey from Mass Mutual said that the number of young adults who are choosing this route could be as high as <a href=\"https://www.cbsnews.com/news/millennials-gen-z-childless-money-finances-massmutual/\" rel=\"noopener\" target=\"_blank\"><span class=\"s2\">one in four</span></a>. In 2021, The Guardian reported that in the UK, <a href=\"https://www.theguardian.com/society/2021/apr/23/i-had-second-thoughts-the-gen-z-ers-choosing-not-to-have-children#:~:text=Gen%20Z%20is%20coming%20of,strain%20on%20an%20overpopulated%20planet.\" rel=\"noopener\" target=\"_blank\"><span class=\"s2\">one in ten</span></a> 18- to 23-year-olds were thinking about not having kids.</span></p>\n<p class=\"p1\"><span class=\"s1\">In Singapore, w</span>ith the birth rate falling and society ageing quickly, young people were asked how they felt about this “crisis” in an <i>Asian Boss</i> interview posted on YouTube on Nov 7. Many cited the rising cost of living when asked about the leading contributing factors to the declining birth rate. /TISG</p>\n<p class=\"p1\">Read also: <a href=\"https://theindependent.sg/young-singaporeans-say-sgs-high-cost-of-living-may-be-the-top-reason-for-singapores-low-birth-rate/\"><span class=\"s3\">Young Singaporeans say SG’s high cost of living may be the top reason for Singapore’s low birth rate</span></a></p>\n \n\n<div class=\"clearfix mb-3\"></div>",
            "link": "https://theindependent.sg/gen-z-singaporean-wants-to-stay-single-and-child-free-for-life-to-the-dismay-of-their-parents/",
            "pub_date": "2025-04-05 11:51:19",
            "source": "theindependent",
            "kind": 1,
            "language": "en"
        }
    ]
}