{
    "data": [
        {
            "title": "Circle (CRCL): A Regulatory Catalyst Ignites a Crypto Legitimacy Revolution",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>The U.S. Senate's approval of the GENIUS Act (Guiding and Establishing National Innovation for U.S. Stablecoins) on June 17, 2025, marked a historic inflection point for the cryptocurrency industry. For Circle Internet Group (CRCL), the legislation's passage catalyzed a stock surge of over 500% since its June 5 IPO, with shares climbing from $31 to nearly $200 by mid-June. This article examines how regulatory clarity is transforming stablecoins from speculative instruments into legitimate financial tools—and why investors should heed the opportunity.  </p><p><img alt=\"\" data-src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1ade55dfecc20002.png\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1ade55dfecc20002.png\" style=\"max-width:100%;\"/></p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">The Regulatory Breakthrough: Why the GENIUS Act Matters</h3><p>The GENIUS Act's bipartisan 68-30 Senate vote established the first federal framework for stablecoins, a $250 billion market. Key provisions include:<br/>- <strong>Reserve Requirements</strong>: Issuers must back stablecoins 1:1 with cash or Treasuries, ending reliance on opaque “basket” reserves.<br/>- <strong>Transparency</strong>: Monthly audits and public reserve disclosures.<br/>- <strong>Oversight</strong>: Large issuers ($10B+ in assets) fall under Fed/OCO regulation; smaller ones under state oversight.  </p><p>For Circle, the bill's passage is a lifeline. Its USDC stablecoin—$61.4B in market value—now operates under a clear regulatory umbrella, reducing existential risks tied to prior uncertainty. The legislation also bans non-financial tech giants (Amazon, Meta) from issuing stablecoins without partnering with regulated entities, curbing potential monopolistic competition.  </p><p><!-- --></p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Why This Is a Paradigm Shift for Crypto</h3><p>The GENIUS Act achieves three critical goals:<br/>1. <strong>Consumer Protection</strong>: Ends the Wild West era of unregulated stablecoins, where Tether's $88B reserves were once revealed to hold just 2% cash.<br/>2. <strong>Systemic Stability</strong>: Prevents “runs” on under-reserved stablecoins, which nearly collapsed crypto markets in 2023.<br/>3. <strong>Legitimacy</strong>: Paves the way for institutional adoption, as banks and corporations (Walmart, Apple) explore stablecoin issuance.  </p><p>Treasury Secretary Scott Bessent's projection of a $2 trillion U.S. stablecoin market by 2030 is no exaggeration. With Circle's USDC already powering 40% of crypto transactions, its infrastructure could become the “money rail of the internet,” as CEO Jeremy Allaire asserts.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Risks and Uncertainties</h3><p>The path to $2 trillion is not without hurdles:<br/>- <strong>House Negotiations</strong>: The STABLE Act in the House seeks to decentralize oversight, risking dilution of the Senate's Fed-centric framework.<br/>- <strong>Executive Branch Tensions</strong>: President Trump's family ties to World Liberty Financial—a USD1 stablecoin issuer—raise ethical concerns, though not directly impacting Circle.<br/>- <strong>Global Competition</strong>: Tether's dominance in offshore markets and the EU's MiCA regulations could fragment the industry.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Investment Thesis: Buy the Dip, but Watch the House</h3><p>Circle's valuation reflects a market already pricing in regulatory tailwinds. However, two catalysts remain:<br/>1. <strong>House Passage</strong>: If the STABLE Act converges with the Senate's vision, CRCL could rally further.<br/>2. <strong>Institutional Adoption</strong>: As banks issue stablecoins, USDC's transaction volume—and Circle's revenue—will surge.  </p><p>Analyst Jeff Cantwell's $235 price target (Seaport Global) assumes a $20B valuation by 2028, aligning with Bessent's projections. For investors, the key is to:<br/>- <strong>Buy on dips below $180</strong>, using the $150-$160 range as support.<br/>- <strong>Avoid overexposure</strong>: Legislative delays or House compromises could trigger volatility.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Conclusion: The Dawn of Crypto's Institutional Era</h3><p>The Senate's vote is not merely a regulatory milestone—it's a signal that crypto is evolving from a libertarian experiment into a mainstream financial tool. Circle, as the USDC gatekeeper, stands to profit disproportionately. While risks linger, the long-term trajectory is clear: stablecoins are here to stay, and CRCL is positioned to lead the charge.  </p><p><strong>Final Recommendation</strong>: Investors seeking exposure to crypto's institutionalization should accumulate CRCL at current levels, with a focus on dollar-cost averaging through legislative uncertainty. This is a multi-year play—a regulatory catalyst that could redefine finance itself.</p></div></div></div>",
            "link": "https://www.ainvest.com/news/circle-crcl-regulatory-catalyst-ignites-crypto-legitimacy-revolution-2506/",
            "pub_date": "2025-06-20 23:20:33",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla's Robotaxi Launch: A Risky Gamble on Overhyped Autonomy?",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>The much-anticipated launch of Tesla's Robotaxi service in Austin, Texas, on June 22, 2025, has sparked heated debate among investors, regulators, and industry experts. While CEO Elon Musk has framed this as a milestone in the “quest for true autonomy,” a closer examination reveals a stark disconnect between Tesla's bold claims and the operational and regulatory realities of its technology. This article argues that Tesla's reliance on teleoperation, geofencing, and rushed timelines poses significant risks to its valuation, particularly as overhyped expectations collide with unresolved safety issues and competitive shortcomings.  </p><p><img alt=\"\" data-src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1ade131f24d38002.png\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1ade131f24d38002.png\" style=\"max-width:100%;\"/></p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Regulatory Risks: A Race Against the Clock</strong></h3><p>Tesla's June 22 launch date faces mounting pressure from Texas lawmakers, who have requested a delay until September 1 to align with new autonomous vehicle regulations. These rules require <a class=\"news-link\" data-code=\"TSLA\" data-marketid=\"185\" data-position=\"stock.2\" data-stockname=\"Tesla\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/NASDAQ-TSLA/\">Tesla</a> to prove compliance with safety standards, including the ability to achieve a “minimal risk condition” in system failures and provide detailed plans for emergency responder coordination. While Texas has historically been lenient on autonomous vehicle regulations, the stakes are now higher: a premature launch could expose Tesla to liability if incidents occur, especially after its Full Self-Driving (FSD) system failed to stop for a school bus in a recent safety test by The Dawn Project.  </p><p>The National Highway Traffic Safety Administration (NHTSA) is also scrutinizing Tesla's FSD system, investigating collisions linked to poor visibility conditions. Tesla has yet to respond to NHTSA's June 19 deadline for providing safety data, raising concerns about transparency. If regulators force a delay—or worse, penalize Tesla for noncompliance—the reputational and financial fallout could be severe.  </p><p><!-- --></p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Operational Scalability: The Limits of “Unsupervised” Autonomy</strong></h3><p>Tesla's Robotaxi service hinges on two crutches: <strong>teleoperation</strong> and <strong>geofencing</strong>, both of which undermine its narrative of “true autonomy.”  </p><ol><li><p><strong>Teleoperation: A Crutch, Not a Solution</strong><br/>Tesla employs remote operators to monitor vehicles and intervene in emergencies, such as stuck intersections or system failures. While this adds a safety layer, it also highlights Tesla's unresolved technical limitations. Former Waymo CEO John Krafcik has criticized this approach, noting that excessive teleoperation “undermines scalability.” Waymo, by contrast, avoids direct remote control, prioritizing software robustness over human oversight. Tesla's reliance on teleoperation suggests its system remains years behind industry leaders.  </p></li><li><p><strong>Geofencing: A Shrunken Vision</strong><br/>Musk once promised nationwide unsupervised autonomy by 2020. Today, Tesla's Austin launch is confined to “safe neighborhoods,” avoiding intersections it lacks confidence in. Geofencing is a tactical retreat, not a triumph—a stark contrast to Waymo's fully driverless service, which operates without such restrictions in cities like San Francisco. Tesla's plan to expand geofenced zones incrementally raises questions: How long until it achieves true nationwide coverage? And why trust a system that requires constant babysitting?  </p></li></ol><p>The scalability gap is stark: Tesla's Austin pilot will begin with just <strong>10–20 Model Y vehicles</strong>, while Waymo has deployed thousands of fully autonomous cars. Tesla's vision of a million unsupervised FSD-equipped vehicles by 2026 feels more like wishful thinking than a roadmap.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Safety and Liability: The Elephant in the Driver's Seat</strong></h3><p>Safety concerns are not theoretical. The Dawn Project's test revealed Tesla's FSD failed to stop for a school bus and a child-sized dummy—a critical failure in a system marketed as “unsupervised.” Tesla's crowdsourced safety metrics (e.g., 444 miles between disengagements) lack rigor, as they exclude private user data. Meanwhile, Waymo has demonstrated reliability at scale, with zero-at-fault incidents in its driverless fleet.  </p><p>Legal liabilities loom large. Tesla has already faced lawsuits over its delayed FSD promises, and a botched Robotaxi launch could amplify these risks. A single high-profile accident or regulatory fine could trigger a sell-off, especially if investors realize Tesla's autonomy is a work in progress, not a breakthrough.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Investment Implications: Reassess Before Jumping In</strong></h3><p>Tesla's stock has long been priced on Musk's vision, not its execution. But the Robotaxi launch is a stress test: if it falters, the disconnect between hype and reality could hit valuation hard. Key risks to monitor:<br/>- <strong>Regulatory Pushback</strong>: A September delay or fines for noncompliance.<br/>- <strong>Safety Incidents</strong>: Early accidents or recalls eroding trust.<br/>- <strong>Competitor Outperformance</strong>: Waymo's steady expansion could siphon investor interest.  </p><p><!-- --></p><p><strong>Investment Advice</strong>:<br/>Tesla's stock is overvalued relative to its autonomous progress. Investors should wait for concrete evidence before re-upping exposure:<br/>1. <strong>Expand Beyond Geofencing</strong>: Demonstrate urban navigation without restricted zones.<br/>2. <strong>Reduce Teleoperation</strong>: Prove software reliability without human intervention.<br/>3. <strong>Publish Safety Data</strong>: Transparent disengagement metrics and third-party audits.  </p><p>Until then, Tesla's autonomy story remains a gamble—a bet on Musk's charisma over technical rigor. For now, investors are better served by caution.  </p><p><strong>Conclusion</strong><br/>Tesla's Robotaxi launch is less a triumph of innovation than a high-stakes bid to salvage its autonomy narrative. Regulatory hurdles, technical limitations, and Waymo's competitive edge underscore the risks of overhyped expectations. Until Tesla delivers scalability, safety, and compliance, its valuation is built on sand. Investors would be wise to tread carefully—and demand proof before buying in.</p></div></div></div>",
            "link": "https://www.ainvest.com/news/tesla-robotaxi-launch-risky-gamble-overhyped-autonomy-2506/",
            "pub_date": "2025-06-20 23:20:32",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Triple Witching Hits: What It Is, Why It Matters, and What to Expect Next",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>Friday marks a major <a class=\"news-link\" data-code=\"IPCX\" data-marketid=\"185\" data-position=\"stock.3\" data-stockname=\"Inflection Point\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.3\" href=\"https://www.ainvest.com/stocks/NASDAQ-IPCX/\">inflection point</a> in the options market with the arrival of “triple witching,” the quarterly expiration event that has the potential to shake equity markets out of their recent slumber. <strong>With an estimated $6.5 trillion in notional U.S.-listed options expiring—including $4.2 trillion in index options, $819 billion in single-stock options, and another $708 billion tied to ETFs—this particular expiration is one of the largest on record. </strong>While the day itself may not deliver fireworks, the aftermath could.</p><p>So, what exactly is triple witching? The term refers to the simultaneous expiration of three types of derivatives: stock index futures, stock index options, and single-stock options. This happens four times a year—on the third Friday of March, June, September, and December—<strong>and it’s a big deal for one simple reason: positioning. </strong>Large open interest in options means traders, market makers, and institutions need to either unwind or roll over massive exposures. That causes volume to spike, volatility to stir, and often, unusual price behavior to appear—especially in the final <a class=\"news-link\" data-code=\"HOUR\" data-marketid=\"186\" data-position=\"stock.1\" data-stockname=\"Hour Loop\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-HOUR/\">hour</a> of trading, known as the “witching hour.”</p><p>What makes this particular triple witching notable isn’t just the size—it’s the context. Stocks have been unusually calm for the past several weeks, a dynamic helped by the so-called “pinning” effect in the options market. As explained by Asym 500’s Rocky Fishman, <strong>the S&amp;P 500 has been hovering near 5,981 due to heavy concentrations of options open interest near the 6,000 strike. </strong>In April, amid tariff-related uncertainty, many investors bought downside protection by selling upside calls to finance the trade—calls that landed right around that key round number.</p><p><strong>This led to what’s known as a </strong><em><strong>positive gamma</strong></em><strong> environment. In simple terms, dealers who sell those options hedge by buying when the market dips and selling when it rises. </strong>This keeps volatility compressed and explains why equities have been so steady lately, even as geopolitical tensions have flared in the Middle East and economic data has been mixed. <strong>But with those contracts expiring today, that hedging support disappears—opening the door to more directional price action starting next week.</strong></p><p>So what should investors expect from the session itself?</p><p>Interestingly, triple witching days are not necessarily more volatile <em>on the day</em>. <strong>Research from Citigroup strategists Vishal Vivek and Stuart Kaiser shows that major indices like the S&amp;P 500 often trade in relatively narrow bands during the actual expiration. </strong>That’s because the same forces that “pin” a stock to a strike price are at work index-wide. With so many dealers managing exposure around the 6,000 level, for instance, it's very likely we see the index gravitate toward that level as contracts settle.</p><p>However, beneath the surface, individual names can whip around violently. As stock options settle at the close—unlike index options, which settle at the open—names with high open interest at key strikes can see bursts of volume and price swings in the final 30 minutes of trading. Traders should also be aware of unusual activity in ETFs and futures as institutional players rebalance delta exposures and unwind hedges.</p><p><strong>The real story, though, starts Monday.</strong></p><p>Once all the options tied to today’s expiration are cleared, the pinning effect dissolves. This can unshackle stocks from their technical constraints, allowing more organic movement driven by macro news, earnings, or economic surprises. With fewer options creating artificial support or resistance, <strong>volatility tends to rise</strong> in the week following triple witching—especially if a new narrative takes hold.</p><p>This dynamic is even more important now given the broader market setup. The Federal Reserve’s recent policy meeting left investors with more questions than answers. Chairman Jerome Powell called the outlook “foggy,” with the dot plot showing a fragile consensus for two rate cuts this year. <strong>Powell will be given the opportunity to flesh out his monetary policy thoughts as he will testify in front of Congress next week. </strong>Add to that a geopolitical situation that remains fluid—President Trump has given himself a two-week window to decide on possible military action against Iran—and the environment is ripe for a shift in tone.</p><p>Traders should also note the growing influence of <strong>zero-day options</strong> (0DTE), which now account for nearly half of all S&amp;P 500 option volume. These contracts, which expire on the same day they’re traded, have made <em>every</em> afternoon a mini version of triple witching. Institutional players increasingly use them to hedge macro events and index exposure without holding overnight risk. But they can also add to late-day volatility, especially if they are layered on top of a major expiration like today.</p><p>In summary, Friday’s triple witching event may feel calm on the surface, but it's what lies beneath—and what comes next—that matters. The market is on the verge of shedding its recent “pinned” behavior. If new catalysts emerge—be it from the Fed, geopolitics, or earnings—the volatility that’s been hiding in plain sight may finally reappear. For traders, today is a day to watch the tape carefully, but Monday is when things could really start to move.</p><p></p><p></p></div></div></div>",
            "link": "https://www.ainvest.com/news/triple-witching-hits-matters-expect-2506/",
            "pub_date": "2025-06-20 23:10:42",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Powering AI: The Untapped Energy Investment Boom in America’s Heartland",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p></p><p><em><strong>WATCH: AI's Secret Power Source? You Won't Believe Where It's Hiding!</strong></em></p><div data='{\"videoUrl\":\"https://www.youtube.com/embed/qCvYL7O4ZCs\",\"coverUrl\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/AI Needs Power_073d6eb51750277453149.jpg\"}' data-v-4501179a=\"\"><div class=\"iframe-container\" data-v-4501179a=\"\"><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\" data-v-4501179a=\"\" frameborder=\"0\" src=\"https://www.youtube.com/embed/qCvYL7O4ZCs\"></iframe></div></div><p></p><p>As the artificial intelligence (AI) revolution pushes computing demand to unprecedented levels, a less-heralded region of the country is quietly becoming a hotbed for growth investing: the interior U.S. From Utah to Minnesota and Texas to Pennsylvania, growth equity firm Mercato Partners is zeroing in on energy infrastructure as a defining investment theme for the coming decade.</p><p>“We focus on the interior part of the country,” said Joe <a class=\"news-link\" data-code=\"KALU\" data-marketid=\"185\" data-position=\"stock.1\" data-stockname=\"Kaiser Aluminum\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-KALU/\">Kaiser</a>, CEO and Managing Director of Mercato. “We provide late-stage venture capital to disruptive companies,” primarily in the Series B to Series D range, with the goal of scaling companies that have already achieved product-market fit.</p><p>Among the firm’s recent success stories is ad tech company Mountain (MNTN), which recently went public. But increasingly, Kaiser and his team are turning their attention to energy—the kind needed to power AI, data centers, and the electric grid of tomorrow.</p><p>“One of the big veins of opportunity from our point of view is infrastructure,” said Kaiser. “And a big chunk of infrastructure is energy—the energy required to power the future of AI in the United States”.</p><p>Estimates suggest the U.S. will require 150 to 170 gigawatts of new power over the next decade, equivalent to building 30 new natural gas power plants, each at 500 megawatts. And that’s just to keep up with AI’s demands, Kaiser said.</p><p>But meeting this demand is more complex than simply generating electricity. It’s about balance.</p><p>“Electricity has to stay in constant supply-demand balance 24/7,” Kaiser explained. “If supply exceeds demand, power is wasted. If demand exceeds supply, you get rolling blackouts. That’s where we see opportunity—solving AI’s power problems with AI”.</p><p>Mercato has backed    <a class=\"news-link\" data-v-73d4b255=\"\" href=\"https://www.torus.co/our-mission\" target=\"__blank\">Torus, a company </a>coupled with AI to stabilize the grid. “Flywheels provide both a cleansing capability for electricity and storage. They can act like a supercapacitor, instantly pushing power onto the grid when data centers experience demand spikes,” Kaiser said.</p><p>For near-term investment returns, Kaiser points to upgrading existing energy assets. “The two quickest to market opportunities are using assets that already exist—refurbing nuclear or natural gas. No new technology needs to be developed,” he noted. Companies like Meta and Microsoft have recently partnered with utilities to bring nuclear plants back online.</p><p>Over the longer term, small modular reactors and geothermal energy could play a larger role. “Meta and Bill Gates have both invested in geothermal production in the Rocky Mountain area,” said Kaiser, who added that closed-loop geothermal systems—being pioneered by companies like    <a class=\"news-link\" data-v-73d4b255=\"\" href=\"https://fervoenergy.com/\" target=\"__blank\">Fervo Energy</a> and   <a class=\"news-link\" data-v-73d4b255=\"\" href=\"https://www.sagegeosystems.com/\" target=\"__blank\">Sage</a> —show promise but remain private for now.</p><p>Public-private partnerships will likely be essential to meeting energy needs without burdening consumers, Kaiser emphasized. “In Utah, the government told data center owners and utilities: do what you want behind the meter, but don’t impact homeowners’ bills,” he said. “It’s this kind of collaboration that can help avoid passing the buck to the consumer”.</p><p>Kaiser is also paying close attention to the geopolitical and cost implications of energy sources. When evaluating energy investments, he advises looking at two things: the total cost of ownership from construction to decommissioning, and the reliance on foreign components.</p><p>“Nuclear uses uranium, and most of our uranium comes from Canada, Russia, or China. Fusion depends on rare earths, which come from China. That’s the beauty of natural gas—it’s domestic,” he said.</p><p>Uranium, in particular, has seen rising prices due to both increasing demand and the geopolitical risk surrounding its sources. “The U.S. sources only a small percentage of the uranium it uses—low single digits,” Kaiser said. While there are known reserves in Utah and Nevada, regulatory hurdles and long development timelines have kept production low.</p><p>Rare earth elements pose similar challenges. “Utah has 40 of the 50 rare earths and they’re now being mined,” Kaiser noted. “But the process takes time, and we still don’t have the quantities we need. Finding synthetic alternatives is a tremendous long-term investment opportunity”.</p><p>While Mercato isn’t currently invested in rare earth mining, Kaiser said it's \"always on the hunt.\" The firm’s growth equity strategy, however, means it's cautious about ultra-long-horizon plays. “Our investment horizon is shorter than what a lot of these large infrastructure or materials projects require,” he said.</p><p>Still, with energy becoming the new bottleneck for AI, the next decade is shaping up to be a defining era for investors who understand the interplay of infrastructure, policy, and innovation.</p><p>“We’re in the very earliest innings,” said Kaiser. “A lot of power has to be brought online—and quickly”.</p><p></p><p></p></div></div></div>",
            "link": "https://www.ainvest.com/news/powering-ai-untapped-energy-investment-boom-america-heartland-2506/",
            "pub_date": "2025-06-20 23:10:41",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Charts Paint 1000 Words: Two Sectors May Outperform",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>As geopolitical shocks fade and capital flows return to U.S. equities, two sectors stand out with the potential to deliver meaningful excess returns. Which ones—and why now?</p><p>Investors hold very little exposure to energy stocks today, from a relative perspective.This is often the kind of setup that leads to a meaningful shift in positioning.I’m comfortable investing against the consensus here.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/energy_1194117d1750423484590.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/energy_1194117d1750423484590.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/energy_1194117d1750423484590.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/energy_1194117d1750423484590.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>While short-term oil price shocks can create significant economic disruptions and drive inflation higher, oil prices over the long run typically track the general rate of inflation.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/oil price inflation_730542b11750423501969.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/oil price inflation_730542b11750423501969.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/oil price inflation_730542b11750423501969.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/oil price inflation_730542b11750423501969.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Another sector with strong potential for excess returns is aviation. Airbus projects global demand for 43,000 new commercial aircraft over the next 20 years. Currently, there are around 24,730 commercial aircraft in service worldwide. By 2044, only 5,800 of them will still be operational—creating a replacement demand for 18,930 aircraft and an additional need for 24,480 new ones. The new demand alone would match today’s global fleet size.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/airplane_df5b33ed1750423540177.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/airplane_df5b33ed1750423540177.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/airplane_df5b33ed1750423540177.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/airplane_df5b33ed1750423540177.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Despite recent events such as Trump’s reciprocal tariff policy and the Middle East conflict, U.S. equities remain resilient, trading near historic highs. Over a century of market history shows that equities continue climbing through adversity. While geopolitical events can cause significant short-term market disruptions, their long-term impact is usually limited, and markets frequently rebound and continue their upward trajectory.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Crisis stock_7c389e841750423622224.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Crisis stock_7c389e841750423622224.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Crisis stock_7c389e841750423622224.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Crisis stock_7c389e841750423622224.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/USstock long term_6d97e8151750423601560.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/USstock long term_6d97e8151750423601560.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/USstock long term_6d97e8151750423601560.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/USstock long term_6d97e8151750423601560.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Long-term returns from U.S. stocks track corporate earnings growth. </p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/SP500 Index earnings_5a58479f1750423999059.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/SP500 Index earnings_5a58479f1750423999059.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/SP500 Index earnings_5a58479f1750423999059.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/SP500 Index earnings_5a58479f1750423999059.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Of the last six major military conflicts, four saw U.S. equities bottom out shortly after the event began. The only exceptions—2001 (Afghanistan) and 2022 (Russia-Ukraine)—were tied to non-geopolitical market issues: the dot-com crash and Fed-driven valuation corrections, respectively.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Buy the war_14e7b49b1750423586040.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Buy the war_14e7b49b1750423586040.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Buy the war_14e7b49b1750423586040.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Buy the war_14e7b49b1750423586040.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>History supports buying major dips. From 1928 to 2024, buying at market peaks and holding for 20 years delivered an average return of 634%. Buying after a 20% drawdown? That jumped to 1,036%.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Buy the Dip_a77b89441750423655231.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Buy the Dip_a77b89441750423655231.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Buy the Dip_a77b89441750423655231.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Buy the Dip_a77b89441750423655231.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Investors seem to agree. According to <a class=\"news-link\" data-code=\"BAC\" data-marketid=\"169\" data-position=\"stock.3\" data-stockname=\"Bank Of America\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.3\" href=\"https://www.ainvest.com/stocks/NYSE-BAC/\">Bank of America</a>, $38.1 billion flowed into U.S. equities in the week ending June 17—the highest in three months.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/USStock flow_6b778a7f1750423695803.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/USStock flow_6b778a7f1750423695803.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/USStock flow_6b778a7f1750423695803.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/USStock flow_6b778a7f1750423695803.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Retail traders have demonstrated robust buying activity in recent months, with <a class=\"news-link\" data-code=\"AAAU\" data-marketid=\"171\" data-position=\"stock.2\" data-stockname=\"Goldman Sachs\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/BATS-AAAU/\">Goldman Sachs</a> estimating net purchases of approximately $20 billion in US stocks over the past three months.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/retail investor USStock_c5888be61750423669577.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/retail investor USStock_c5888be61750423669577.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/retail investor USStock_c5888be61750423669577.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/retail investor USStock_c5888be61750423669577.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p></p><p>Foreign ownership of U.S. equities is now near a record high at 18%. </p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/foreign usstock_189e8d6d1750423715611.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/foreign usstock_189e8d6d1750423715611.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/foreign usstock_189e8d6d1750423715611.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/foreign usstock_189e8d6d1750423715611.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Since bottoming in October 2022, the current bull market is now in its third year. Historically, the third year of a bull run tends to underperform, averaging just 2% returns—but if markets survive year three, year four is usually much stronger.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/BULL market year 3_20da7ada1750423843228.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/BULL market year 3_20da7ada1750423843228.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/BULL market year 3_20da7ada1750423843228.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/BULL market year 3_20da7ada1750423843228.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>JPMorgan research shows Stocks bottom 5 months before GDP inflects.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/JPM Stocks bottom 5 months before GDP inflects_d3b4035a1750423760285.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/JPM Stocks bottom 5 months before GDP inflects_d3b4035a1750423760285.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/JPM Stocks bottom 5 months before GDP inflects_d3b4035a1750423760285.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/JPM Stocks bottom 5 months before GDP inflects_d3b4035a1750423760285.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p><strong>Let’s take a look at other charts:</strong></p><p>Going long gold has remained the most crowded trade for three straight months, although June saw some easing. Long Mag 7, short the dollar, and long European stocks followed as the next most crowded trades.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/crowded trade_79575bfc1750423791781.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/crowded trade_79575bfc1750423791781.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/crowded trade_79575bfc1750423791781.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/crowded trade_79575bfc1750423791781.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Enterprise data from fintech firm <a class=\"news-link\" data-code=\"RAMP\" data-marketid=\"169\" data-position=\"stock.4\" data-stockname=\"LiveRamp\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.4\" href=\"https://www.ainvest.com/stocks/NYSE-RAMP/\">Ramp</a> shows that OpenAI is dominating the corporate AI race.</p><p>Using credit card and billing data, Ramp estimates that as of April, 32.4% of U.S. businesses were using OpenAI products—up from 18.9% in January and 28% in March—clearly outpacing rivals. Google’s AI tools have rapidly lost ground, with market share now negligible.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/OpenAI Leader_ea28f04d1750423869046.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/OpenAI Leader_ea28f04d1750423869046.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/OpenAI Leader_ea28f04d1750423869046.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/OpenAI Leader_ea28f04d1750423869046.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Is the AI-driven job loss wave already underway? Big Tech is leading the charge. Amazon CEO Andy Jassy recently said that as the company adopts more generative AI tools and agents, headcount will shrink over time. Microsoft is also conducting similar layoffs.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/MSFT empolyee peak_bc2fb6021750423892869.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/MSFT empolyee peak_bc2fb6021750423892869.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/MSFT empolyee peak_bc2fb6021750423892869.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/MSFT empolyee peak_bc2fb6021750423892869.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>China continues to add to its gold reserves and reduce holdings of U.S. Treasuries.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/China gold USdebt_c612a5771750423932165.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/China gold USdebt_c612a5771750423932165.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/China gold USdebt_c612a5771750423932165.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/China gold USdebt_c612a5771750423932165.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Government jobs are falling: 22,000 federal government jobs were lost in May, the most in at least 4 years. This marks the 4th consecutive monthly decline. Year-to-date, federal government jobs have declined by 59,000, to 2.96 million, the lowest since November 2024.According to Reuters estimates, over 260,000 federal workers have been fired, taken buyouts, or retired early this year.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Government jobs_2f3154a01750423944552.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Government jobs_2f3154a01750423944552.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Government jobs_2f3154a01750423944552.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/Government jobs_2f3154a01750423944552.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Monetary policy should remain tight until the 11% additional inflation we've had since January 2020 above the 2% trendline is erased. There's no point in having an inflation target if you're not going to adhere to it. The Fed should not cut rates at all this year.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/FED NOT rate cut_77f917cd1750423958860.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/FED NOT rate cut_77f917cd1750423958860.png\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/FED NOT rate cut_77f917cd1750423958860.png\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/FED NOT rate cut_77f917cd1750423958860.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Fast food prices are rising fast: McDonald's core products have more than doubled in price over the past decade.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/MCD price_94fdb8f41750424075777.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/MCD price_94fdb8f41750424075777.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/MCD price_94fdb8f41750424075777.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/MCD price_94fdb8f41750424075777.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Foreign investors in Chinese A-shares are heavily overweight artificial intelligence, with 52% of allocations focused there—well ahead of healthcare and high-dividend sectors in second and third place.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/China sector_d622a6fe1750424055312.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/China sector_d622a6fe1750424055312.jpg\" data-v-f7ec1e22=\"\" datajson='{\"type\":\"image\",\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/China sector_d622a6fe1750424055312.jpg\",\"alt\":\"\",\"children\":[{\"text\":\"\"}]}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/China sector_d622a6fe1750424055312.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/charts-paint-1000-words-sectors-outperform-2506/",
            "pub_date": "2025-06-20 21:00:41",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iran Open to Limiting Uranium Enrichment, But Not to Zero; Nuclear Talks Unlikely Until Israeli Ceasefire",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>Iran has expressed conditional openness to curbing its uranium enrichment but firmly rejected any nuclear negotiations while under attack by Israel. A senior Iranian official told Reuters that Tehran is \"ready\" to discuss limits on enrichment but emphasized that \"zero enrichment will undoubtedly be rejected\" by the government—especially in light of Israel’s ongoing military strikes.</p><p>The official added that \"the role of European powers is now more prominent,\" as Tehran refuses to engage directly with the United States during the Israeli assault. Iranian Foreign Minister Abbas Araqchi reinforced this stance on Friday, stating that “there is no room for negotiations with the United States until Israeli aggression stops.”</p><p>European foreign ministers are scheduled to meet with Iranian officials in Geneva on Friday in a bid to de-escalate tensions. Their goal is to coax Iran back into nuclear talks and negotiate a possible rollback of Tehran’s nuclear activities. With the United States sidelined by Iran's refusal to engage, the European Union is hoping to act as a key intermediary.</p><p>The diplomatic push comes amid sustained military action between Israel and Iran. Israeli forces said on Friday they had launched fresh strikes overnight on dozens of Iranian military sites, including missile production facilities and a nuclear-related research center in Tehran.</p><p>In retaliation, Iran fired another wave of missiles early Friday, with some landing near residential apartments, office buildings, and industrial facilities in the southern Israeli city of Beersheba.</p><p>The conflict’s escalation has drawn growing attention from Washington. President Trump reportedly told senior aides earlier this week that he had approved military plans for Iran but was waiting to see whether Tehran would show any willingness to halt its nuclear program. According to White House sources, a decision could come “within two weeks.”</p><p>Secretary of State Marco Rubio met Thursday with his British counterpart to discuss the worsening conflict. A joint statement from the State Department reaffirmed that “Iran can never develop or acquire a nuclear weapon.”</p><img alt=\"\" contenteditable=\"false\" data-json='{\"id\":\"d0474907-5e1d-4cba-81c7-8b39c75c0d2b\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/19a31177-7ace-42e9-bc21-18de0e2994b4_Screenshot0620-2043_76e819f11750423457935.jpg\"}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/19a31177-7ace-42e9-bc21-18de0e2994b4_Screenshot0620-2043_76e819f11750423457935.jpg\" data-v-f7ec1e22=\"\" datajson='{\"id\":\"d0474907-5e1d-4cba-81c7-8b39c75c0d2b\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/19a31177-7ace-42e9-bc21-18de0e2994b4_Screenshot0620-2043_76e819f11750423457935.jpg\"}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/19a31177-7ace-42e9-bc21-18de0e2994b4_Screenshot0620-2043_76e819f11750423457935.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/iran-open-limiting-uranium-enrichment-nuclear-talks-israeli-ceasefire-2506/",
            "pub_date": "2025-06-20 20:50:39",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Meta's AI Push: 49% Stake in Scale AI, 14.3 Billion USD, and Key Hires",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>Meta, the parent company of <a class=\"news-link\" data-code=\"META\" data-marketid=\"185\" data-position=\"stock.2\" data-stockname=\"Meta\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/NASDAQ-META/\">Facebook</a>, has been actively pursuing acquisitions and talent recruitment in the artificial intelligence (AI) sector. In early 2023, <a class=\"news-link\" data-code=\"META\" data-marketid=\"185\" data-position=\"stock.1\" data-stockname=\"Meta\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-META/\">Meta</a> attempted to acquire Safe Superintelligence, a startup founded by the former chief scientist of OpenAI. However, the offer was rejected by the founder. In response, Meta's CEO, Mark Zuckerberg, turned his attention to recruiting key personnel from the startup. Daniel Gross, the CEO and co-founder of Safe Superintelligence, and Nat Friedman, the former CEO of GitHub, were both targeted by Meta. Gross, a seasoned entrepreneur and AI investor, has a notable track record, including the sale of his search engine company Cue to Apple for approximately 40 million USD. Friedman, on the other hand, has a significant presence in Silicon Valley, having co-founded two startups and served as the CEO of GitHub, where he increased the company's valuation from 7.5 billion USD to 16.5 billion USD before leaving in 2021.</p><p>Meta's interest in Safe Superintelligence is part of a broader strategy to bolster its AI capabilities. The company recently acquired a 49% stake in Scale AI for 14.3 billion USD, securing the services of its founder, Alexander Wang. This move is just the beginning of Meta's ambitious plan to recruit top AI talent. The company has also been actively courting researchers from other prominent AI firms, offering competitive compensation packages. OpenAI's CEO, Sam Altman, has acknowledged Meta as a major competitor, noting that Meta has attempted to lure OpenAI employees with significant signing bonuses and high salaries, although these efforts have not been successful so far.</p><p>Meta's aggressive recruitment strategy is not limited to individual hires. The company is also exploring the possibility of investing in NFDG, a venture capital firm co-founded by Gross and Friedman. NFDG has a portfolio that includes several high-profile companies, such as Perplexity AI, Character.ai, and Figma. This investment would further solidify Meta's position in the AI landscape by aligning it with key players in the industry.</p><p>The recruitment of top AI talent is a critical component of Meta's strategy to stay competitive in the rapidly evolving AI sector. By acquiring companies like Scale AI and attempting to acquire Safe Superintelligence, Meta is positioning itself to lead the development of advanced AI technologies. The company's efforts to recruit key personnel from these startups demonstrate its commitment to building a world-class AI team. As Meta continues to invest in AI, it is likely to face stiff competition from other tech giants, including OpenAI and Microsoft, which are also aggressively pursuing AI talent and technologies.</p> <img alt=\"\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1addd8c159020001.png\" style=\"max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/meta-ai-push-49-stake-scale-ai-14-3-billion-usd-key-hires-2506/",
            "pub_date": "2025-06-20 15:50:35",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI Faces 80% Investment Cut as Microsoft Talks Stall",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>OpenAI is urgently restructuring its business to secure a significant investment from SoftBank. In late March, OpenAI announced that SoftBank would lead an investment of 100 billion dollars as seed capital, with a conditional follow-up investment of 300 billion dollars by the end of the year. However, this goal has been hindered by its major shareholder, <a class=\"news-link\" data-code=\"MSFT\" data-marketid=\"185\" data-position=\"stock.1\" data-stockname=\"Microsoft\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-MSFT/\">Microsoft</a>. According to the agreement, if OpenAI fails to restructure into a for-profit entity by December 31, SoftBank's total investment may be reduced to 200 billion dollars.</p><p>Previously, due to legal obstacles, OpenAI abandoned its plan to transform into a for-profit company and instead attempted to restructure as a non-profit entity overseen by a non-profit parent company. This requires Microsoft's support, but unfortunately, sources indicate that negotiations over the new for-profit <a class=\"news-link\" data-code=\"GPCR\" data-marketid=\"185\" data-position=\"stock.2\" data-stockname=\"Structure\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/NASDAQ-GPCR/\">structure</a> have become increasingly contentious and are currently at a stalemate.</p><p>OpenAI is even considering seeking the intervention of antitrust regulatory authorities to review whether there are potential competitive barriers in its agreement with Microsoft that could weaken Microsoft's ability to restrict OpenAI. On Wednesday, it was reported that if the two parties cannot reach an agreement on key issues, Microsoft may withdraw from negotiations with OpenAI. Key issues include Microsoft's future shareholding in OpenAI.</p><p>The two key issues in the negotiations between OpenAI and Microsoft are Microsoft's shareholding ratio in OpenAI after restructuring and the strict regulations on technology sharing between the two parties. It is understood that OpenAI hopes to change the terms of the existing agreement with Microsoft. According to previous agreements, after Microsoft's investment, it obtained a large portion of OpenAI's for-profit business shares, as well as exclusive access to OpenAI's API and models on Microsoft Cloud, revenue sharing, and the right to use OpenAI's intellectual property until 2030.</p><p>Additionally, OpenAI hopes to prevent Microsoft from acquiring the technology obtained from the 30 billion dollar acquisition of the AI coding tool Windsurf. It is reported that Microsoft has proposed giving up its shares in OpenAI in exchange for priority use of OpenAI's technology in the future. According to previous information, Microsoft has also made concessions on the original terms, such as after the Star Gate project was made public, Microsoft gave up its exclusive right to use only Microsoft Cloud services.</p><p>Previously, in a joint statement, Microsoft and OpenAI stated that the two companies have established a long-term, productive partnership, bringing about excellent artificial intelligence tools. Currently, negotiations between the two companies are still ongoing, and both are optimistic that they will continue to work together in the coming years. However, insiders have revealed that if the negotiations ultimately fail, Microsoft is prepared to withdraw its investment. This would not be good news for OpenAI, which is seeking restructuring and facing a lawsuit from co-founder Musk.</p> <img alt=\"\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1addd9bb42420001.png\" style=\"max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/openai-faces-80-investment-cut-microsoft-talks-stall-2506/",
            "pub_date": "2025-06-20 15:50:35",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asia Gold Market: Betting Against the Herd in a Volatile Landscape",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>The gold market has long been a barometer of global risk sentiment, but in Asia—the world's largest consumer of gold—its dynamics are far more nuanced. With prices hitting record highs in 2025 and monsoon rains shaping rural demand, now is the time for contrarian investors to rethink traditional strategies. Let's dissect the inverse relationship between price spikes and demand in India and China, and uncover opportunities in ETFs and mining equities.</p><p><img alt=\"\" data-src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1addee94b6820002.png\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1addee94b6820002.png\" style=\"max-width:100%;\"/></p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">The Monsoon Factor: Rainfall vs. Rural Buying Power</h3><p>The 2025 monsoon season, forecasted at 106% of the long-term average by India's Meteorological Department, has already triggered a split narrative. While timely rains in central and southern India have boosted agricultural incomes—critical for rural gold purchases—soaring prices have introduced a paradox.  </p><p>Historically, a good monsoon correlates with a 5-7% rise in rural income, leading to increased gold buying. However, this year's prices—up 56% year-on-year to ₹95,200 per 10 grams—are pricing out small-town buyers. The result? A surge in recycling (up 25% YTD) as farmers and traders liquidate old jewelry for cash.  </p><p><strong>Contrarian Play</strong>: Short physical gold futures during monsoon-driven rallies (driven by speculative optimism) and buy dips in mining equities like <em>Newmont (NEM)</em> or <em>Barrick Gold (GOLD)</em> when prices correct post-harvest.</p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Currency Volatility: India's INR Weakness and China's Yuan Dynamics</h3><p>Asia's gold demand is deeply tied to currency fluctuations. In India, a weakening rupee (down 8% against the dollar in 2025) amplifies gold's dollar-denominated price, squeezing rural buyers. Meanwhile, China's yuan depreciation has made imports costlier, reducing retail demand despite stable economic growth.  </p><p>The inverse relationship is clear: when the yuan weakens, gold imports drop. This creates a structural tailwind for ETFs like <em>GLD</em> or <em>IAU</em>, which benefit from global inflation fears, even as physical demand falters.</p><p><strong>Contrarian Play</strong>: Use inverse ETFs like <em>DGLD</em> to bet against physical gold during currency crises, while accumulating shares of gold miners with low-cost production (e.g., <em>Kirkland Lake Gold (KL)</em>).</p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Seasonal Cycles: The Festival Effect and Discount Opportunities</h3><p>Asia's gold demand peaks during festivals (Diwali in India, Lunar New Year in China), but this year's high prices may curb enthusiasm. Historically, prices fall 5-8% post-festivals as buyers retreat, creating a buying window for strategic investors.  </p><p>The data shows that dips post-festive periods correlate with inflows into ETFs like <em>SGOL</em> (India's top gold ETF). Miners, too, often trade at discounts to NAV during these periods, offering long-term value.</p><p><strong>Contrarian Play</strong>: Use options to bet on post-festival corrections (e.g., put spreads on <em>GC=F</em> gold futures) while accumulating miners when their shares trade below NAV.</p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Structural Opportunities in ETFs and Mining Equities</h3><p>The inverse price-demand relationship isn't just a short-term phenomenon—it's structural. As physical buyers retreat, institutional investors are piling into gold ETFs, driving flows to records. Meanwhile, mining equities are trading at 10-year lows relative to gold prices, offering leverage to a potential correction.  </p><p><!-- --><br/>When gold prices fall 10%, miners like <em>VanEck Vectors Gold Miners ETF (GDX)</em> typically underperform—but this creates a buying opportunity. A 20% discount to NAV in miners like <em>Polyus (PLZLF)</em> signals a long-term entry point.</p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">The Contrarian Edge: When to Short, When to Buy</h3><p><strong>Short-Term Shorts</strong>:<br/>- <strong>Timing</strong>: During monsoon rallies or geopolitical spikes (e.g., Middle East tensions).<br/>- <strong>Instrument</strong>: Short GLD or use inverse ETFs like <em>DGLD</em>.  </p><p><strong>Long-Term Buys</strong>:<br/>- <strong>Timing</strong>: Post-festival corrections or when mining equities trade at NAV discounts.<br/>- <strong>Instrument</strong>: Accumulate GDX or mining stocks with low all-in sustaining costs.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Risks and Considerations</h3><ul><li><strong>Geopolitical Shocks</strong>: Russia-Ukraine tensions or Middle East conflicts could sustain gold's “fear premium.”  </li><li><strong>Monsoon Disruptions</strong>: Regional dry spells (e.g., in Tamil Nadu) could hurt rural demand despite national averages.  </li><li><strong>Central Bank Policies</strong>: The Fed's rate cuts (expected to 5.50% by Q4) could weaken the dollar and support gold.  </li></ul><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Final Take</h3><p>Asia's gold market is a masterclass in volatility. For contrarians, the key is to bet against the crowd: short physical gold during speculative rallies and buy ETFs/miners when sentiment turns. With prices at record highs and structural demand pressures, 2025 is the year to think differently—and profit from the herd's retreat.  </p><p><em>Investment Thesis</em>:<br/>- <strong>Aggressive Play</strong>: Short GLD at $2,000/oz; cover at $1,800.<br/>- <strong>Conservative Play</strong>: Buy GDX when it trades at a 15% discount to NAV.  </p><p>Stay nimble, and let the data—not the panic—guide your decisions.</p></div></div></div>",
            "link": "https://www.ainvest.com/news/asia-gold-market-betting-herd-volatile-landscape-2506/",
            "pub_date": "2025-06-20 15:40:37",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PRA Group's European Leadership Shift: Can James' Promotion Stabilize Valuation Amid Headwinds?",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>PRA Group (PRA), a global leader in nonperforming loan (NPL) acquisitions, faces a critical juncture as it navigates operational challenges and a leadership transition. The June 2025 promotion of Owen James to President of <a class=\"news-link\" data-code=\"PRAA\" data-marketid=\"185\" data-position=\"stock.2\" data-stockname=\"PRA Group\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/NASDAQ-PRAA/\">PRA Group</a> Europe has positioned him as a potential catalyst to stabilize the company's valuation, which remains under pressure despite record financial metrics. Let's dissect how this strategic move could reshape PRA's trajectory.</p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">The Strategic Move: James' European Playbook</h3><p>James, a 30-year financial services veteran, brings deep expertise in NPL markets, having overseen $3 billion in European portfolio investments since joining PRA in 2012. His new role spans 15 markets in Europe, Canada, and Australia, with a mandate to amplify the region's already strong performance. Under his leadership, European cash collections grew 12.8% in Q1 2025, contributing to a record $7.8 billion in Exposure to Regulatory Capital (ERC)—a key metric reflecting future cash flow potential.  </p><p><img alt=\"\" data-src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1addec032c020001.png\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1addec032c020001.png\" style=\"max-width:100%;\"/></p><p>James' focus on operational efficiency is already yielding results: the company's cash efficiency ratio improved 284 basis points to 60.8% year-over-year. This metric, which measures how effectively PRA converts debt purchases into cash, is critical for offsetting rising debt costs.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">The Operational and Financial Crossroads</h3><p>PRA's Q1 2025 results underscore both opportunities and vulnerabilities. While total cash collections rose 10.7% to $497.4 million, profitability stumbled due to:<br/>1. <strong>U.S. Underperformance</strong>: Tax-refund-driven collections missed expectations, a seasonal driver that historically boosted Q1 results.<br/>2. <strong>Rising Interest Costs</strong>: Interest expenses surged 16.6% to $61 million, driven by debt used to fund portfolio purchases.<br/>3. <strong>ROATE Shortfall</strong>: Return on Average Tangible Equity (ROATE) dropped to 1.9% annualized, far below the 12% target.  </p><p><!-- --></p><p>The company now faces pressure to deleverage. Total liabilities reached $3.87 billion as of Q1, with a debt-to-ERC ratio under scrutiny. Management has emphasized disciplined capital allocation, including $347 million in forward flow commitments to acquire new portfolios. However, execution risks remain: these deals depend on seller delivery schedules and foreign exchange stability.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Why James' Leadership Matters</h3><p>James' promotion reflects PRA's bet on internal expertise to counterbalance these challenges. His track record in optimizing European operations aligns with three strategic priorities:<br/>1. <strong>Deleveraging</strong>: Reducing debt through higher ERC growth (up 20% YoY) and cost discipline.<br/>2. <strong>Geographic Diversification</strong>: Mitigating U.S. market risks by strengthening European and Canadian operations.<br/>3. <strong>ROATE Recovery</strong>: Improving returns via better portfolio selection and collections efficiency.  </p><p>CEO Martin Sjolund, who took the helm in June, has called James “the ideal leader” to execute this vision. The duo's partnership aims to balance growth with financial discipline, a shift from prior years when aggressive debt-fueled acquisitions strained profitability.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Investment Implications: A “Hold” with Catalyst Potential</h3><p>PRA's stock trades at a P/E of 8.16, below its five-year average of 12, suggesting undervaluation. Analysts estimate a 20–50% upside if the P/E expands to 10–12 over two years—a scenario plausible if ROATE improves and ERC growth continues.  </p><p><!-- --></p><p><strong>Risks</strong>:<br/>- <strong>Regulatory headwinds</strong>: Stricter NPL rules in key European markets could limit acquisition opportunities.<br/>- <strong>Macro risks</strong>: Economic slowdowns could reduce recovery rates on purchased debt.<br/>- <strong>Debt management</strong>: High leverage remains a vulnerability if interest rates rise further.  </p><p><strong>Investment Thesis</strong>:<br/>PRA offers a “Hold” rating with asymmetric upside. Investors should watch for two catalysts:<br/>1. <strong>ROATE recovery</strong>: A return to double-digit ROATE would signal operational turnaround.<br/>2. <strong>Debt reduction</strong>: A debt-to-ERC ratio below 50% would ease investor concerns.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Conclusion</h3><p>James' promotion to lead PRA's European division is a bold move to stabilize a company grappling with U.S. underperformance and rising costs. The region's strength in ERC growth and collections efficiency positions it as a linchpin for recovery. While risks remain, PRA's valuation and strategic focus suggest it could be a long-term play for investors willing to tolerate near-term volatility.  </p><p>For now, the stock is a “Hold,” but a successful execution of James' European playbook could reignite investor confidence—and justify a much higher valuation.  </p><p><em>PRA Group's journey underscores a broader theme in financial services: leadership and geographic diversification matter most when navigating debt-driven businesses. James' tenure will test whether PRA can balance growth with profitability—or remain stuck in the doldrums of its own leverage.</em></p></div></div></div>",
            "link": "https://www.ainvest.com/news/pra-group-european-leadership-shift-james-promotion-stabilize-valuation-headwinds-2506/",
            "pub_date": "2025-06-20 15:30:38",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thailand's Political Crossroads: Navigating Volatility for Equity Opportunities",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>Bangkok's financial district, symbolizing Thailand's economic resilience amid political turbulence, with the SET Index ticker in the foreground.<br/><img alt=\"\" data-src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1adde9e619938002.png\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1adde9e619938002.png\" style=\"max-width:100%;\"/></p><p>Thailand's political crisis has sent shockwaves through equity markets, with the SET Index plunging 2.4% in early June as investors grappled with the fragility of Prime Minister Paetongtarn Shinawatra's coalition government. The fallout from her leaked phone call with Cambodian leader Hun Sen—interpreted as a slight to Thailand's military establishment—has exposed the precarious balance between populist politics and the entrenched power of the armed forces. For investors, the question is clear: Is this a short-term storm or a sign of deeper instability?  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Political Dynamics: A Coalition on the Edge</h3><p>Shinawatra's survival hinges on her ability to retain the loyalty of smaller coalition partners, such as the Democrats and Chartthaipattana, after her main ally, Bhumjaithai, withdrew support. While her apology tour—including a public mea culpa to military commander Boonsin Padklang—has bought temporary breathing room, the coalition now holds a razor-thin majority. A <a class=\"news-link\" data-code=\"SNAP\" data-marketid=\"169\" data-position=\"stock.2\" data-stockname=\"Snap\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/NYSE-SNAP/\">snap</a> election looms as a likely outcome if further defections occur.  </p><p>The market's reaction has been swift, with the index down nearly 8% year-to-date, reflecting investor skepticism about the government's capacity to stabilize the economy amid U.S. trade tariffs and slowing tourism. The stakes are high: Shinawatra's Pheu Thai party represents the populist faction of former Prime Minister Thaksin Shinawatra, while the opposition embodies the conservative, pro-military establishment. A prolonged standoff risks deepening economic uncertainty, as seen in the May tourism revenue slump and the threat of higher tariffs.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Sector Analysis: Risks and Resilience</h3><h4 class=\"news-h news-h4\" data-v-6c3e1718=\"\">Tourism: A Sector in Reverse</h4><p>Thailand's tourism sector, once the backbone of its economy, is now a cautionary tale. <!-- --><br/>Despite a post-pandemic rebound, arrivals have stagnated at 36.5 million in 2025 (vs. 40 million pre-pandemic), with Chinese tourists—once a key driver—only at 41% of their 2019 levels. Safety concerns and competition from Southeast Asian rivals like Vietnam have exacerbated the slowdown. May's 18.5% year-on-year revenue drop underscores the fragility of the sector.  </p><p><strong>Investment Takeaway:</strong> Avoid pure-play tourism stocks (e.g., airlines, hotels) until stability returns. However, companies with diversified revenue streams—such as those in wellness tourism or infrastructure projects funded by government stimulus—may offer partial insulation.  </p><h4 class=\"news-h news-h4\" data-v-6c3e1718=\"\">Exports: Tariffs and Structural Challenges</h4><p>The U.S. tariffs on Thai goods, currently at 10% but potentially rising to 36%, are a Sword of Damocles over export-driven sectors. <br/>Automotive and semiconductor firms face immediate pressure, but companies with manufacturing hubs in ASEAN or Mexico could mitigate risks. Meanwhile, agriculture (rice, cassava) struggles with global oversupply.  </p><p><strong>Investment Takeaway:</strong> Seek exporters with geographic diversification or those in niche markets (e.g., luxury goods, medical devices) less exposed to U.S. tariffs.  </p><h4 class=\"news-h news-h4\" data-v-6c3e1718=\"\">Finance: A Buffer Against Uncertainty</h4><p>The financial sector has shown relative resilience, thanks to low inflation and the Bank of Thailand's accommodative policies. <br/>With inflation at just 0.5%, the BOT has room to cut rates further, potentially boosting lending and consumption. Major banks, such as Siam Commercial Bank (SCB) and Krung Thai Bank (KTB), boast strong capital reserves and are less exposed to political volatility.  </p><p><strong>Investment Takeaway:</strong> Financial stocks offer a defensive play. Look for institutions with robust balance sheets and exposure to government infrastructure projects.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Investment Strategy: A Contrarian Play with Safeguards</h3><h4 class=\"news-h news-h4\" data-v-6c3e1718=\"\">Near-Term Risks: Monitor Thresholds</h4><ul><li><strong>Coalition Survival:</strong> If Shinawatra's government collapses before year-end, expect a 5-10% sell-off in the SET Index.  </li><li><strong>Tariff Developments:</strong> A 36% U.S. tariff would trigger a 15-20% decline in export-heavy sectors.  </li><li><strong>Military Involvement:</strong> Any explicit military intervention (e.g., coup rumors) would spook foreign investors.  </li></ul><h4 class=\"news-h news-h4\" data-v-6c3e1718=\"\">Long-Term Opportunity: Mispriced Assets in a Stable Scenario</h4><p>If Shinawatra's coalition holds or a neutral government emerges post-elections, Thailand's undervalued equities could rebound sharply. Key sectors to watch:<br/>1. <strong>Tourism Recovery Plays:</strong> Companies with underpriced assets (e.g., duty-free operators, regional airports) could see a 30-40% upside if Chinese tourism rebounds.<br/>2. <strong>Export Diversification Leaders:</strong> Firms like Advanced Info Service (AIS) or PTT Global Chemical, with ASEAN-centric supply chains, offer defensive exposure.<br/>3. <strong>Financials:</strong> Buy on dips in bank stocks, which trade at 0.8x price/book—well below historical averages.  </p><h4 class=\"news-h news-h4\" data-v-6c3e1718=\"\">Execution Tips:</h4><ul><li><strong>Hedging:</strong> Use put options on the SET Index to protect against downside.  </li><li><strong>Timing:</strong> Wait for confirmation of coalition stability (e.g., budget approval) or U.S.-Thailand tariff talks.  </li><li><strong>Sector Rotation:</strong> Shift into tourism and exports once the political fog lifts, but stay in financials until then.  </li></ul><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\">Conclusion</h3><p>Thailand's political crisis is a classic case of short-term pain vs. long-term value. While near-term volatility will persist, investors with a 12-18-month horizon can capitalize on mispriced assets in tourism, finance, and resilient exporters. The key is to avoid overexposure to pure-play political bets and instead focus on companies with structural advantages and balance sheets capable of weathering the storm. For the bold and patient, this turmoil could be the entry point for a Thai equity rebound in 2026.  </p><p><strong>Risk Thresholds to Watch:</strong><br/>- Coalition stability: Monitor votes on the 2026 budget.<br/>- U.S.-Thailand trade talks: Watch for tariff relief by Q4 2025.<br/>- Military signaling: Avoid positions if coup rumors escalate.  </p><p>Stay vigilant, but don't let the headlines obscure the opportunity.</p></div></div></div>",
            "link": "https://www.ainvest.com/news/thailand-political-crossroads-navigating-volatility-equity-opportunities-2506/",
            "pub_date": "2025-06-20 15:20:34",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Verallia's Control Battle: A Strategic Play or a Fragile Gamble?",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>The tender offer by Kaon V—a vehicle managed by Brazilian asset manager BWGI—for control of French glass giant <a class=\"news-link\" data-code=\"VERA\" data-marketid=\"185\" data-position=\"stock.2\" data-stockname=\"Vera Therapeutics\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/NASDAQ-VERA/\">Verallia</a> has ignited a high-stakes corporate chess match. With a proposed price of €28.30 per share (post-dividend), the move aims to secure a majority stake in a company valued at €1.05 billion based on its current capitalization. But beneath the surface lies a complex web of strategic motives, regulatory hurdles, and shareholder psychology. Let's dissect the implications and opportunities.  </p><p><img alt=\"\" data-src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1adde77425c20002.png\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1adde77425c20002.png\" style=\"max-width:100%;\"/></p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">The Offer: A Fair Deal or a Bargain?</strong></h3><p>The €28.30-per-share price tag, set after detaching the 2024 dividend of €1.70, represents a <strong>20% premium</strong> to Verallia's closing price on May 31, 2025 (€23.58). This premium suggests BWGI sees value in Verallia's undervalued assets—or that it's willing to pay up for control.  </p><p><!-- --><br/><em>Investors should analyze this chart to gauge whether the offer price aligns with historical trends or reflects an undervalued opportunity.</em></p><p>Key to the valuation is Verallia's <strong>operational resilience</strong>. Despite rising energy costs, the company reported €3.5 billion in revenue in 2024, with a robust production capacity of over 16 billion glass bottles annually. Its EBITDA margin of 12% (pre-exceptional items) and strong sustainability credentials—such as its Ecovadis Platinum rating—add long-term appeal.  </p><p>However, the offer's lack of a <strong>success threshold beyond the 50% regulatory hurdle</strong> raises questions. If fewer than 50% of shareholders tender, the offer collapses, leaving Verallia's stock vulnerable to a post-failure sell-off. Conversely, if the threshold is met, the offer reopens for an additional acceptance period—a tactic to pressure holdouts.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Strategic Implications: Why Control Matters</strong></h3><p>BWGI already holds <strong>28.84%</strong> of Verallia, but control (defined as 50%+) allows it to reshape the company's destiny. Potential moves include:<br/>1. <strong>Cost Optimization</strong>: Reducing overhead or renegotiating energy contracts to boost margins.<br/>2. <strong>Growth Prioritization</strong>: Shifting focus to high-margin segments like premium spirits bottles or pharmaceutical glass.<br/>3. <strong>Debt Reduction</strong>: Leveraging BWGI's financial backing to reduce Verallia's net debt (€580 million as of 2024).  </p><p>The offer's terms also include <strong>no squeeze-out</strong> post-acceptance, a concession to reassure shareholders that the company will remain listed and independent. This contrasts with hostile takeovers, signaling BWGI's intent to collaborate with existing management—a stance supported by Verallia's board, which issued a <strong>favorable opinion</strong> after an independent expert (Ledouble) validated the offer's fairness.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Risks and Regulatory Landmines</strong></h3><p>While the AMF has cleared the Response Document (visa no. 25-197), the deal hinges on two critical approvals:<br/>1. <strong>French Foreign Investment Control</strong>: Given BWGI's Brazilian ties, French authorities may scrutinize national security risks.<br/>2. <strong>EU Foreign Subsidies Regulation (FSR)</strong>: The EU could block the deal if it deems BWGI's backing constitutes unfair state aid.  </p><p>A delay or rejection here could unravel the offer. Additionally, <strong>shareholder dynamics</strong> play a role: Bpifrance Participations, owning 7.6% of shares, plans to tender only half its stake. If other major shareholders follow suit, the 50% threshold could slip out of reach.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Investment Outlook: Buy the Dip, or Wait for Clarity?</strong></h3><p>For investors, the offer's timeline—opening on June 23 and closing July 25—creates a <strong>clear catalyst</strong>. Key scenarios:<br/>- <strong>Scenario 1 (Success):</strong> If the 50% threshold is met, shares could rally to €28.30 as holdouts rush to tender.<br/>- <strong>Scenario 2 (Failure):</strong> A missed threshold might send shares plunging, creating a buying opportunity if BWGI revises the offer.  </p><p><strong>Actionable Advice:</strong><br/>- <strong>Holders of Verallia shares</strong>: If your price is below €28.30, consider waiting until the offer closes. If the stock trades at a discount, tendering early locks in the premium.<br/>- <strong>New investors</strong>: Avoid chasing the stock until post-regulatory clarity. If shares dip below €25 pre-approval, it could signal a bargain.<br/>- <strong>Risk-averse stance</strong>: Avoid all-in bets until the FSR and French investment approvals are secured.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Final Verdict</strong></h3><p>The Verallia tender offer is a <strong>high-risk, high-reward proposition</strong>. BWGI's premium price and strategic patience (no squeeze-out) suggest they aim to build a long-term stake, not just acquire control. For shareholders, the offer represents a floor price, but execution risks loom large. Investors should monitor regulatory updates closely and be prepared to pivot if the deal hits obstacles. In a market hungry for tangible value plays, Verallia's glass might yet turn golden—if the pieces fall into place.  </p><p><!-- --><br/><em>This chart could reveal whether the current offer's post-dividend pricing undervalues the stock's income potential.</em></p></div></div></div>",
            "link": "https://www.ainvest.com/news/verallia-control-battle-strategic-play-fragile-gamble-2506/",
            "pub_date": "2025-06-20 15:10:35",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's Central Bank Considers Won-Pegged Stablecoin Amid Foreign Exchange Concerns",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>South Korea’s central bank has indicated a willingness to consider the issuance of a won-pegged stablecoin, marking a significant shift in the region's stance on digital currencies. The central bank's governor expressed that while he is not opposed to the idea of a won-based stablecoin, there are concerns regarding the management of foreign exchange if such a stablecoin were to be issued. The governor highlighted that the ease of exchanging a won-based stablecoin for dollar-based stablecoins could complicate foreign exchange management, suggesting a cautious approach to the implementation of such digital assets.</p><p>The central bank's position on stablecoins reflects a broader trend of regulatory bodies around the world grappling with the implications of digital currencies. Stablecoins, which are designed to maintain a stable value by being pegged to a reserve asset such as a fiat currency, offer potential benefits in terms of financial stability and efficiency. However, they also present challenges, particularly in the context of foreign exchange management and regulatory oversight.</p><p>The central bank's governor emphasized the need for careful consideration and supervision in the issuance of a won-based stablecoin. This stance suggests that while the central bank is open to the idea, it is also mindful of the potential risks and complexities involved. The governor's comments indicate that the central bank would likely play a role in supervising the issuance and management of such stablecoins, ensuring that they comply with regulatory standards and do not disrupt the financial system.</p><p>The potential issuance of a won-based stablecoin could have significant implications for the region's financial landscape. Stablecoins offer a means of facilitating faster and more efficient transactions, which could benefit both consumers and businesses. However, the central bank's concerns about foreign exchange management highlight the need for a balanced approach that considers both the benefits and risks of digital currencies.</p><p>In conclusion, South Korea's central bank has signaled a willingness to consider the issuance of a won-pegged stablecoin, but with a cautious approach that emphasizes the need for careful supervision and management. The central bank's position reflects a broader trend of regulatory bodies around the world grappling with the implications of digital currencies, and highlights the potential benefits and challenges of stablecoins in the financial system.</p> <img alt=\"\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1adde52c5e538002.png\" style=\"max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/south-korea-central-bank-considers-won-pegged-stablecoin-foreign-exchange-concerns-2506/",
            "pub_date": "2025-06-20 15:00:43",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ukraine's 2025 Grain Harvest: A Gamble with Global Markets",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>The stakes are high for Ukraine's 2025 grain harvest. With global food security, commodity prices, and geopolitical tensions hanging in the balance, investors face a complex risk-reward calculus. Let's dissect the data and implications.  </p><p><img alt=\"\" data-src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1adde3245dd38001.png\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1adde3245dd38001.png\" style=\"max-width:100%;\"/></p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">The Wheat Outlook: A Stable Forecast Amid Uncertainty</strong></h3><p>The USDA's June 2025 report projects Ukraine's wheat harvest at <strong>23 million tons</strong>, unchanged from prior estimates. This stability contrasts with a Reuters report suggesting a potential <strong>10% decline</strong> in Ukraine's overall 2025 grain harvest due to weather and ongoing war disruptions. The USDA's confidence in wheat production stems from favorable spring conditions, but investors must weigh this against risks like crop sabotage or infrastructure attacks.  </p><p>Globally, wheat stocks are tightening: ending stocks for 2025/26 are projected to fall to <strong>262.76 million tons</strong>, a 1% drop from the previous year. This creates a <strong>price floor for wheat</strong>, as reduced buffer stocks amplify supply shocks.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Corn: A Declining Trend with Hidden Risks</strong></h3><p>Ukraine's corn harvest for 2024/25 is estimated at <strong>26.8 million tons</strong>, down <strong>15% from the 5-year average</strong>. Planted area has also shrunk by <strong>10%</strong> to 4.1 million hectares, signaling a structural decline. While global corn supplies remain ample, Ukraine's role as a <strong>swing supplier</strong>—filling gaps left by Brazil or Argentina's weather issues—means even a modest shortfall could spike prices.  </p><p>The FAO notes that Ukraine's corn exports have “improved global coarse grain prospects,” but this assumes safe passage through Black Sea ports. With Russia's ongoing naval attacks on Ukrainian grain infrastructure, the risk of a sudden supply squeeze is ever-present.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Barley: The Missing Data Point</strong></h3><p>Barley remains the wild card. No explicit 2025 production estimate is available, but USDA data shows Ukraine's barley exports fell <strong>13%</strong> since 2020/21. The planted area for barley (5.8 million hectares) hints at a potential rebound, but without yield data, investors are flying blind.  </p><p>The FAO's focus on Ukraine's barley's role in global trade—accounting for <strong>18% of world exports</strong>—suggests that even a minor production glitch could disrupt markets.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Geopolitical Overhang: The X-Factor in Commodity Markets</strong></h3><p>The war with Russia is the ultimate wildcard. Even if the harvest meets USDA forecasts, Russia's attacks on Ukrainian ports and railways could limit exports. For example, in 2023, <strong>30% of Ukraine's grain exports</strong> were delayed due to port bottlenecks.  </p><p>Investors must also monitor sanctions and diplomatic developments. A temporary ceasefire or sanctions relief could unlock storage capacity and shipping routes, depressing prices. Conversely, renewed conflict could send prices soaring.  </p><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">Investment Playbook: How to Navigate the Uncertainty</strong></h3><ol><li><strong>Short-Term Traders</strong>:  </li><li><strong>Go long on wheat futures</strong> if geopolitical tensions escalate, betting on supply disruptions.  </li><li><p><strong>Short wheat</strong> if global stocks stay stable and Ukraine's exports normalize.  </p></li><li><p><strong>Corn: A Structurally Bearish Play?</strong></p></li><li><p>Ukraine's declining corn production and global oversupply (driven by Brazil and the U.S.) suggest <strong>corn prices could weaken</strong> unless weather in key producing regions turns sour.  </p></li><li><p><strong>Barley: A Speculative Bet</strong></p></li><li><p>With no production data, barley is a high-risk, high-reward trade. Investors could position for a price spike if Ukrainian exports face sudden disruptions.  </p></li><li><p><strong>Diversify with ETFs</strong></p></li><li>Funds like the <strong>Teucrium Wheat Fund (NW) or the iShares Global Agriculture ETF (AGRI)</strong> offer exposure to grains while spreading risk across commodities.  </li></ol><h3 class=\"news-h news-h3\" data-v-6c3e1718=\"\"><strong data-v-6c3e1718=\"\">The Bottom Line</strong></h3><p>Ukraine's 2025 grain harvest is a high-stakes gamble. While USDA data provides a baseline, geopolitical and logistical risks could amplify volatility. Investors should prioritize <strong>diversification</strong>, <strong>position sizing</strong>, and <strong>dynamic risk management</strong>—especially given the potential for abrupt supply shocks.  </p><p>In this environment, the mantra is clear: <strong>profit from uncertainty, but don't bet the farm on it.</strong></p></div></div></div>",
            "link": "https://www.ainvest.com/news/ukraine-2025-grain-harvest-gamble-global-markets-2506/",
            "pub_date": "2025-06-20 14:50:44",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Triple Witching Day Coming: What Traders Should Prepare for and Stocks with Strategies",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>Friday could mark the arrival of Triple Witching Day, a highly anticipated trading session known for elevated stock market volatility—and potentially lucrative opportunities. In today’s retail-driven environment, this volatility may be amplified further by speculative flows. Here’s everything investors should keep in mind, along with actionable strategies to navigate the day effectively.</p><p>To begin with, Triple Witching Day refers to a major event in the U.S. stock market when stock options, index options, and index futures all expire simultaneously. This phenomenon takes place four times a year, specifically on the third Friday of March, June, September, and December. The term “Triple Witching” is derived from the notion of the \"witching hour,\" a reference to a time of heightened energy and activity. On this day, traders must choose whether to close, roll over, or exercise their expiring contracts, often creating a surge in trading volume and unusual price movements. While “Quadruple Witching” was once a commonly used term—accounting for the expiration of single-stock futures as well—those instruments were phased out in 2020, making \"Triple Witching\" once again the standard phrase.</p><p>This year’s June 20 Triple Witching Day may be one of the most consequential in recent memory. Over $6 trillion in options tied to stocks, ETFs, and indexes are set to expire. Of that, $3.2 trillion in index options—mostly linked to the S&amp;P 500—will expire at the market open, while another $1.9 trillion worth of single-stock and ETF options will expire at the close. Uniquely, this Triple Witching Day falls on the day after a market holiday, the first such occurrence since 2000. This timing could further intensify both volume and volatility.</p><p>Several key stocks are drawing attention ahead of the event. </p><p><strong>Circle (CRCL)</strong>, the issuer of the USDC stablecoin, has quickly become one of 2025’s most impressive IPO stories. Since debuting on June 5 at $31, its shares have skyrocketed over 540%, now trading near $200. On June 18 alone, the stock jumped 34% to $199.59, a new all-time high. The rally was fueled by Senate approval of the GENIUS Act, a regulatory framework for stablecoins that significantly boosted investor confidence. The company’s market capitalization now approaches $50 billion, putting it just behind Coinbase’s $75 billion and Strategy’s $103 billion.</p><p><strong>Tesla (TSLA)</strong> also continues to dominate the options market, especially during periods like Triple Witching. As of June 16, Tesla’s $330 call options expiring on June 20 saw unusually high activity, with 40,739 contracts traded in a single day—equivalent to 7.2% of the company's total options volume. Implied volatility dropped sharply from 63.5 to 53.0, while 67.3% of the contracts were bought, indicating robust participation from retail investors. Remarkably, 80% of the volume came from small accounts. Despite this, Tesla’s fundamentals have weakened. The company’s first-quarter deliveries declined by 13% to 336,681 vehicles, and analysts are generally bearish for the remainder of 2025. Wall Street’s median 12-month price target now stands at $286.14, well below previous highs.</p><p>Another standout name is <strong>CoreWeave (CRWV)</strong>, a rising powerhouse in AI infrastructure. Since its IPO in March, the stock has surged 340%. The company plans to invest a staggering $23 billion in capital expenditures in 2025, catching Wall Street off guard. Although revenue growth has impressed investors, concerns remain over its heavy debt burden. Historically, 85% of its capital expenditures have been financed through debt. On June 17, Bank of America downgraded CoreWeave to neutral but simultaneously raised its price target from $76 to $185—the highest on the Street.</p><p>Triple Witching Days are historically accompanied by spikes in trading volume. On June 21, 2024, total share volume across U.S. exchanges surged to 18 billion, 55% above the three-month average. Intraday volume for the S&amp;P 500 was 30% higher than usual. This effect tends to be more pronounced in individual stocks than in broader indexes. While indices often cluster around major strike prices, individual equities can see far more dramatic price swings. </p><p>In 2021, for instance, the average daily volume of the S&amp;P 500 nearly doubled on Triple Witching Days, increasing from 2.1 million to 4 million shares. Intraday price ranges widened by nearly 7%, and average returns dropped by 0.72% compared to normal trading days. In the most recent Triple Witching Day on March 21, 2025, major indices posted a 60% probability of closing higher—an insightful reference point for traders looking for historical patterns.</p><p>As options near expiration, market makers are forced to adjust their hedging positions, and this can significantly influence the prices of underlying assets. These adjustments tend to intensify during the final hour of trading—often referred to as the actual “witching hour.” One phenomenon commonly observed is known as \"pin risk,\" where a stock’s price settles near a key strike price due to hedging flows aimed at avoiding assignment on in-the-money options. At the same time, brief price inefficiencies can emerge between underlying securities and their derivatives, creating arbitrage opportunities. However, these pricing gaps typically close quickly and require rapid execution and deep market knowledge to exploit effectively.</p><p>Different trading strategies can be employed to capitalize on the unique environment of Triple Witching. Momentum trading is particularly well-suited to the day’s heightened volatility, allowing traders to ride strong upward or downward intraday moves. Scalping is another effective tactic, capitalizing on quick price discrepancies in high-volume names, though it demands technical precision and a strong understanding of market microstructure. Pairs trading may also work well in this environment. For instance, if the broader tech sector is under pressure, traders could long stronger names while shorting weaker peers, taking advantage of temporary dislocations.</p><p>Certain names may warrant more tailored strategies. For <a class=\"news-link\" data-code=\"CRCL\" data-marketid=\"169\" data-position=\"stock.4\" data-stockname=\"Circle\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.4\" href=\"https://www.ainvest.com/stocks/NYSE-CRCL/\">Circle</a>, with its explosive price action and high volatility, investors might consider selling out-of-the-money calls to collect premium, or deploying a straddle to benefit from large moves in either direction. For <a class=\"news-link\" data-code=\"TSLA\" data-marketid=\"185\" data-position=\"stock.2\" data-stockname=\"Tesla\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/NASDAQ-TSLA/\">Tesla</a>, the $330 level stands out as a critical technical zone. Traders might explore underpriced options given the recent drop in implied volatility. For CoreWeave, long-term investors may want to focus on monitoring its partnerships with major AI players like OpenAI, while keeping a close eye on the execution of its capital plan and progress on reducing debt.</p><p>Despite the potential, Triple Witching is not without risks. Liquidity can dry up toward the close, leading to wider bid-ask spreads and greater execution challenges. The temptation to use excessive leverage can backfire easily, especially during volatile sessions. For options buyers, time decay accelerates as expiry approaches, which can quickly erode the value of positions if the market doesn't move decisively in their favor.</p><p>The June 20, 2025, Triple Witching Day presents a unique setup—historic in scale and made even more significant by its timing after a market holiday. From regulatory momentum lifting Circle, to intense options activity around Tesla, and the ongoing AI-driven rally benefiting CoreWeave, each of these stocks offers a distinct thesis and risk-reward profile.</p><p>Ultimately, while short-term trading gains may capture headlines, the greater value of Triple Witching lies in the insights it offers into how derivatives shape market behavior. For investors looking to deepen their understanding of financial markets, observing how these dynamics play out can prove more valuable than any single Friday in June.</p><img alt=\"\" contenteditable=\"false\" data-json='{\"id\":\"cff40ffb-8e38-434c-b287-27df8ab3f143\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/2fc9ad9a-64a4-46ac-90f9-41ece6144581_1001273275039916128-triple witches_6d2b73911750401948053.jpg\"}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/2fc9ad9a-64a4-46ac-90f9-41ece6144581_1001273275039916128-triple witches_6d2b73911750401948053.jpg\" data-v-f7ec1e22=\"\" datajson='{\"id\":\"cff40ffb-8e38-434c-b287-27df8ab3f143\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/2fc9ad9a-64a4-46ac-90f9-41ece6144581_1001273275039916128-triple witches_6d2b73911750401948053.jpg\"}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/2fc9ad9a-64a4-46ac-90f9-41ece6144581_1001273275039916128-triple witches_6d2b73911750401948053.jpg\" style=\"display:block;margin:0 auto;max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/triple-witching-day-coming-traders-prepare-stocks-strategies-2506/",
            "pub_date": "2025-06-20 14:50:43",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump Slams Powell for Not Cutting Rates, Calls Him ‘Destructive’",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>President Donald Trump unleashed a fresh barrage of criticism against Federal Reserve Chair Jerome Powell on Thursday, branding him “destructive” and accusing him of costing the U.S. economy “hundreds of billions of dollars” by refusing to lower interest rates. </p><p>The outburst followed the Fed’s decision on Wednesday to hold its benchmark rate steady at 4.25% to 4.5%, a range unchanged since December. Trump’s remarks, posted on Truth Social, reflect his long-standing frustration with Powell’s reluctance to slash rates despite months of public pressure from the White House.</p><p><strong>Trump’s Relentless Critique</strong></p><p>Trump’s latest tirade was sharp and personal. </p><img alt=\"\" contenteditable=\"false\" data-json='{\"id\":\"87b6d212-0852-4c40-b062-c5eb0e2d5f4e\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/3580ec27-c5b1-4247-a04e-afa1a26aae05_image_6bf352751750383489224.png\"}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/3580ec27-c5b1-4247-a04e-afa1a26aae05_image_6bf352751750383489224.png\" data-v-f7ec1e22=\"\" datajson='{\"id\":\"87b6d212-0852-4c40-b062-c5eb0e2d5f4e\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/3580ec27-c5b1-4247-a04e-afa1a26aae05_image_6bf352751750383489224.png\"}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/3580ec27-c5b1-4247-a04e-afa1a26aae05_image_6bf352751750383489224.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>“Too Late Powell is costing us a fortune,” he wrote, claiming the U.S. should have rates 2.5 percentage points lower to save billions on short-term debt accumulated under the Biden administration. Late Wednesday, he escalated the rhetoric, calling Powell a “real dummy” in a near-midnight post. By Thursday, he doubled down, musing aloud about appointing himself as Fed chair: “I’d do a much better job than these people.”</p><p>The president’s fixation on rate cuts isn’t new. Hours before the Fed’s announcement, Trump preemptively jabbed at Powell outside the White House, saying, “We have a stupid person. Frankly, you probably won’t cut today.” He also pointed to Europe, claiming it had seen “10 cuts” while the U.S. lagged with none, framing Powell as out of touch and politically motivated. Trump has hinted he’ll soon name his pick to replace Powell, whose term ends in May 2026, adding fuel to the ongoing feud.</p><p><strong>The Fed Stands Firm</strong></p><img alt=\"\" contenteditable=\"false\" data-json='{\"id\":\"5b627883-66ef-4ee8-9325-7c97039a8b70\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/c36ef036-1a78-4072-8cc3-2b1ab464d612_image_da0b44ed1750383113314.png\"}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/c36ef036-1a78-4072-8cc3-2b1ab464d612_image_da0b44ed1750383113314.png\" data-v-f7ec1e22=\"\" datajson='{\"id\":\"5b627883-66ef-4ee8-9325-7c97039a8b70\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/c36ef036-1a78-4072-8cc3-2b1ab464d612_image_da0b44ed1750383113314.png\"}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/c36ef036-1a78-4072-8cc3-2b1ab464d612_image_da0b44ed1750383113314.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Powell, unfazed by the president’s broadsides, defended the Fed’s stance after the Federal Open Market Committee’s decision. </p><p>“For the time being, we are well positioned to wait to learn more about the likely course of the economy before considering any adjustments to our policies,” he said. The central bank’s caution reflects a data-driven approach, with officials seeking clearer signs of an economic slowdown before easing monetary policy. Despite Trump’s assertions, markets had widely anticipated the hold, aligning with the Fed’s signals over recent months.</p><p>The current rate range, steady since last December, underscores Powell’s focus on balancing growth and inflation risks. While Trump sees lower rates as a quick fix to boost jobs and ease debt burdens, the Fed appears more concerned with avoiding premature moves that could destabilize an economy still navigating post-pandemic recovery and global uncertainties.</p><p><strong>Weighing the Rate-Cut Debate</strong></p><p>Trump’s push for lower rates carries some economic logic. Cheaper borrowing costs can juice activity across key sectors. In housing, for instance, reduced mortgage rates could spur homebuying and construction, while manufacturers might ramp up investment with easier access to capital. A weaker dollar from rate cuts could also make U.S. exports more competitive, a boon for trade-reliant industries.</p><p>Yet the Fed’s hesitation isn’t baseless. Cutting rates too soon risks overheating an economy that’s shown resilience, potentially igniting inflation that erodes purchasing power. Asset bubbles—think frothy stock or real estate markets—are another worry if cheap money flows unchecked. The central bank’s wait-and-see posture suggests it’s prioritizing stability over short-term stimulus, especially with trade tensions and tariff threats looming as wild cards.</p><p>The international comparison Trump cites is shaky. The European Central Bank has indeed cut rates more aggressively, but the Eurozone faces weaker growth and lower inflation than the U.S. The Fed’s measured approach reflects a stronger domestic backdrop, not a failure of nerve.</p><p><strong>Expert Voices Weigh In</strong></p><img alt=\"\" contenteditable=\"false\" data-json='{\"id\":\"e1761922-4edf-4385-b646-b1e1300b8958\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/cf0cc12d-d03e-4c68-8258-19969506dacb_image_490450e11750383080105.png\"}' data-src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/cf0cc12d-d03e-4c68-8258-19969506dacb_image_490450e11750383080105.png\" data-v-f7ec1e22=\"\" datajson='{\"id\":\"e1761922-4edf-4385-b646-b1e1300b8958\",\"type\":\"image\",\"alt\":\"\",\"children\":[{\"text\":\"\"}],\"src\":\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/cf0cc12d-d03e-4c68-8258-19969506dacb_image_490450e11750383080105.png\"}' src=\"https://cdn.ainvest.com/articles/focusnews/coverimage/content/cf0cc12d-d03e-4c68-8258-19969506dacb_image_490450e11750383080105.png\" style=\"display:block;margin:0 auto;max-width:100%;\"/><p>Former Treasury Secretary Lawrence Summers offered a nuanced take on an interview with reporters. He predicts Trump will tap a “respected” mainstream figure to succeed Powell, despite the president’s bluster. </p><p>“Influenced by the desire not to gratuitously destabilize markets, and by sound voices among Republicans in the Senate, my bet is he’ll pick a reasonable person,” Summers said. Names like Treasury Secretary Scott Bessent and ex-Fed governor Kevin Warsh have surfaced as contenders.</p><p>Summers also cast Trump’s rate-cut crusade as political theater. “He’s setting up a situation where, if we have a recession, he can blame it on something other than his administration’s policies,” he argued. The former Treasury chief pointed to the Fed’s latest forecasts, which hint at a “negative supply shock”—higher inflation and unemployment—possibly tied to Trump’s tariff plans. “It’s rare for the Fed to revise up both inflation and unemployment,” Summers noted. “That’s the tariffs at work, making the Fed’s job tougher.”</p><p>Trump’s trade policies add another layer of complexity. His tariffs on Chinese goods, a signature move, could drive up costs for businesses and consumers, slowing growth while stoking inflation—a stagflationary trap. The Fed’s latest projections reflect this concern, suggesting Powell’s team is bracing for turbulence that could offset any gains from rate cuts. This dynamic may explain why the central bank is holding <a class=\"news-link\" data-code=\"PATK\" data-marketid=\"185\" data-position=\"stock.1\" data-stockname=\"Patrick Industries\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-PATK/\">pat</a>, even as Trump demands action.</p><p><strong>The Bigger Picture</strong></p><p>Trump’s clash with Powell isn’t just about rates—it’s a stress test for the Fed’s independence. The central bank’s ability to act on data, not political whims, has long been a pillar of U.S. economic stability. Trump’s threats to install himself or a loyalist as chair raise the specter of erosion in that autonomy, a move markets would likely punish with volatility.</p><p>For now, the Fed holds the line, betting on patience over populism. Trump’s rhetoric may grab headlines, but Powell’s calculus hinges on numbers—growth, jobs, prices—that don’t bend to Truth Social posts. As the 2024 election nears, this tug-of-war will only sharpen, with implications for monetary policy, investor confidence, and the economic road ahead.</p></div></div></div>",
            "link": "https://www.ainvest.com/news/trump-slams-powell-cutting-rates-calls-destructive-2506/",
            "pub_date": "2025-06-20 09:50:32",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU Probes Musk's $33B X Acquisition for Anti-Competitive Concerns",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>Elon Musk's acquisition of X by his AI startup, xAI, has drawn the attention of EU regulators, who are now scrutinizing the corporate structure of Musk's empire. This move comes months after the deal was finalized, with the EU probing the potential implications of the merger on the market. The acquisition, which involved a significant sum of $33 billion, has raised concerns about the concentration of power and the potential for anti-competitive behavior.</p><p>Musk's companies, which have been on different trajectories, are now under the microscope as regulators seek to ensure that the merger does not stifle competition or harm consumers. The EU's investigation is part of a broader effort to maintain a level playing field in the tech industry, which has seen a wave of consolidation in recent years. The outcome of the probe could have significant implications for Musk's empire, potentially leading to fines or other regulatory actions.</p><p>The scrutiny from EU regulators comes at a time when Musk is also facing challenges in other areas of his business. His robotaxi launch, for instance, has been delayed due to safety concerns, with Musk himself acknowledging that the date could shift. This, coupled with the EU's investigation, highlights the complex regulatory landscape that Musk's companies are navigating.</p><p>The EU's probe into Musk's empire is not an isolated incident. The region has been increasingly active in regulating the tech industry, with recent setbacks for companies like <a class=\"news-link\" data-code=\"GOOG\" data-marketid=\"185\" data-position=\"stock.1\" data-stockname=\"Alphabet\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-GOOG/\">Google</a> in their antitrust battles. The EU's approach to regulation is characterized by a focus on protecting consumers and ensuring fair competition, which has led to a series of high-profile cases against major tech companies.</p><p>The European Commission has reportedly sent a fresh wave of inquiries to X concerning the implications of the March buyout. The deal raised xAI’s value to $80B and effectively placed X under the AI startup’s umbrella. The move raised concern in Brussels that the restructuring could affect the scale of penalties the company may face under the Digital Services Act (DSA).</p><p>Under the DSA, the EU holds the power to fine digital firms for up to 6% of their annual global turnover if they fail to address illegal content, disinformation, or comply with transparency requirements. According to insiders, the European Commission is currently evaluating whether to include revenue from Musk’s other ventures, such as SpaceX, Neuralink, and The Boring Company, when calculating a potential fine against X. By attaching the penalties to the company’s total global revenue, the regulation raises the stakes for large corporations like Musk’s X.</p><p>Regulators have yet to issue their first major penalty under the DSA, and insiders have revealed that a decision regarding X’s case could come before the Commission’s summer recess in August. However, the timeline for the decision remains unclear because the final size or even the rationale for a fine is still being determined. The investigation into X started in 2023 and is a result of multiple suspected DSA breaches, including the platform’s failure to curb disinformation, lapses in transparency for advertisers and researchers, and most notably, the controversial overhaul of its blue checkmark system.</p><p>The European Commission argued that the change to the checkmark policy deviated from established industry norms and contributed to a more opaque information environment. X explained the blue checkmark’s current functionality in a recent attempt to avoid penalties, but it is unclear if it satisfied the Commission’s inquiry. Platforms under DSA scrutiny have the opportunity to make binding commitments to address violations in exchange for leniency. Brussels has thus far shown limited tolerance for superficial fixes. X has yet to respond publicly to the Commission’s latest inquiries.</p><p>The investigation into Musk's acquisition of X by xAI is a reminder of the regulatory challenges that tech companies face in the EU. As the region continues to tighten its grip on the industry, companies like Musk's will need to navigate a complex web of regulations and potential penalties. The outcome of the EU's probe will be closely watched by industry observers and could set a precedent for future mergers and acquisitions in the tech sector.</p> <img alt=\"\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1add7feb51938001.png\" style=\"max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/eu-probes-musk-33b-acquisition-anti-competitive-concerns-2506/",
            "pub_date": "2025-06-20 07:50:39",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. President to Decide on Iran Military Action in Two Weeks",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>The United States President has announced that a decision on whether to take military action against Iran will be made within the next two weeks. This decision comes amidst heightened tensions and the possibility of diplomatic negotiations with Iran. The primary objective is to prevent Iran from enriching uranium and acquiring nuclear weapons. The President has indicated a willingness to explore diplomatic solutions if the opportunity arises.</p><p>The White House has confirmed that the President will be meeting with <a class=\"news-link\" data-code=\"SNFCA\" data-marketid=\"185\" data-position=\"stock.1\" data-stockname=\"Security National\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-SNFCA/\">the National Security</a> Council members daily in the Situation Room to discuss the current conflict between Israel and Iran. These meetings will involve receiving intelligence briefings and considering the potential for U.S. involvement in Israel's actions against Iran.</p><p>The President's spokesperson has emphasized that while the possibility of negotiations with Iran is significant, the final decision on military action will be made within the next two weeks. This period of deliberation is crucial as it allows for the evaluation of all available options, including diplomatic efforts and potential military interventions.</p><p>The President has also mentioned that Iran has expressed interest in direct dialogue with the U.S., which could potentially lead to a resolution through negotiations. This development adds another layer of complexity to the decision-making process, as the administration weighs the benefits of diplomatic engagement against the need for a strong military response.</p><p>The situation remains fluid, with the President's decision expected to have significant implications for regional stability and global security. The coming weeks will be critical as the U.S. navigates this delicate balance between diplomacy and military action.</p><p>In the meantime, the conflict between Iran and Israel shows no signs of abating. A missile launched from Iran struck an Israeli hospital, marking the first such incident since the outbreak of hostilities. This event underscores the escalating risks to civilians on both sides. Israel's aerial assaults on Iranian military targets, including a decommissioned nuclear reactor in the Alak region, continue unabated, further intensifying the crisis.</p><p>As the U.S. contemplates its next move, the international community is ramping up efforts to prevent the conflict from spiraling out of control. The potential for U.S. involvement adds a critical dimension to the ongoing crisis, with the President's decision set to shape the future trajectory of the conflict and its broader implications for the region and beyond.</p> <img alt=\"\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1add5cbcd2820002.png\" style=\"max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/president-decide-iran-military-action-weeks-2506/",
            "pub_date": "2025-06-20 07:50:39",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Senate Delays Russia Sanctions Review Amid Global Tensions",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>The White House has stated that the U.S. President will decide within two weeks whether to attack Iran, amid ongoing tensions between Israel and Iran. The conflict has escalated with Israel reporting that 14 aircraft carrying military equipment have arrived from the U.S. Meanwhile, Iran has deployed over 100 various combat and suicide drones, targeting military objectives in Haifa and Tel Aviv, with a focus on anti-aircraft systems. The Islamic Revolutionary Guard Corps has appointed a new head for its intelligence agency.</p><p>The International Monetary Fund has issued a warning that the Eurozone economy is at risk of stagnation. This comes as the U.S. Senate has delayed the review of new sanctions against Russia. The delay in the sanctions review is seen as a strategic move to allow for further diplomatic efforts and to assess the potential impact on global markets.</p><p>Ukraine's President has expressed readiness for a high-level meeting and is willing to meet with Russian President. Additionally, the President has appointed a new commander for the Ukrainian Army. This move is seen as a strategic decision to strengthen Ukraine's defense capabilities amid ongoing tensions with Russia.</p><p>Several airlines, including United Airlines and <a class=\"news-link\" data-code=\"AAL\" data-marketid=\"185\" data-position=\"stock.1\" data-stockname=\"American Airlines\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-AAL/\">American Airlines</a>, have temporarily suspended flights to the Middle East due to the escalating conflict. This decision is aimed at ensuring the safety of passengers and crew members in the region.</p><p>The delay in the U.S. Senate's review of new sanctions against Russia is seen as a strategic move to allow for further diplomatic efforts and to assess the potential impact on global markets. The sanctions, if implemented, could have significant implications for the global economy, particularly in the energy sector. The delay is also seen as an opportunity for Russia to engage in further diplomatic efforts to resolve the conflict.</p><p>The ongoing conflict between Israel and Iran, as well as the potential for new sanctions against Russia, has raised concerns about the stability of the global economy. The delay in the U.S. Senate's review of new sanctions against Russia is seen as a strategic move to allow for further diplomatic efforts and to assess the potential impact on global markets. The sanctions, if implemented, could have significant implications for the global economy, particularly in the energy sector. The delay is also seen as an opportunity for Russia to engage in further diplomatic efforts to resolve the conflict.</p> <img alt=\"\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1add77ca23138002.png\" style=\"max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/senate-delays-russia-sanctions-review-global-tensions-2506/",
            "pub_date": "2025-06-20 07:50:38",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Polymarket Assigns 89% Probability to GENIUS Act Passage After Senate Approval",
            "description": "<div class=\"news-content\" data-v-0de1024d=\"\" data-v-69445f5d=\"\"><!-- --><div data-v-69445f5d=\"\"><div><p>The online betting platform Polymarket has assigned an 89% probability to the passage of the Guiding and Establishing National Innovation for US Stablecoins, or GENIUS Act. This assessment comes after the US Senate approved the bill on Tuesday, prompting Polymarket to open a betting market for the legislation. The GENIUS Act aims to provide a regulatory framework for stablecoins, which are cryptocurrencies designed to maintain a stable value, often pegged to a reserve asset like the US dollar.</p><p>Polymarket, known as the world's largest prediction market, allows users to bet on the outcome of future events based on their knowledge and insights. The platform's high probability assessment for the GENIUS Act suggests a strong likelihood of its passage, reflecting the current political and regulatory landscape in the US. The bill's approval would mark a significant step in the regulation of stablecoins, which have gained prominence in recent years due to their use in various financial applications, including payments, remittances, and decentralized finance (DeFi) platforms.</p><p>The GENIUS Act seeks to establish clear guidelines for the issuance and management of stablecoins, addressing concerns related to their stability, transparency, and consumer protection. The bill's passage could provide much-needed regulatory clarity for stablecoin issuers and users, fostering innovation and growth in the stablecoin market. However, the bill's <a class=\"news-link\" data-code=\"FATE\" data-marketid=\"185\" data-position=\"stock.2\" data-stockname=\"Fate Therapeutics\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.2\" href=\"https://www.ainvest.com/stocks/NASDAQ-FATE/\">fate</a> remains uncertain, as it still needs to be approved by the US House of Representatives and signed into law by the President.</p><p>The high probability assigned by Polymarket to the GENIUS Act's passage reflects the growing recognition of stablecoins' importance in the financial ecosystem. Stablecoins have emerged as a popular alternative to traditional cryptocurrencies, offering a more stable store of value and a means of exchange for various financial transactions. The GENIUS Act's potential passage could pave the way for further innovation in the stablecoin market, as issuers and users gain greater regulatory certainty.</p><p>Cryptocurrency users are betting on the odds that US legislation to regulate payment stablecoins will move forward, following a crucial vote in the Senate and a public push from President Donald Trump to “get it to [his] desk.”</p><p>It’s unclear whether the bill will have enough support to pass the House in its current form or whether lawmakers could add amendments to address concerns over Trump’s connections to the crypto industry, including World Liberty Financial’s stablecoin, USD1. A majority of senators voted against a similar amendment before the final passage of the GENIUS Act, which moved the legislation to the House.</p><p>Depending on the final shape of the bill, it could open the floodgates for US companies to issue their own stablecoins to settle transactions. Tech giants like <a class=\"news-link\" data-code=\"AAPL\" data-marketid=\"185\" data-position=\"stock.1\" data-stockname=\"Apple\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.1\" href=\"https://www.ainvest.com/stocks/NASDAQ-AAPL/\">Apple</a> and <a class=\"news-link\" data-code=\"GOOG\" data-marketid=\"185\" data-position=\"stock.3\" data-stockname=\"Alphabet\" data-type=\"stock\" data-v-73d4b255=\"\" dataposition=\"stock.3\" href=\"https://www.ainvest.com/stocks/NASDAQ-GOOG/\">Google</a> were reportedly considering their own tokens, and two US senators forwarded questions to Meta on whether the company might have the same plans if the bill were to be signed into law.</p><p>Trump has suggested he will sign the GENIUS Act with “no add ons” if the House were to pass it quickly. Republicans have a slim majority in the chamber and may soon face a floor vote on a bill to establish a crypto market structure framework. The CLARITY Act, which passed out of committee last week, could clarify the roles US financial regulators would have over digital assets.</p><p>Odds on Polymarket do not necessarily offer insight as to whether US lawmakers will pass the bill or Trump will sign it into law. Rather, the platform shows how much some crypto users are willing to wager on one or more particular outcomes.</p> <img alt=\"\" data-v-f7ec1e22=\"\" src=\"https://cdn.ainvest.com/aigc/hxcmp/images/compress-1add762282c20002.png\" style=\"max-width:100%;\"/></div></div></div>",
            "link": "https://www.ainvest.com/news/polymarket-assigns-89-probability-genius-act-passage-senate-approval-2506/",
            "pub_date": "2025-06-20 07:50:38",
            "source": "ainvest",
            "image": "",
            "kind": 1,
            "language": "en"
        }
    ]
}